[
    {
        "entry_requirements": "None",
        "uac_code": "424350",
        "study_level": "Undergraduate",
        "credit_points": "192",
        "description": "The Bachelor of Actuarial Studies / Bachelor of Commerce is a 4 year dual degree program which enables students to complete a depth of study from the actuarial studies program and the option to increase their business knowledge by choosing one or two majors offered in the Bachelor of Commerce at the UNSW Business School.",
        "URL": "/Undergraduate/programs/2020/3155",
        "name": "Actuarial Studies / Commerce",
        "awards": "None",
        "faculty": "unsw business school",
        "faculty_code": "5a3a1d4f4f4d97404aa6eb4f0310c77a",
        "code": "3155",
        "location": "None"
    },
    {
        "entry_requirements": "None",
        "uac_code": "424350",
        "study_level": "Undergraduate",
        "credit_points": "192",
        "description": "The Bachelor of Actuarial Studies / Economics program enables students to complete a depth of study from the actuarial studies program offered by the School of Risk & Actuarial Studies and the economics program offered by the School of Economics in the UNSW Business School.",
        "URL": "/Undergraduate/programs/2020/3588",
        "name": "Actuarial Studies / Economics",
        "awards": "None",
        "faculty": "unsw business school",
        "faculty_code": "5a3a1d4f4f4d97404aa6eb4f0310c77a",
        "code": "3588",
        "location": "None"
    },
    {
        "entry_requirements": "None",
        "uac_code": "424350",
        "study_level": "Undergraduate",
        "credit_points": "192",
        "description": "Actuarial Studies is concerned about more than just mathematics and numbers. It combines study in mathematics, economics, insurance, finance, statistics and programming. This double degree will allow interested students to complement their Actuarial Studies with business analytics.\nThe analytics skill set is one of the core sub-disciplines of the actuarial profession. The data analytics space is a rapidly evolving area with broad reaching applications. The advent of big data has led to an explosion in captured data, analytics approaches and businesses harnessing this data to create new industries or reinvent the way existing industries operate. Pursuing a joint program in Information Systems allows students to build up their business analytics skills. This will assist students to use modelling and data analysis techniques on large data sets to discover predictive patterns and relationships for business use. Solid skills in programming will also assist students during their actuarial career and actuarial employers report an unmet demand for candidates who have proficient business analytics skills.",
        "URL": "/Undergraduate/programs/2020/3671",
        "name": "Actuarial Studies / Information Systems",
        "awards": "None",
        "faculty": "unsw business school",
        "faculty_code": "5a3a1d4f4f4d97404aa6eb4f0310c77a",
        "code": "3671",
        "location": "None"
    },
    {
        "entry_requirements": "None",
        "uac_code": "None",
        "study_level": "Undergraduate",
        "credit_points": "240",
        "description": "This program is not available to international or Defence sponsored students.\n\nThe School of Engineering and Information Technology (SEIT) and the School of Physical, Environmental and Mathematical Sciences (PEMS) offer a dual degree program which qualifies students for two degrees after the equivalent of five years of successful full-time study leading to the award of the degrees Bachelor of Engineering (Aeronautical) (Honours) and Bachelor of Science(BE (Aero) (Hons) BSc). The School of Engineering and Information Technology (SEIT) will administer the program. Students should seek advice from the relevant School Office in the first instance, or from Student Administrative Services, UNSW Canberra.",
        "URL": "/Undergraduate/programs/2020/4480",
        "name": "Aeronautical Engineering (Honours) / Science",
        "awards": "None",
        "faculty": "unsw canberra at adfa",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7ad",
        "code": "4480",
        "location": "None"
    },
    {
        "entry_requirements": "None",
        "uac_code": "422100",
        "study_level": "Undergraduate",
        "credit_points": "192",
        "description": "The Dual degree program, Bachelor of Arts Bachelor of Education (Secondary) is a four-year program (192 UOC) for intending secondary school teachers. The program is a nationally accredited pre-service qualification.\n\nYou will combine studies in two single or one double secondary teaching specialisation(s) from the Bachelor of Arts. The program covers both theoretical and practical aspects of education, including 80 days supervised professional experience in at least two different secondary schools.",
        "URL": "/Undergraduate/programs/2020/4053",
        "name": "Arts / Education (Secondary)",
        "awards": "None",
        "faculty": "arts and social sciences",
        "faculty_code": "d7a56ceb4f0093004aa6eb4f0310c7ac",
        "code": "4053",
        "location": "None"
    },
    {
        "entry_requirements": "None",
        "uac_code": "None",
        "study_level": "Undergraduate",
        "credit_points": "240",
        "description": "This program is not available to international or Defence sponsored students.\n\nThe School of Engineering and Information Technology (SEIT) and the School of Physical, Environmental and Mathematical Sciences (PEMS) offer a dual degree program which qualifies students for two degrees after the equivalent of five years of successful full-time study leading to the award of the degrees Bachelor of Engineering (Civil) (Honours) and Bachelor of Science (BE (Civil) (Hons) BSc).\n\nThe School of Engineering and Information Technology (SEIT) will administer the program. Students should seek advice from the relevant School Office in the first instance, or from Student Administrative Services, UNSW Canberra.",
        "URL": "/Undergraduate/programs/2020/4481",
        "name": "Civil Engineering (Honours) / Science",
        "awards": "None",
        "faculty": "unsw canberra at adfa",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7ad",
        "code": "4481",
        "location": "None"
    },
    {
        "entry_requirements": "None",
        "uac_code": "424100",
        "study_level": "Undergraduate",
        "credit_points": "192",
        "description": "The Bachelor of Commerce/Bachelor of Economics (BCom/BEc) combines the professional orientation of the Bachelor of Economics program with the range of majors available through the Bachelor of Commerce program.\n\nThis combination allows students to gain greater depth and breadth in their business education than is possible in a single degree, providing students with the opportunity to complete majors in up to three business disciplines during their 4 years.\n\nStudents will complete a major in both a selected area of Commerce and the professional discipline of Economics. With approval, students with an appropriate academic record may also enrol in an additional Honours year in the relevant program offered in either the Commerce or Economics component of the combined degree.",
        "URL": "/Undergraduate/programs/2020/3521",
        "name": "Commerce / Economics",
        "awards": "None",
        "faculty": "unsw business school",
        "faculty_code": "5a3a1d4f4f4d97404aa6eb4f0310c77a",
        "code": "3521",
        "location": "None"
    },
    {
        "entry_requirements": "None",
        "uac_code": "424100",
        "study_level": "Undergraduate",
        "credit_points": "192",
        "description": "This 4 year dual program leads to the award of a Bachelor of Commerce/Bachelor of Information Systems (BCom/BIS) and will meet the needs of students who want a strong, focused and highly regarded business degree combined with an Information Systems degree. Organisations value business savvy IS graduates who understand the business and technical issues which surround and impact their information systems. As part of the degree program students will complete a major stream in both Information Systems (IS) and an approved disciplinary stream within the UNSW Business School.\n\nIn selecting their combination of majors, students should note that while there is a wide range of choice, not every combination may be able to be completed in 4 years of full-time study. Students are also not able to take a modern language as their major.",
        "URL": "/Undergraduate/programs/2020/3584",
        "name": "Commerce / Information Systems",
        "awards": "None",
        "faculty": "unsw business school",
        "faculty_code": "5a3a1d4f4f4d97404aa6eb4f0310c77a",
        "code": "3584",
        "location": "None"
    },
    {
        "entry_requirements": "None",
        "uac_code": "None",
        "study_level": "Undergraduate",
        "credit_points": "240",
        "description": "This program is not available to international or Defence sponsored students.\nThe School of Engineering and Information Technology (SEIT) and the School of Physical, Environmental and Mathematical Sciences (PEMS) offer a dual degree program which qualifies students for two degrees after the equivalent of five years of successful full-time study leading to the award of the degrees Bachelor of Engineering (Mech) (Honours) and Bachelor of Science (BE (Mech) (Hons) BSc).\nThe School of Engineering and Information Technology (SEIT) will administer the program. Students should seek advice from the relevant School Office in the first instance, or from Student Administrative Services, UNSW Canberra.",
        "URL": "/Undergraduate/programs/2020/4482",
        "name": "Electrical Engineering (Honours) / Science",
        "awards": "None",
        "faculty": "unsw canberra at adfa",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7ad",
        "code": "4482",
        "location": "None"
    },
    {
        "entry_requirements": "None",
        "uac_code": "425850",
        "study_level": "Undergraduate",
        "credit_points": "240",
        "description": "Students may seek to undertake a five-year full-time dual degree program leading to the award of the degrees of Bachelor of Engineering (Honours) and Bachelor of Science (Computer Science) (BE (Hons) BSc). The Faculty of Engineering administers the program, and delegates administration to the School which offers the Engineering discipline selected. Students should seek advice from the relevant School Office in the first instance, from the Faculty of Engineering, or from the School of Computer Science and Engineering for the Science component.\n\nWith this dual degree program, students take the 168 units of credit core of the Bachelor of Engineering (Honours) 3707 and the 96 units of credit core of the Bachelor of Science (Computer Science) program 3778. Because of the overlap of 24 units of credit of Science courses in both core, the total units of credit required for completion is 240 UOC, rather than 264 UOC (please see Academic Rules below for more details).",
        "URL": "/Undergraduate/programs/2020/3785",
        "name": "Engineering (Honours) / Computer Science",
        "awards": "None",
        "faculty": "engineering",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7af",
        "code": "3785",
        "location": "None"
    },
    {
        "entry_requirements": "None",
        "uac_code": "425402",
        "study_level": "Undergraduate",
        "credit_points": "240",
        "description": "This dual award program is designed to allow students to gain accreditation as both Engineers and Surveyors through students completing the the Civil Engineering stream of the Bachelor of Engineering (Honours) program 3707 in combination with the Bachelor of Surveying 3775. This allows students flexibility in their future careers.\n\nStudents are able to complete the Civil Engineering stream of the Bachelor of Engineering (Hons) program 3707 as well as the surveying core of the Bachelor of Surveying program 3775. Students will be eligible for accreditation as Civil Engineers with Engineers Australia, as well as Surveyors through the Institution of Surveyors NSW and the NSW Board of Surveying and Spatial Information (BOSSI).\n\nStudents should refer to the structure information pages for rules on the single programs and plans:\n3707 Bachelor of Engineering (Honours) - Civil Engineering stream CVENAH3707\n3775 Bachelor of Surveying",
        "URL": "/Undergraduate/programs/2020/3776",
        "name": "Engineering (Honours) / Surveying",
        "awards": "None",
        "faculty": "engineering",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7af",
        "code": "3776",
        "location": "None"
    },
    {
        "entry_requirements": "None",
        "uac_code": "None",
        "study_level": "Undergraduate",
        "credit_points": "240",
        "description": "This program structure applies to students commencing prior to 2019. If you are commencing from 2019 please refer to program 3582 International Studies/Media (Comms & Journalism).\n\nThe Bachelor of International Studies Bachelor of Media (Communication & Journalism) [UNSW BInSt BMedia(C&J)] is a five-year Dual degree. The BInSt BMedia(C&J) provides an opportunity for students to undertake the courses required for the Bachelor of International Studies program, including an approved minor stream, as well as courses from the Bachelor of Media (Communication & Journalism) program.",
        "URL": "/Undergraduate/programs/2020/3475",
        "name": "International Studies / Media (Comm & Journalism)",
        "awards": "None",
        "faculty": "arts and social sciences",
        "faculty_code": "d7a56ceb4f0093004aa6eb4f0310c7ac",
        "code": "3475",
        "location": "None"
    },
    {
        "entry_requirements": "None",
        "uac_code": "422210",
        "study_level": "Undergraduate",
        "credit_points": "240",
        "description": "This program structure applies to students commencing from 2020. If you commenced prior to 2020Â please consult the Handbook for the year in which you started.\n\nThe BInSt BMedia(C&J) provides an opportunity for students to undertake the courses required for the Bachelor of International Studies program, including an approved minor stream, as well as courses from the Bachelor of Media (Communication & Journalism) program.\n\nThis double degree provides graduates with great opportunities to work across a wide range of communication disciplines and fields.",
        "URL": "/Undergraduate/programs/2020/3582",
        "name": "International Studies / Media (Communication and Journalism)",
        "awards": "None",
        "faculty": "arts and social sciences",
        "faculty_code": "d7a56ceb4f0093004aa6eb4f0310c7ac",
        "code": "3582",
        "location": "None"
    },
    {
        "entry_requirements": "None",
        "uac_code": "None",
        "study_level": "Undergraduate",
        "credit_points": "240",
        "description": "This program structure applies to students commencing prior to 2019. If you are commencing from 2019 please refer to program 3577 International Studies/Media (PR & Advertising).\n\nThe Bachelor of International Studies Bachelor of Media (PR & Advertising) [UNSW BInSt BMedia(PR&A)] is a five-year Dual degree. The BInSt BMedia(PR&A) provides an opportunity for students to undertake the courses required for the Bachelor of International Studies program, including an approved minor stream, as well as courses from the Bachelor of Media (PR & Advertising) program.",
        "URL": "/Undergraduate/programs/2020/3476",
        "name": "International Studies / Media (PR and Advertising)",
        "awards": "None",
        "faculty": "arts and social sciences",
        "faculty_code": "d7a56ceb4f0093004aa6eb4f0310c7ac",
        "code": "3476",
        "location": "None"
    },
    {
        "entry_requirements": "None",
        "uac_code": "422220",
        "study_level": "Undergraduate",
        "credit_points": "240",
        "description": "This program structure applies to students commencing from 2020. If you commenced prior to 2020Â please consult the Handbook for the year in which you started.\n\nThe BInSt BMedia(PR&A) provides an opportunity for students to undertake the courses required for the Bachelor of International Studies program, including an approved minor stream, as well as courses from the Bachelor of Media (PR & Advertising) program.\n\nThe Bachelor of Media (PR & Advertising) component is structured to offer a philosophical and cultural foundation in the media studies core as well as conceptual and practical skills in public relations and advertising.\n\nThis double degree provides graduates with great opportunities to work across a wide range of communication disciplines and fields.",
        "URL": "/Undergraduate/programs/2020/3577",
        "name": "International Studies / Media (Public Relations and Advertising)",
        "awards": "None",
        "faculty": "arts and social sciences",
        "faculty_code": "d7a56ceb4f0093004aa6eb4f0310c7ac",
        "code": "3577",
        "location": "None"
    },
    {
        "entry_requirements": "None",
        "uac_code": "422230",
        "study_level": "Undergraduate",
        "credit_points": "240",
        "description": "This program structure applies to students commencing from 2020. If you commenced prior to 2020 please consult the Handbook for the year in which you started.\n\nThe Bachelor of International Studies Bachelor of Media (Screen and Sound Production) [UNSW BInSt BMedia(S&SP)] is a five-year Dual degree. The BInSt BMedia(S&SP) provides an opportunity for students to undertake the courses required for the Bachelor of International Studies program, including an approved minor stream, as well as courses from the Bachelor of Media (Screen and Sound Production) program.",
        "URL": "/Undergraduate/programs/2020/3477",
        "name": "International Studies / Media (Screen and Sound Production)",
        "awards": "None",
        "faculty": "arts and social sciences",
        "faculty_code": "d7a56ceb4f0093004aa6eb4f0310c7ac",
        "code": "3477",
        "location": "None"
    },
    {
        "entry_requirements": "None",
        "uac_code": "None",
        "study_level": "Undergraduate",
        "credit_points": "240",
        "description": "This program is not available to international or Defence sponsored students.\nThe School of Engineering and Information Technology (SEIT) and the School of Physical, Environmental and Mathematical Sciences (PEMS) offer a dual degree program which qualifies students for two degrees after the equivalent of five years of successful full-time study leading to the award of the degrees Bachelor of Engineering (Mech) (Honours) and Bachelor of Science (BE (Mech) (Hons) BSc).\nThe School of Engineering and Information Technology (SEIT) will administer the program. Students should seek advice from the relevant School Office in the first instance, or from Student Administrative Services, UNSW Canberra.",
        "URL": "/Undergraduate/programs/2020/4483",
        "name": "Mechanical Engineering (Honours) / Science",
        "awards": "None",
        "faculty": "unsw canberra at adfa",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7ad",
        "code": "4483",
        "location": "None"
    },
    {
        "entry_requirements": "None",
        "uac_code": "422701",
        "study_level": "Undergraduate",
        "credit_points": "192",
        "description": "This double degree of the Bachelor of Media (Communication & Journalism) and the Bachelor of Arts (UNSW BA) allows you to combine your passion for communication and journalism with in-depth study of a specific area of the arts and humanities.\n\nThe BMedia (Communication & Journalism) component is structured to offer a philosophical and cultural foundation in the media studies core as well as conceptual and practical skills in communication and journalism.\nThe Bachelor of Arts (UNSW BA) is designed to provide you with all the benefits of an education in the Humanities, Social Sciences and the Creative and Performing Arts. The degree is flexible so that you can structure it around your skills, interests and career aspirations. With over 30 areas of study to choose from you will be able to develop knowledge and skills that combine with and complement your communication and journalism studies to give you a distinctive edge as a graduate.\n\nThis double degree provides graduates with great opportunities to work across a wide range of communication disciplines and fields.",
        "URL": "/Undergraduate/programs/2020/3455",
        "name": "Media (Communication and Journalism) / Arts",
        "awards": "None",
        "faculty": "arts and social sciences",
        "faculty_code": "d7a56ceb4f0093004aa6eb4f0310c7ac",
        "code": "3455",
        "location": "None"
    },
    {
        "entry_requirements": "None",
        "uac_code": "422711",
        "study_level": "Undergraduate",
        "credit_points": "192",
        "description": "This double degree of the Bachelor of Media (Public Relations & Advertising) and the Bachelor of Arts (UNSW BA) allows you to combine your passion for public relations and advertising with in-depth study of a specific area of the arts and humanities.\n\nThe B.Media (PR & Advertising) component is structured to offer a philosophical and cultural foundation in the media studies core as well as conceptual and practical skills in public relations and advertising.\n\nThe Bachelor of Arts (UNSW BA) is designed to provide you with all the benefits of an education in the Humanities, Social Sciences and the Creative and Performing Arts. The degree is flexible so that you can structure it around your skills, interests and career aspirations. With over 30 areas of study to choose from you will be able to develop knowledge and skills that combine with and complement your public relations and advertising studies to give you a distinctive edge as a graduate.\n\nThis double degree provides graduates with great opportunities to work across a wide range of communication disciplines and fields.",
        "URL": "/Undergraduate/programs/2020/3487",
        "name": "Media (Public Relations and Advertising) / Arts",
        "awards": "None",
        "faculty": "arts and social sciences",
        "faculty_code": "d7a56ceb4f0093004aa6eb4f0310c7ac",
        "code": "3487",
        "location": "None"
    },
    {
        "entry_requirements": "None",
        "uac_code": "422721",
        "study_level": "Undergraduate",
        "credit_points": "192",
        "description": "This double degree of the Bachelor of Media (Screen & Sound Production) and the Bachelor of Arts (UNSW BA) allows you to combine your passion for screen and sound production with in-depth study of a specific area of the arts and humanities.\n\nThe BMedia (Screen & Sound Production) component is structured to offer a philosophical and cultural foundation in the media studies and film studies core as well as conceptual and practical skills in screen and sound production.\n\nThe Bachelor of Arts (UNSW BA) is designed to provide you with all the benefits of an education in the Humanities, Social Sciences and the Creative and Performing Arts. The degree is flexible so that you can structure it around your skills, interests and career aspirations. With over 30 areas of study to choose from you will be able to develop knowledge and skills that combine with and complement your screen and sound production studies to give you a distinctive edge as a graduate.\n\nThis double degree provides graduates with great opportunities to work across a wide range of communication disciplines and fields",
        "URL": "/Undergraduate/programs/2020/3479",
        "name": "Media (Screen and Sound Production) / Arts",
        "awards": "None",
        "faculty": "arts and social sciences",
        "faculty_code": "d7a56ceb4f0093004aa6eb4f0310c7ac",
        "code": "3479",
        "location": "None"
    },
    {
        "entry_requirements": "None",
        "uac_code": "N/A",
        "study_level": "Undergraduate",
        "credit_points": "240",
        "description": "THIS PROGRAM, MUSIC (HONOURS)/ARTS - 3474, IS FOR STUDENTS WHO ENROLLED IN PROGRAM 3452 BACHELOR OF MUSIC BACHELOR OF ARTS FROM 2016 AND ARE TRANSFERRING INTO HONOURS THROUGH A UNSW INTERNAL PROGRAM TRANSFER.\n\nThe Dual award degree Bachelor of Music (Honours) Bachelor Arts is a five-year program (full-time).\n\nThe Bachelor of Music (Honours) is specifically for high-achieving students already admitted to the Bachelor of Music program. It allows you to spend your final year of study completing a research thesis or a practice-based research project and thesis as well as undertaking discipline specific research training through the coursework component.\n\nIn addition, you will complete 96 UOC from the Bachelor of Arts (BA) program, including an approved Major (60 UOC) and a Minor (24 UOC).",
        "URL": "None",
        "name": "Music (Honours) / Arts",
        "awards": "None",
        "faculty": "arts and social sciences",
        "faculty_code": "d7a56ceb4f0093004aa6eb4f0310c7ac",
        "code": "3474",
        "location": "None"
    },
    {
        "entry_requirements": "None",
        "uac_code": "N/A",
        "study_level": "Undergraduate",
        "credit_points": "240",
        "description": "This program is for students transferring into Honours from Program 3446 Bachelor of Music Bachelor of Education (Secondary) through a UNSW Internal Program Transfer.\nThe Dual award degree program Bachelor of Music (Honours) Bachelor of Education (Secondary) (UNSW BMus (Hons) BEd (Secondary)) is a five-year program (full-time) for intending specialist music teachers.\nThe Bachelor of Music (Honours) is specifically for high-achieving students already admitted to the Bachelor of Music program. It allows Bachelor of Music students to spend their final year of study completing a research thesis or a practice-based research project and thesis as well as undertaking discipline specific research training through the coursework component.\nThe Bachelor of Education (Secondary) is for intending secondary school teachers. The program is a nationally accredited pre-service qualification.\nGraduates of BMus (Hons) BEd (Secondary) are qualified to teach classroom and instrumental/vocal music from Grade 7 to 12.\nThe Bachelor of Music (Honours) enables students to develop skills and knowledge in music as preparation for professional work in areas as diverse as music performance, arranging and composition, studio teaching, research, broadcasting and recording, arts administration, music and arts journalism, and music technology and sound design. It also equips students with discipline specific research skills and may be a pathway into a Higher Degree Research program.\nThe aim of the UNSW BEd (Secondary) is to prepare its graduates for careers as secondary school teachers. It seeks to do this by providing instruction and experience in the areas of educational theory, pedagogy, planning, diversity and management.",
        "URL": "/Undergraduate/programs/2020/3470",
        "name": "Music (Honours) / Education (Secondary)",
        "awards": "None",
        "faculty": "arts and social sciences",
        "faculty_code": "d7a56ceb4f0093004aa6eb4f0310c7ac",
        "code": "3470",
        "location": "None"
    },
    {
        "entry_requirements": "None",
        "uac_code": "N/A",
        "study_level": "Undergraduate",
        "credit_points": "240",
        "description": "This program structure applies to students commencing prior to 2019. If you are commencing from 2019 please refer to program 3594 Music (Honours) /Media (Comms & Journalism).\n\nTHIS PROGRAM IS FOR STUDENTS TRANSFERRING INTO HONOURS FROM PROGRAM 3465 BACHELOR OF MUSIC BACHELOR OF MEDIA (COMMUNICATION & JOURNALISM) THROUGH A UNSW INTERNAL PROGRAM TRANSFER.\n\nThe Dual award degree Bachelor of Music (Honours) Bachelor Media (Comm & Journalism) is a five-year program (full-time).\n\nThe Bachelor of Music (Honours) is specifically for high-achieving students already admitted to the Bachelor of Music program. It allows Bachelor of Music students to spend their final year of study completing a research thesis or a practice-based research project and thesis as well as undertaking discipline specific research training through the coursework component.\n\nThe Bachelor of Media (Communication & Journalism) is designed to provide students with foundational and applied skills, knowledge and capabilities in professional communication and journalism. It equips students to be effective producers and analysts of a wide range of communication practices, informed by a solid understanding of media theory. Relevant career pathways include journalism, corporate and organizational communication, public sector communication and public relations. While specialising in Communication and Journalism, students will also be immersed in the culture and philosophy of media studies through their courses in the media core. Students also access free electives that provide a more general education.",
        "URL": "None",
        "name": "Music (Honours) / Media (Comm & Journalism)",
        "awards": "None",
        "faculty": "arts and social sciences",
        "faculty_code": "d7a56ceb4f0093004aa6eb4f0310c7ac",
        "code": "3466",
        "location": "None"
    },
    {
        "entry_requirements": "None",
        "uac_code": "None",
        "study_level": "Undergraduate",
        "credit_points": "240",
        "description": "This program structure applies to students commencing from 2020. If you commenced prior to 2020Â please consult the Handbook for the year in which you started.\n\nThe Bachelor of Music (Honours) is specifically for high-achieving students already admitted to the Bachelor of Music program. It allows Bachelor of Music students to spend their final year of study completing a research thesis or a practice-based research project and thesis as well as undertaking discipline specific research training through the coursework component.\n\nAn Advanced Entry Scheme is available to suitably qualified applicants. Students admitted into the advanced entry scheme may receive a block credit of up to 36 UOC in Level 1 music courses.\n\nThe first three years of the Bachelor of Music and Bachelor of Music (Honours) are common to both degrees. Before transferring to the Bachelor of Music (Honours) students must successfully complete all core and stream requirements for levels 1-3 of the Bachelor of Music and attain a minimum WAM of 70 in Music courses. Students undertaking the Bachelor of Music (Honours) in Dual mode must complete all core and stream requirements for levels 1-3 (96 UOC) of the Bachelor of Music before proceeding to level 4.\n\nThe Bachelor of Media (Communication & Journalism) component is structured to offer a philosophical and cultural foundation in the media studies core as well as conceptual and practical skills in communication and journalism.\n\nThis double degree provides graduates with great opportunities to work across a wide range of communication disciplines and fields.",
        "URL": "/Undergraduate/programs/2020/3594",
        "name": "Music (Honours) / Media (Communication and Journalism)",
        "awards": "None",
        "faculty": "arts and social sciences",
        "faculty_code": "d7a56ceb4f0093004aa6eb4f0310c7ac",
        "code": "3594",
        "location": "None"
    },
    {
        "entry_requirements": "None",
        "uac_code": "N/A",
        "study_level": "Undergraduate",
        "credit_points": "240",
        "description": "This program structure applies to students commencing prior to 2019. If you are commencing from 2019 please refer to program 3579 Music (Honours)/Media (PR & Advertising).\n\nTHIS PROGRAM IS FOR STUDENTS TRANSFERRING INTO HONOURS FROM PROGRAM 3463 BACHELOR OF MUSIC BACHELOR OF MEDIA (PR & ADVERTISING) THROUGH A UNSW INTERNAL PROGRAM TRANSFER.\n\nThe Dual award degree Bachelor of Music (Honours) Bachelor Media (PR & Advertising) is a five-year program (full-time).\n\nThe Bachelor of Music (Honours) is specifically for high-achieving students already admitted to the Bachelor of Music program. It allows Bachelor of Music students to spend their final year of study completing a research thesis or a practice-based research project and thesis as well as undertaking discipline specific research training through the coursework component.\n\nThe Bachelor of Media (PR and Advertising) is designed to provide students with foundational and applied skills, knowledge and capabilities in public relations and advertising. The program aims to develop communication leaders who inspire innovation and change at all levels of society and adhere to the highest ethical standards. The BMedia (PR and Advertising) program is structured to offer a philosophical and cultural foundation in the media studies core, conceptual and practical skills in public relations and advertising, and access to free electives that provide a more general education.",
        "URL": "None",
        "name": "Music (Honours) / Media (PR and Advertising)",
        "awards": "None",
        "faculty": "arts and social sciences",
        "faculty_code": "d7a56ceb4f0093004aa6eb4f0310c7ac",
        "code": "3467",
        "location": "None"
    },
    {
        "entry_requirements": "None",
        "uac_code": "None",
        "study_level": "Undergraduate",
        "credit_points": "240",
        "description": "This program structure applies to students commencing from 2020. If you commenced prior to 2020Â please consult the Handbook for the year in which you started.\n\nThe Bachelor of Music (Honours) is specifically for high-achieving students already admitted to the Bachelor of Music program. It allows Bachelor of Music students to spend their final year of study completing a research thesis or a practice-based research project and thesis as well as undertaking discipline specific research training through the coursework component.\n\nAn Advanced Entry Scheme is available to suitably qualified applicants. Students admitted into the advanced entry scheme may receive a block credit of up to 36 UOC in Level 1 music courses.\n\nThe first three years of the Bachelor of Music and Bachelor of Music (Honours) are common to both degrees. Before transferring to the Bachelor of Music (Honours) students must successfully complete all core and stream requirements for levels 1-3 of the Bachelor of Music and attain a minimum WAM of 70 in Music courses. Students undertaking the Bachelor of Music (Honours) in Dual mode must complete all core and stream requirements for levels 1-3 (96 UOC) of the Bachelor of Music before proceeding to level 4.\n\nThe Bachelor of Media (PR & Advertising) component is structured to offer a philosophical and cultural foundation in the media studies core as well as conceptual and practical skills in public relations and advertising.\n\nThis double degree provides graduates with great opportunities to work across a wide range of communication disciplines and fields.",
        "URL": "None",
        "name": "Music (Honours) / Media (Public Relations and Advertising)",
        "awards": "None",
        "faculty": "arts and social sciences",
        "faculty_code": "d7a56ceb4f0093004aa6eb4f0310c7ac",
        "code": "3579",
        "location": "None"
    },
    {
        "entry_requirements": "None",
        "uac_code": "N/A",
        "study_level": "Undergraduate",
        "credit_points": "240",
        "description": "THIS PROGRAM IS FOR STUDENTS TRANSFERRING INTO HONOURS FROM PROGRAM 3464 BACHELOR OF MUSIC BACHELOR OF MEDIA (SCREEN AND SOUND PRODUCTION) THROUGH A UNSW INTERNAL PROGRAM TRANSFER.\n\nThe Dual award degree Bachelor of Music (Honours) Bachelor Media (Screen & Sound Production) is a five-year program (full-time).\n\nThe Bachelor of Music (Honours) is specifically for high-achieving students already admitted to the Bachelor of Music program. It allows Bachelor of Music students to spend their final year of study completing a research thesis or a practice-based research project and thesis as well as undertaking discipline specific research training through the coursework component.\n\nThe Bachelor of Media (Screen and Sound Production) is designed to provide students with foundational and applied skills, knowledge and capabilities relevant to career pathways in a broad range of audio-visual, digital and screen production industries. The emphasis is on the acquisition of relevant creative and professional skills relevant to current media industry contexts, along with a sophisticated conceptual understanding of the increasingly convergent role of media and film in contemporary societies.",
        "URL": "/Undergraduate/programs/2020/3468",
        "name": "Music (Honours) / Media (Screen and Sound Production)",
        "awards": "None",
        "faculty": "arts and social sciences",
        "faculty_code": "d7a56ceb4f0093004aa6eb4f0310c7ac",
        "code": "3468",
        "location": "None"
    },
    {
        "entry_requirements": "None",
        "uac_code": "422501",
        "study_level": "Undergraduate",
        "credit_points": "240",
        "description": "This program is for students commencing from 2016. Students commencing prior to 2016 should refer to program 3456 Bachelor of Music / Bachelor of Arts.\n\nThe Dual award degree Bachelor of Music Bachelor of Arts (BMus BA) is a five-year program (full-time) that offers intensive pre-professional training in one of four streams: Music Creative Practice, Music Inquiry, Sonic Arts and Music Pedagogy. All streams are supported by a variety of large and small, western and non-western music ensembles as well as extensive opportunities for developing musicianship skills.\n\nIn addition, you will complete 96 UOC from the Bachelor of Arts (BA) program, including an approved Major (60 UOC) and a Minor (24 UOC).\n\nAdmission to the program is subject to a satisfactory music audition and an acceptable level of attainment in year 12 music studies or equivalent.\n\nAn Advanced Entry Scheme is available to suitably qualified applicants. Students admitted into the advanced entry scheme may receive a block credit of up to 36 uoc in Level 1 music courses.",
        "URL": "/Undergraduate/programs/2020/3452",
        "name": "Music / Arts",
        "awards": "None",
        "faculty": "arts and social sciences",
        "faculty_code": "d7a56ceb4f0093004aa6eb4f0310c7ac",
        "code": "3452",
        "location": "None"
    },
    {
        "entry_requirements": "None",
        "uac_code": "422502",
        "study_level": "Undergraduate",
        "credit_points": "240",
        "description": "The Dual award degree program Bachelor of Music Bachelor of Education (Secondary) (UNSW BMusic BEd (Secondary)) is a five-year program (full-time) for intending specialist music teachers. Graduates of BMusic BEd (Secondary) are qualified to teach classroom and instrumental/vocal music from Grade 7 to 12.\n\nThe BMusic offers intensive pre-professional training in one of four Streams: Music Creative Practice, Musicology, Sonic Arts, and Music Pedagogy. All streams are supported by a variety of large and small, western and non-western music ensembles as well as extensive opportunities for developing musicianship skills.\n\nAdmission to the program is subject to a satisfactory music audition and an acceptable level of attainment in year 12 music studies or equivalent.\n\nAn Advanced Entry Scheme is available to suitably qualified applicants. Students admitted into the advanced entry scheme may receive a block credit of up to 36 UOC in Level 1 music courses.",
        "URL": "/Undergraduate/programs/2020/3446",
        "name": "Music / Education (Secondary)",
        "awards": "None",
        "faculty": "arts and social sciences",
        "faculty_code": "d7a56ceb4f0093004aa6eb4f0310c7ac",
        "code": "3446",
        "location": "None"
    },
    {
        "entry_requirements": "None",
        "uac_code": "422503",
        "study_level": "Undergraduate",
        "credit_points": "240",
        "description": "This program structure applies to students commencing prior to 2019. If you are commencing from 2019 please refer to program 3583 Music/Media (Comms & Journalism).\n\nThe Dual award degree Bachelor of Music Bachelor of Media (Communication & Journalism) [BMus BMedia(C&J)] is a five-year program (full-time) that offers intensive pre-professional training in one of four streams: Music Creative Practice, Musicology, Sonic Arts and Music Pedagogy. All streams are supported by a variety of large and small, western and non-western music ensembles as well as extensive opportunities for developing musicianship skills.\n\nThe Bachelor of Media (Communication & Journalism) is designed to provide students with foundational and applied skills, knowledge and capabilities in professional communication and journalism. It equips students to be effective producers and analysts of a wide range of communication practices, informed by a solid understanding of media theory. Relevant career pathways include journalism, corporate and organizational communication, public sector communication and public relations. While specialising in Communication and Journalism, students will also be immersed in the culture and philosophy of media studies through their courses in the media core. Students also access free electives that provide a more general education.",
        "URL": "None",
        "name": "Music / Media (Comm & Journalism)",
        "awards": "None",
        "faculty": "arts and social sciences",
        "faculty_code": "d7a56ceb4f0093004aa6eb4f0310c7ac",
        "code": "3465",
        "location": "None"
    },
    {
        "entry_requirements": "None",
        "uac_code": "None",
        "study_level": "Undergraduate",
        "credit_points": "240",
        "description": "This program structure applies to students commencing from 2020. If you commenced prior to 2020Â please consult the Handbook for the year in which you started.\n\nThis double degree Bachelor of Music Bachelor of Media (Communication & Journalism) [BMus BMedia(C&J)] is a five-year program (full-time) that offers intensive pre-professional training in one of four streams: Music Creative Practice, Musicology, Sonic Arts and Music Pedagogy. All streams are supported by a variety of large and small, western and non-western music ensembles as well as extensive opportunities for developing musicianship skills.\n\nAn Advanced Entry Scheme is available to suitably qualified applicants. Students admitted into the advanced entry scheme may receive a block credit of up to 36 UOC in Level 1 music courses.\n\nThe Bachelor of Media (Communication & Journalism) component is structured to offer a philosophical and cultural foundation in the media studies core as well as conceptual and practical skills in communication and journalism.\n\nThis double degree provides graduates with great opportunities to work across a wide range of communication disciplines and fields.",
        "URL": "/Undergraduate/programs/2020/3583",
        "name": "Music / Media (Communication and Journalism)",
        "awards": "None",
        "faculty": "arts and social sciences",
        "faculty_code": "d7a56ceb4f0093004aa6eb4f0310c7ac",
        "code": "3583",
        "location": "None"
    },
    {
        "entry_requirements": "None",
        "uac_code": "422504",
        "study_level": "Undergraduate",
        "credit_points": "240",
        "description": "This program structure applies to students commencing prior to 2019. If you are commencing from 2019 please refer to program 3578 Music/Media (PR & Advertising).\n\nThe Dual award degree Bachelor of Music Bachelor of Media (PR & Advertising) [BMus BMedia(PR&A)] is a five-year program (full-time) that offers intensive pre-professional training in one of four streams: Music Creative Practice, Musicology, Sonic Arts and Music Pedagogy. All streams are supported by a variety of large and small, western and non-western music ensembles as well as extensive opportunities for developing musicianship skills.\n\nThe Bachelor of Media (PR and Advertising) is designed to provide students with foundational and applied skills, knowledge and capabilities in public relations and advertising. The program aims to develop communication leaders who inspire innovation and change at all levels of society and adhere to the highest ethical standards. The BMedia (PR and Advertising) program is structured to offer a philosophical and cultural foundation in the media studies core, conceptual and practical skills in public relations and advertising, and access to free electives that provide a more general education.",
        "URL": "/Undergraduate/programs/2020/3463",
        "name": "Music / Media (PR and Advertising)",
        "awards": "None",
        "faculty": "arts and social sciences",
        "faculty_code": "d7a56ceb4f0093004aa6eb4f0310c7ac",
        "code": "3463",
        "location": "None"
    },
    {
        "entry_requirements": "None",
        "uac_code": "None",
        "study_level": "Undergraduate",
        "credit_points": "240",
        "description": "This program structure applies to students commencing from 2020. If you commenced prior to 2020Â please consult the Handbook for the year in which you started.\n\nThis double degree Bachelor of Music Bachelor of Media (PR & Advertising) [BMus BMedia(PR&A)] is a five-year program (full-time) that offers intensive pre-professional training in one of four streams: Music Creative Practice, Musicology, Sonic Arts and Music Pedagogy. All streams are supported by a variety of large and small, western and non-western music ensembles as well as extensive opportunities for developing musicianship skills.\n\nAn Advanced Entry Scheme is available to suitably qualified applicants. Students admitted into the advanced entry scheme may receive a block credit of up to 36 UOC in Level 1 music courses.\n\nThe Bachelor Media (PR & Advertising) component is structured to offer a philosophical and cultural foundation in the media studies core as well as conceptual and practical skills in public relations and advertising.\n\nThis double degree provides graduates with great opportunities to work across a wide range of communication disciplines and fields.",
        "URL": "/Undergraduate/programs/2020/3578",
        "name": "Music / Media (Public Relations and Advertising)",
        "awards": "None",
        "faculty": "arts and social sciences",
        "faculty_code": "d7a56ceb4f0093004aa6eb4f0310c7ac",
        "code": "3578",
        "location": "None"
    },
    {
        "entry_requirements": "None",
        "uac_code": "422505",
        "study_level": "Undergraduate",
        "credit_points": "240",
        "description": "The Dual award degree Bachelor of Music Bachelor of Media (Screen and Sound Production) [BMus BMedia(S&SP)] is a five-year program (full-time) that offers intensive pre-professional training in one of four streams: Music Creative Practice, Musicology, Sonic Arts and Music Pedagogy. All streams are supported by a variety of large and small, western and non-western music ensembles as well as extensive opportunities for developing musicianship skills.\n\nThe Bachelor of Media (Screen and Sound Production) is designed to provide students with foundational and applied skills, knowledge and capabilities relevant to career pathways in a broad range of audio-visual, digital and screen production industries. The emphasis is on the acquisition of relevant creative and professional skills relevant to current media industry contexts, along with a sophisticated conceptual understanding of the increasingly convergent role of media and film in contemporary societies.",
        "URL": "/Undergraduate/programs/2020/3464",
        "name": "Music / Media (Screen and Sound Production)",
        "awards": "None",
        "faculty": "arts and social sciences",
        "faculty_code": "d7a56ceb4f0093004aa6eb4f0310c7ac",
        "code": "3464",
        "location": "None"
    },
    {
        "entry_requirements": "None",
        "uac_code": "422401",
        "study_level": "Undergraduate",
        "credit_points": "264",
        "description": "The Bachelor of Social Work (Honours) Bachelor of Arts (BSW Hons BA) is a 5.5-year Dual degree. The BSW Hons BA provides an opportunity for you to undertake the courses required for the Bachelor of Social Work (Honours) program, as well as courses from the Bachelor of Arts program, including an approved major and minor stream, providing you with all the benefits of an education in the Humanities, Social Sciences and the Creative and Performing Arts.",
        "URL": "/Undergraduate/programs/2020/4045",
        "name": "Social Work (Honours) / Arts",
        "awards": "None",
        "faculty": "arts and social sciences",
        "faculty_code": "d7a56ceb4f0093004aa6eb4f0310c7ac",
        "code": "4045",
        "location": "None"
    },
    {
        "entry_requirements": "None",
        "uac_code": "422403",
        "study_level": "Undergraduate",
        "credit_points": "240",
        "description": "This program only applies to students commencing 2014 onwards.\nStudents who commenced their program before 2014 should refer to the 4039 Social Work/Criminology & Criminal Justice 2013 Online Handbook\nThe Bachelor of Social Work (Honours) Bachelor of Criminology & Criminal Justice (BSW Hons BCCJ) is a five-year Dual degree. The BSW Hons BCCJ provides an opportunity for students to undertake courses required for the BSW Hons program, as well as the core program of study in Criminology & Criminal Justice, applied social research and policy analysis.",
        "URL": "/Undergraduate/programs/2020/4034",
        "name": "Social Work (Honours) / Criminology & Criminal Justice",
        "awards": "None",
        "faculty": "arts and social sciences",
        "faculty_code": "d7a56ceb4f0093004aa6eb4f0310c7ac",
        "code": "4034",
        "location": "None"
    },
    {
        "entry_requirements": "None",
        "uac_code": "422402",
        "study_level": "Undergraduate",
        "credit_points": "264",
        "description": "This program is for students commencing from 2016.\n\nStudents commencing prior to 2016 should refer to the program rules for the year they started.\n\nThe Bachelor of Social Work (Honours) Bachelor of Social Research and Policy (BSW Hons BSRP) is a 5.5-year Dual degree. The BSW Hons BSRP provides an opportunity for students to undertake the courses required for the Bachelor of Social Work (Honours) program, as well as the core program of study in social science, policy analysis and research methods, including a major in a particular social science discipline.",
        "URL": "/Undergraduate/programs/2020/4044",
        "name": "Social Work (Honours) / Social Research and Policy",
        "awards": "None",
        "faculty": "arts and social sciences",
        "faculty_code": "d7a56ceb4f0093004aa6eb4f0310c7ac",
        "code": "4044",
        "location": "None"
    }
]