[
    {
        "entry_requirements": "None",
        "uac_code": "424300",
        "study_level": "Undergraduate",
        "credit_points": "144",
        "description": "The Actuarial Studies program serves as a foundation for students who wish to enter the actuarial profession.Â Students must achieve the required academic standard in their Actuarial Studies courses to gain exemption fromÂ the Foundation Program of the Actuaries Institute professional examinations, the Core Principles courses of the Institute and Faculty of Actuaries (UK) professional examinations, and the Validation by Educational Experience (VEE) credit for the Society of Actuaries (USA) and Casualty Actuarial Society (USA).Â Â StudentsÂ (esp. Actuarial Studies (Co-op) students and dual degree students)Â may also be eligible to gain exemption from the university accreditation components of the Associate Program of the Actuaries Institute professional examinations.",
        "URL": "/Undergraduate/programs/2020/3586",
        "name": "Actuarial Studies",
        "awards": "Bachelor of Actuarial Studies - BActSt",
        "faculty": "unsw business school",
        "faculty_code": "5a3a1d4f4f4d97404aa6eb4f0310c77a",
        "code": "3586",
        "location": "Kensington"
    },
    {
        "entry_requirements": "None",
        "uac_code": "424620",
        "study_level": "Undergraduate",
        "credit_points": "192",
        "description": "Please note: Entry into this program is open to domestic students only.\nThe  Bachelor of Actuarial Studies (Co-op) (BActSt (Co-op)) is a highly valued and unique business qualification. It provides high-achieving students with a strong, 4-year academic program, integrated with fully assessable industry placement experiences that enable students to work with some of Australia's leading employers.\nThe BActSt(Co-op) combines the requirements of the degree with 15 months of coordinated industrial experience at three different sponsoring organisations. Industrial training extends outside university semesters.\nA scholarship is payable from funds donated by the sponsoring organisations, and entry to the program is limited to students awarded a scholarship through the BActSt(Co-op) selection procedures administered by the Co-op Program Office. For baseline requirements to the UNSW Co-op program visit the future students page.\nProgram benefits:\nHighly regarded by industryProvides students with the fundamentals of business and the option to explore their interestsPrepares students academically, technically and professionallyEquips students with the skills and knowledge to pursue a variety of career optionsAllows students to qualify for professional accreditation in a range of areas.\nActuarial Studies involves the application of statistical and financial analysis and risk models to management in general, life and health insurance, superannuation, investment and finance.\nThe Actuarial Studies program serves as a foundation for students who wish to enter the actuarial profession.Â Students must achieve the required academic standard in their Actuarial Studies courses to gain exemption fromÂ the Foundation Program of the Actuaries Institute professional examinations, the Core Principles courses of the Institute and Faculty of Actuaries (UK) professional examinations, and the Validation by Educational Experience (VEE) credit for the Society of Actuaries (USA) and Casualty Actuarial Society (USA).Â Â StudentsÂ (esp. Actuarial Studies (Co-op) students and dual degree students)Â may also be eligible to gain exemption from the university accreditation components of the Associate Program of the Actuaries Institute professional examinations.\nThe actuarial program of study also aims to develop the use of judgement and to provide the necessary combination of mathematical, statistical, accounting, economic, financial, demographic, analytical and quantitative modelling skills for a rewarding career in the financial services industry. Employers in the financial services industry â\u0080\u0093 including banks, insurers and consultants â\u0080\u0093 value the rigorous quantitative risk training in the Actuarial Studies major.",
        "URL": "/Undergraduate/programs/2020/3587",
        "name": "Actuarial Studies (Co op)",
        "awards": "Bachelor of Actuarial Studies (Co op) - BActSt (Co-op)",
        "faculty": "unsw business school",
        "faculty_code": "5a3a1d4f4f4d97404aa6eb4f0310c77a",
        "code": "3587",
        "location": "Kensington"
    },
    {
        "entry_requirements": "To be admitted into the Bachelor Actuarial Studies (Honours) program, a student must have completed a pass degree, normally the Bachelor of Actuarial Studies degree or equivalent. A student in a dual degree may gain entry to the Bachelor Actuarial Studies (Honours) prior to completing the requirements for the dual degree program if they have completed 144 UOC including all requirements for the relevant major. Students who have completed a non-business degree with a major in one of the specified business areas, or a specified cognate area, may be eligible to complete honours within this program.\nIn addition to the above requirements set by the UNSW Business School for enrolment in the program, the School of Risk and Actuarial Studies expects applicants to:\n\nBe eligible for exemption from all Part I courses from the Actuaries Institute;\nHave a weighted average mark (WAM) of at least 80 in all core actuarial courses (the core courses are the ones that are considered for the purpose of exemption from the Part I examinations of the Actuaries Institute) in the degree in which they are currently enrolled;\nHave a weighted average mark (WAM) of at least 80 in the degree in which they are currently enrolled.\n\nStudents who have failed a course within their pass degree will not gain entry to the Bachelor of Actuarial Studies (Honours) program.\nThe availability and willingness of a supervisor to work with the candidate is another important criterion for successful admission to the program. The number of students accepted to the Bachelor of Actuarial Studies (Honours) program is dependent on the availability of supervisors in the school. If there are more applicants than the school can accommodate, admission will be determined according to students' academic merit. Hence meeting the academic requirements of the program does not guarantee a place in the program. Mid-year entry is not permitted.\nSee Additional Information below for details on How to Apply.",
        "uac_code": "None",
        "study_level": "Undergraduate",
        "credit_points": "48",
        "description": "The Bachelor of Actuarial Studies (Honours) is a one year advanced undergraduate degree for high-achieving students which may be undertaken upon completion of the requirements of an undergraduate pass degree. The program enables students to expand and deepen their understanding of actuarial studies and develop highly sought after analytical, problem solving and research skills through undertaking a significant independent research thesis. The program may be a pathway into a PhD.\nProgram Benefits:\nCompetitive advantage, higher chances of immediately getting employed upon completion, increased career options - either in academia, business, government or applied research through gaining:\nAdvanced analytical and problem solving skills required for specialist careers in business and government.Highly sought after research, project management and communication skills in as well as advanced knowledge of the relevant discipline.",
        "URL": "/Undergraduate/programs/2020/4520",
        "name": "Actuarial Studies (Honours)",
        "awards": "Bachelor of Actuarial Studies (Honours) - BActSt (Hons)",
        "faculty": "unsw business school",
        "faculty_code": "5a3a1d4f4f4d97404aa6eb4f0310c77a",
        "code": "4520",
        "location": "Kensington"
    },
    {
        "entry_requirements": "None",
        "uac_code": "429300",
        "study_level": "Undergraduate",
        "credit_points": "192",
        "description": "The Advanced Mathematics degree is aimed at high achieving students who wish to specialise in mathematics as a basis for the increasing range of quantitative careers in areas such as finance, environmental modelling and research. This four-year degree combines advanced coursework with an Honours-level research project in one of the available plans of study. UNSW offers mathematics students advanced facilities combined with innovative teaching. This program has been designed to cater for the specific abilities and interests of talented students with a superior ATAR.",
        "URL": "/Undergraduate/programs/2020/3956",
        "name": "Advanced Mathematics (Honours)",
        "awards": "Bachelor of Science (Advanced Mathematics) (Honours) - BSc(AdvMath)(Hons)",
        "faculty": "science",
        "faculty_code": "57a56ceb4f0093004aa6eb4f0310c7ae",
        "code": "3956",
        "location": "Kensington"
    },
    {
        "entry_requirements": "None",
        "uac_code": "429350",
        "study_level": "Undergraduate",
        "credit_points": "192",
        "description": "The Bachelor of Advanced Science (Honours) is the degree of choice for innovative thinkers with exceptional scientific knowledge and skills. It's designed for talented students and offers the flexibility to tailor the degree in a way that works for them. The degree offers students access to advanced level courses and includes an Honours year. Students will study foundation courses, which may include subjects such as biology, chemistry, physics and maths, before choosing a major (or two) and really explore what inspires them most. In their fourth year, students undertake an Honours year which involves a supervised research project and in some cases, advanced coursework. Outstanding Honours students may continue their studies in a higher research degree.",
        "URL": "/Undergraduate/programs/2020/3962",
        "name": "Advanced Science (Honours)",
        "awards": "Bachelor of Advanced Science (Honours) - BAdvSci(Hons)",
        "faculty": "science",
        "faculty_code": "57a56ceb4f0093004aa6eb4f0310c7ae",
        "code": "3962",
        "location": "Kensington"
    },
    {
        "entry_requirements": "None",
        "uac_code": "None",
        "study_level": "Undergraduate",
        "credit_points": "192",
        "description": "Engineering degrees offered by UNSW Canberra aim to provide outstanding engineering education to the future leaders of the Australian Defence Force and to civilian students to pursue excellence through contributions to the engineering profession, industry and the community.\nThe Bachelor of Engineering (Honours) in Aeronautical Engineering is of four years duration and the degree may be awarded at Honours Class I, Honours Class II, Division I or Honours Class II, Division II.Â  These Honours levels will be displayed on the final testamur.Â  Candidates who do not achieve Honours Class 1 or 2 will receive a Bachelor of Engineering (Honours) in Aeronautical Engineering with no honours level displayed.\nThe engineering programs at UNSW Canberra have been granted full accreditation by Engineers Australia.\nAeronautical engineering is the study of the design, development, manufacture, maintenance and control of machines or vehicles operating in the Earth's atmosphere or in outer space.\nThe design of a flight vehicle is quite complex and demands a knowledge of many engineering disciplines such as aerodynamics, propulsion systems, structural design, materials, avionics, and stability and control systems. Maintaining and operating a flight vehicle requires an understanding of materials, reliability and maintenance, structural analysis for necessary repairs, together with knowledge of the disciplines within the design process.\nExcept for Electrical Engineering and those in the Chief of Defence Force Honours Program first-year engineering and technology students enrol in a common program taking foundation science and engineering courses. In second and increasingly in third and fourth years the programs diverge into their specialities although there are some courses that span across programs in all years. A key element in all years is the design stream which emphasises complex problem solving. Other streams such as aerodynamics, stability, control, thermofluids, structures, mechanics, materials and management often incorporate project based learning informed by academic research and industrial practice. Electives and a final year thesis enable students to pursue particular interests both within and outside the specialist discipline.\nAt the end of the program students are expected to meet the graduate attributes of the University and Stage 1 Competencies of Engineers Australia, ready to practise in their chosen profession and with the ingenuity and resourcefulness to meet rapid technological change.",
        "URL": "/Undergraduate/programs/2020/4472",
        "name": "Aeronautical Engineering (Honours)",
        "awards": "Bachelor of Engineering (Honours) - BE (Hons)",
        "faculty": "unsw canberra at adfa",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7ad",
        "code": "4472",
        "location": "Canberra"
    },
    {
        "entry_requirements": "None",
        "uac_code": "None",
        "study_level": "Undergraduate",
        "credit_points": "192",
        "description": "The Chief of Defence Force Honours Program in Engineering offers the opportunity for students entering UNSW Canberra with a high Entrance Rank, and who maintain a high level of performance in their studies, to undertake research in a range of disciplines that will develop their critical thinking and independent research skills beyond that available in the standard Engineering program.\nIn Year 1 of the program students will be engaged with cohort activities so as to develop and maintain their interest and continuing involvement in the program via invited lectures, seminars, general reading and social events.\nCommencing in Year 2, the research projects, each offered as separate courses, will be supervised by academic staff from the same or closely related discipline. Students in the research courses may work independently or as part of a team, depending on the nature of the project undertaken, though all students will submit individual assessment. Final assessment, due by the end of semester, will be based on a written paper and an oral presentation.\nThe Bachelor of Engineering (Honours) (CDF) in Aeronautical Engineering has program objectives and learning outcomes in common with the standard Bachelor of Engineering (Honours) in Aeronautical Engineering program.\nThe program extends the educational principles embodied in the Bachelor of Engineering (Honours) in Aeronautical Engineering to a higher level of the degree. In the program, students will be exposed in first year to research methods in Engineering and will be offered significant extensions to the ideas and analysis performed in the standard degree program. This will allow them to undertake research projects. This will allow them to undertake research projects over the course of the degree at the appropriate level, thereby more fully integrating research into the standard undergraduate degree. The individual projects undertaken in close association with academic staff on research topics of mutual interest underpin the program and give the students the ability to develop their full potential.",
        "URL": "/Undergraduate/programs/2020/4476",
        "name": "Aeronautical Engineering (Honours) (CDF)",
        "awards": "Bachelor of Engineering (Honours) - BE (Hons)",
        "faculty": "unsw canberra at adfa",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7ad",
        "code": "4476",
        "location": "Canberra"
    },
    {
        "entry_requirements": "None",
        "uac_code": "423000",
        "study_level": "Undergraduate",
        "credit_points": "144",
        "description": "The Bachelor of Architectural Studies degree provides academic education in the practice and theory of architecture. It requires full time attendance for three years. In combination with the Master of Architecture, it is designed to deliver an architectural education appropriate to contemporary multidisciplinary professional practice. Graduates will be eligible to apply for entry into the Master of Architecture program at UNSW.\n\nProgression through the program is by stages, each comprising two semester-long design studios and their corresponding supporting courses. Admission to each stage is subject to the successful completion of the design courses of the preceding stages, except where approval has been given by the Director of Architecture.\n\nThe Program provides students with a disciplinary grounding in architectural design and related technical and academic knowledge.\n\nIt prepares students to work in architecture and other design-based industries. It also prepares students to undertake the Master of Architecture Program, a two year accredited degree required by students intending to undertake the professional examinations within their state or territory in order to become registered Architects. Lectures and practical sessions cover the following areas:\nArchitectural DesignArchitectural CommunicationsArchitectural History and TheoryArchitectural Science and TechnologyArchitectural Construction and Structures",
        "URL": "/Undergraduate/programs/2020/3261",
        "name": "Architectural Studies",
        "awards": "Bachelor of Architectural Studies - BArchSt",
        "faculty": "built environment",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7ae",
        "code": "3261",
        "location": "Kensington"
    },
    {
        "entry_requirements": "Bachelor degree in Architectural Studies with the equivalent of a UNSW Credit average (minimum of 65 Weighted Average Mark).",
        "uac_code": "None",
        "study_level": "Undergraduate",
        "credit_points": "48",
        "description": "The purpose of Honours within the Discipline of Architecture is to enable students who have performed well at undergraduate level to deepen their knowledge of design methods, knowledge and history by undertaking a significant research project. Honours is a means for connecting undergraduate study with supervised independent research by consolidating and extending work completed in the undergraduate program and providing an academic foundation for students continuing on to a Professional Masters, Masters by research or a PhD.\nAs part of the Honours program students will be expected to complete a significant independent research project and coursework study. In addition to conducting research and coursework students will generally also be expected to undertake research literacy training, Integrity in research training, attend OH & S and safety training and present seminars, write a literature review, and write a thesis.",
        "URL": "/Undergraduate/programs/2020/4521",
        "name": "Architectural Studies (Honours)",
        "awards": "Bachelor of Architectural Studies (Honours) - BArchSt(Hons)",
        "faculty": "built environment",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7ae",
        "code": "4521",
        "location": "Kensington"
    },
    {
        "entry_requirements": "Students will need to meet the admission requirements for both Tongji and UNSW. Tongji have advised that they will adopt the UNSW international student admission requirements in asssessing applicants for entry in Yr 1 of the Tongji program. Students will undertake 1.5 years at Tongji before entering Yr 2 of the UNSW BE Arch Studies program.\n\nTo be eligible for entry to UNSW, Tongji students must have achieved grades that meet the UNSW requirement for admission. As the program conducted at Tongji will be taught in English, the students applying for entry to Year 2 of the Architectural Studies program at UNSW will be deemed to meet the UNSW English Language requirement. Additionally, the students for this program will be drawn from international high schools where the language of instruction is English.",
        "uac_code": "None",
        "study_level": "Undergraduate",
        "credit_points": "192",
        "description": "Program Summary:\nThe program offers an excellent opportunity for students to study architecture at two pre-eminant architecture schools in Australia and China; namely the University of New South Wales and Tongji University, China.\nDrawing on the strength of educational traditions, systems and practices of both UNSW BE and Tongji CAUP, thereby offering students an optimum curriculum for foundation architectural studies and the future professional training.The program will broaden the educational experience of students in further internationalising the curricula offered by the Architecture Program and Faculty of the Built Environment and build on the on the cross-cultural experience of students to enhance a superior learning environment.\n\nProgram Arrangements:\nStudents enrolled in this special program undertake their first 1.5 years of study at Tongji CAUP in English and under an academic curriculum jointly designed by Tongji CAUP and UNSW BE which shall fulfil the academic requirements of the first year of Bachelor of Architectural Studies at UNSW BE.\n\nStudents will undertake second and third year studies at the UNSW BE and completely follow UNSW BE curriculum. They shall receive the second, third and first half fourth year advance standing in Bachelor of Science in Architecture at Tongji CAUP.\n\nStudents then proceed to undertake final half of fourth year of the Bachelor of Science in Architecture English curriculum at Tongji CUAP, which shall be jointly designed by Tongji CAUP and UNSW BE.\n\nAfter successfully completing all 8 semesters of this dual program, students will graduate with a UNSW Bachelor of Architectural Studies and a Tongji University Bachelor of Science in Architecture. Graduates will be eligible to apply for the UNSW Master of Architecture program or alternatively proceed to postgraduate Architecture studies at Tongji.",
        "URL": "/Undergraduate/programs/2020/3264",
        "name": "Architecture (UNSW-Tongji)",
        "awards": "Bachelor of Architectural Studies - BArchSt",
        "faculty": "built environment",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7ae",
        "code": "3264",
        "location": "Kensington"
    },
    {
        "entry_requirements": "None",
        "uac_code": "421400",
        "study_level": "Undergraduate",
        "credit_points": "144",
        "description": "The Bachelor of Art Theory degree focuses on the histories and theories of contemporary art. Situated in a nationally and internationally renowned art and design school, students learn alongside artists, designers, curators, and writers as they critically engage with significant debates in the field. Studies in this area allow students to trace multiple genealogies, themes, and discourses through 20th and 21st century art, while also exploring new approaches to theorising art and visual culture. The program introduces students to key artistic practices, movements, and debates with particular attention to the relationship between local and global perspectives. The program also develops studentsâ\u0080\u0099 scholarly capacities through foundational skills in visual analysis, critical thinking, academic writing, and research, and enables professional development opportunities through our strong industry partnerships. Through both structured and flexible learning pathways, students are supported in developing the skills and knowledge to successfully engage with a diverse range of opportunities in todayâ\u0080\u0099s arts and cultural industries.",
        "URL": "/Undergraduate/programs/2020/4803",
        "name": "Art Theory",
        "awards": "Bachelor of Art Theory - BAT",
        "faculty": "art design",
        "faculty_code": "57a56ceb4f0093004aa6eb4f0310c7af",
        "code": "4803",
        "location": "Paddington"
    },
    {
        "entry_requirements": "Applicants are required to have completed (or to be eligible to complete) a Bachelor of Art Theory or other bachelors degree in art history, art theory, visual culture, cultural studies, or related fields. Applicants may be graduates either of UNSW or another recognised institution.\nA weighted average mark (WAM) or equivalent of 70 or higher is an entry requirement.\nAdmission is subject to the WAM requirements as well as supervisory capacity in the Faculty as determined by the Program Authority.",
        "uac_code": "None",
        "study_level": "Undergraduate",
        "credit_points": "48",
        "description": "The Bachelor of Art Theory (Honours) is a 48 UOC (one year equivalent) advanced undergraduate degree for high achieving students. The program is designed for those who have completed an undergraduate degree in art history and theory (or cognate area), and wish to extend their critical and scholarly skills in art history and theory. The BAT (Hons) program enables students to expand and deepen their knowledge and understanding of art history and theory by undertaking a significant independent research thesis. Supported by coursework in art theory, the program supports students to gain an in-depth understanding of art history and theory and to develop highly sought after analytical, problem solving, and research skills. By doing so, this program can provide pathways to higher degree research programs such as an MPhil or PhD, as well as a diverse array of professional and career outcomes in the arts and cultural sectors.",
        "URL": "/Undergraduate/programs/2020/4516",
        "name": "Art Theory (Honours)",
        "awards": "Bachelor of Art Theory (Honours) - BAT(Hons)",
        "faculty": "art design",
        "faculty_code": "57a56ceb4f0093004aa6eb4f0310c7af",
        "code": "4516",
        "location": "Paddington"
    },
    {
        "entry_requirements": "None",
        "uac_code": "422000",
        "study_level": "Undergraduate",
        "credit_points": "144",
        "description": "The Bachelor of Arts (UNSW BA) is designed to provide you with all the benefits of an education in the Humanities, Social Sciences and the Creative and Performing Arts. The degree is flexible so that you can structure it around your skills, interests and career aspirations. The program has both breadth, allowing you to try out and explore different areas of interest, and depth, allowing you to focus in detail on two areas of specialisation. The UNSW BA can be completed full time in Single mode (normally 3 years), in Dual Mode (the equivalent of two years full time) or part time. Dual Mode can only be taken in conjunction with enrolment in another degree.\nIf you study in either the single or dual mode, you will complete:\na home major of 60 UOC (ten courses) selected from the list of UNSW BA approved home major specialisations;a minor specialisation of 24 UOC (four courses) selected from the list of UNSW BA approved home and external major specialisations or dedicated minor specialisations;12 UOC Prescribed Electives (two courses) of any other courses offered from within UNSW Arts and Social Sciences.\nIf you study in single mode, you will also complete:\nan additional 12 UOC (two courses) of UNSW Arts and Social Sciences Prescribed Electives;24 UOC of Free Electives (four courses) which can be taken within or outside of UNSW Arts and Social Sciences;12 UOC of General Education (two courses) which must be taken outside of UNSW Arts and Social Sciences.\nYou can use your elective and General Education courses to upgrade your minor to another full major specialisation in the single degree and graduate with a double major.",
        "URL": "/Undergraduate/programs/2020/3409",
        "name": "Arts",
        "awards": "Bachelor of Arts - BA",
        "faculty": "arts and social sciences",
        "faculty_code": "d7a56ceb4f0093004aa6eb4f0310c7ac",
        "code": "3409",
        "location": "Kensington"
    },
    {
        "entry_requirements": "None",
        "uac_code": "450001",
        "study_level": "Undergraduate",
        "credit_points": "144",
        "description": "The Bachelor of Arts is a three-year program at pass level. A separate four-year program at Honours level (Program Code 4511) is also available for eligible applicants.\nA Bachelor of Arts program enriches your understanding of how human beings make, recognise, and debate about life's meaning and the values that support civilisation. All Arts disciplines teach students to develop their capacity for critical analysis and argument as well as an awareness of the value of language as a political, intellectual, creative and communicative tool.\nStudents can combine courses from Business, English and Media Studies, Indonesian Studies, Geography, History, and International and Political Studies, building expertise in one or more of these disciplines.\nHonours students who are RAN midshipmen or RAAF officer cadets continue with their programs at UNSW, Canberra and complete their degrees at the end of the fourth year. Army officer cadets transfer to the Royal Military College, Duntroon at the end of their third year. After completing a year of military training they are commissioned as lieutenants, and those who are continuing with Honours programs return to the Academy to complete their Honours degree.\nThe objective of a Bachelor of Arts program is to stimulate students intellectually and to immerse them in the discipline of learning.\nThe program will develop graduate attributes, such as strong written and oral communications skills, the capacity to research, criticise and reflect, and the ability to work independently and collaboratively.",
        "URL": "/Undergraduate/programs/2020/4400",
        "name": "Arts",
        "awards": "Bachelor of Arts - BA",
        "faculty": "unsw canberra at adfa",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7ad",
        "code": "4400",
        "location": "Canberra"
    },
    {
        "entry_requirements": "Students must have completed the UNSW Bachelor of Arts, Bachelor of International Studies or Bachelor of Social Research and Policy or other recognised Level 7 qualification with a major in a stream offered in the program. Students in a dual degree must have completed 144 UOC including all requirements for the Arts, International Studies or Social Research and Policy component. Entry to Honours requires a WAM of 70 or higher (or equivalent) in the stream(s) seeking to be further studied. It is subject to resources and the approval of the Head of School in which the stream(s) is/are based.\nThe conferral of the honours degree for dual degree students is subject to students completing all requirements of the dual degree. Students who subsequently withdraw from their dual degree after the completion of honours will only be conferred the honours degree if they have met all requirements for the single degree.\nHow to Apply\nStudents intending to apply to the Honours program must first discuss their eligibility and study program with the Honours Convenor in the relevant school prior to submitting an application.\nAll applications are to be submitted to UNSW Apply Online.",
        "uac_code": "None",
        "study_level": "Undergraduate",
        "credit_points": "48",
        "description": "The Bachelor of Arts and Social Sciences (Honours) is a 48 UOC (one year equivalent) advanced undergraduate degree for high achieving students which may be taken upon completion of an undergraduate pass degree in Arts, International Studies or Social Research and Policy. A student undertaking this program will normally complete honours within their chosen major stream of study in their pass degree. The focus of Honours year is on the further development of analytical and research skills, deepening of knowledge, and application of methods that are specific to students' chosen (major) discipline of study. The BASS (Hons) may be completed full-time or part-time.\nThe aims of the BASS (Hons) are:\nTo further develop the disciplinary skills acquired by students in their major stream of study (AQF Level 7). In particular, to inculcate higher-order research skills in critical thinking, reflection and analysis.To understand relevant disciplinary methods and approaches and their assumptions, and to apply them in research.To deepen disciplinary-specific knowledge and to understand its theoretical frameworks and contexts of application. To apply such knowledge while considering, where appropriate, interdisciplinary perspectives, historical and comparative frameworks, and world-views of other times, places, and cultures.To appreciate the place of ethics in private and public life and to interrogate disciplinary frameworks, assumptions and processes in light of ethical values.",
        "URL": "/Undergraduate/programs/2020/4504",
        "name": "Arts & Social Sciences (Hons)",
        "awards": "Bachelor of Arts and Social Sciences (Honours) - BASS (Hons)",
        "faculty": "arts and social sciences",
        "faculty_code": "d7a56ceb4f0093004aa6eb4f0310c7ac",
        "code": "4504",
        "location": "Kensington"
    },
    {
        "entry_requirements": "None",
        "uac_code": "None",
        "study_level": "Undergraduate",
        "credit_points": "144",
        "description": "The Chief of Defence Force Students (CDFS) Programs in Arts, Business, Engineering, Science and Technology - Aeronautical offer the opportunity for students entering UNSW Canberra with a high Entrance Rank, and who maintain a high level of performance in their studies, to undertake research in a range of disciplines that will develop their critical thinking and independent research skills beyond that available in the standard Bachelor Degree programs.\nThe range of CDFS Programs, described in detail in the following sections, is characterised by the inclusion of specialist courses in critical analysis and/or research methods appropriate to the area of study. All programs also include discipline-specific research projects. The research projects will be supervised by academic staff from the relevant discipline. With the approval of the relevant Heads of Schools, multi- or cross disciplinary projects may be undertaken.\nStudents in the research courses may work independently or as part of a team, depending on the nature of the project undertaken, though all students will submit individual assessment. Final assessment will be based on a written paper or report and oral presentations.\nThroughout the program, and in addition to completing the courses given in the following schedules, students will be engaged with cohort activities so as to develop and maintain their interest and continuing involvement in the program via invited lectures, seminars, general reading and social events.\nEach of the CDFS Programs has objectives and learning outcomes in common with the standard Bachelor degree in the same area, but extends the educational principles embodied in the standard degree to a higher level. In the programs, students will be exposed to courses in critical analysis and/or research methods in the discipline(s) of their chosen program, which will offer significant extensions to the ideas and analysis normally available in the standard degree program. This will allow all CDFS to successfully undertake research-oriented courses at the appropriate level through their program, thereby integrating research into their studies in a way that is not available in the standard degree. The individual projects undertaken in close association with academic staff on research topics of mutual interest underpin the CDFS Programs and give students the ability to develop their full potential.",
        "URL": "/Undergraduate/programs/2020/4461",
        "name": "Arts (CDF)",
        "awards": "Bachelor of Arts - BA",
        "faculty": "unsw canberra at adfa",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7ad",
        "code": "4461",
        "location": "Canberra"
    },
    {
        "entry_requirements": "Students must have completed the UNSW Bachelor of Arts, Bachelor of International Studies or Bachelor of Social Research and Policy or other recognised Level 7 qualification with a major in Indigenous Studies or in an equivalent stream. Students in a dual degree must have completed 144 UOC including all requirements for the Arts, International Studies or Social Research and Policy component. Entry to Honours requires a WAM of 70 or higher (or equivalent) in Indigenous Studies or an equivalent stream. It is subject to resources and the approval of the Director of Indigenous Studies.",
        "uac_code": "None",
        "study_level": "Undergraduate",
        "credit_points": "48",
        "description": "The Bachelor of Arts (Honours) in Australian Indigenous Studies is a 48 UOC (one year equivalent) advanced undergraduate degree for high achieving students which may be taken upon completion of an undergraduate pass degree in Arts, International Studies or Social Research and Policy. The key aim of the Australian Indigenous Studies Honours program is to produce graduates who are well equipped to deal with Indigenous people's concerns and issues in their future research work. The program may be a pathway into a graduate research degree (MA Research or PhD).\nThe aims of the Bachelor of Arts (Honours) in Australian Indigenous Studies are:\nTo develop studentsâ\u0080\u0099 disciplinary skills in Indigenous Studies, including higher-order research skills in critical thinking, reflection, and analysis.To enable students to engage and work critically with a range of research methods and approaches in Indigenous Studies and other disciplines.To ensure students are rigorous in their research and analysis in Indigenous and multi-disciplinary intersections.To foster studentsâ\u0080\u0099 understandings of how to work in ethically and socially just ways, respecting Indigenous diversity in local, national, and international contexts.",
        "URL": "/Undergraduate/programs/2020/4519",
        "name": "Arts (Honours)",
        "awards": "Bachelor of Arts (Honours) - BA (Hons)",
        "faculty": "dvcacademicboardofstudies",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7b3",
        "code": "4519",
        "location": "Kensington"
    },
    {
        "entry_requirements": "To apply for admission to the award of the degree at Honours level, an applicant must have:\n\nsuccessfully completed a three year BA with a major in the relevant honours discipline at UNSW Canberra at ADFA; or\ngained a BA degree from another approved institution; and\nachieved at least a credit average (65%) across the entire undergraduate program including a credit average over the Level III courses in the discipline in which honours is proposed.",
        "uac_code": "None",
        "study_level": "Undergraduate",
        "credit_points": "48",
        "description": "The purpose of BA Honours degree is to enable students who have performed well at undergraduate level to deepen their knowledge of approaches, perspectives and traditions in their chosen scientific discipline and undertake a significant research project. Honours is a means for connecting undergraduate study with supervised independent research by consolidating and extending work completed in the undergraduate program and providing an academic foundation for students continuing on to a Masters by research or a PhD.\nÂ",
        "URL": "/Undergraduate/programs/2020/4511",
        "name": "Arts (Honours)",
        "awards": "Bachelor of Arts (Honours) - BA (Hons)",
        "faculty": "unsw canberra at adfa",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7ad",
        "code": "4511",
        "location": "Canberra"
    },
    {
        "entry_requirements": "None",
        "uac_code": "422050",
        "study_level": "Undergraduate",
        "credit_points": "144",
        "description": "The Bachelor of Arts and Business (BA&Bus) is designed to provide you with all the benefits of an education in the Humanities, Social Sciences and the Creative and Performing Arts PLUS study in Business. The program provides you with not only the depth (Major and Minor streams) of the Bachelor of Arts but a specially-designed Business Studies component that will introduce you to key concepts and approaches in Business and Management.\n\nThe aims of the BA&Bus are\nTo develop informed understanding of human experience, human culture and human societyTo develop an understanding of the the role of business in the contemporary worldTo teach the tools and methods of understanding associated with Humanities, Social Science and Business disciplines, and to encourage students to perceive the relationships between these disciplinesTo encourage the breadth of vision and critical thinking associated with interdisciplinary scholarship and researchTo enable students to place contemporary Australian society and culture in an historical and comparative contextTo engage critically with fundamental questions about value in both ethical and aesthetic contextsTo develop the skills of critical, creative and imaginative thinking about society, culture and the artsTo promote the techniques and value of reasoned and openminded discussion and debateTo foster understanding of the experiences and world-views of other times, other places, and other cultures.",
        "URL": "/Undergraduate/programs/2020/3444",
        "name": "Arts and Business",
        "awards": "Bachelor of Arts and Business - BArts (Bus)",
        "faculty": "arts and social sciences",
        "faculty_code": "d7a56ceb4f0093004aa6eb4f0310c7ac",
        "code": "3444",
        "location": "Kensington"
    },
    {
        "entry_requirements": "None",
        "uac_code": "429500",
        "study_level": "Undergraduate",
        "credit_points": "144",
        "description": "The degree of Bachelor of Aviation is offered by the School of Aviation in the Faculty of Science.\nThe aim of this program is to prepare students for a career in the aviation industry, primarily as a pilot but also as a future manager/pilot. The program prepares the students for the role of professional pilot working either as a single pilot in a general aviation organisation, or as a multi-crew team in an airline. In addition, the student undertakes academic courses in aviation management (including safety) so that they may also take on the role of manager or the dual role of pilot/manager. The parallel program, the Bachelor of Aviation Management stream (Program 3981) prepares students more specifically for careers in the managerial sector of the aviation industry.\nBoth streams consist of core courses selected from the Faculties offering the program, together with a range of options. The Flying stream additionally includes flight training to a minimum level of Commercial Pilots Licence (CPL), Instrument Rating - Multi Engine Aeroplane and Air Transport Pilot Licence (ATPL) theory subjects. Â \nNote: Due to the block training nature of the flight training program, teaching periods might not correspond to standard academic sessions, and Â students will need to undertake the Professional Pilot Program (flying training) Â on a full-time basis.",
        "URL": "/Undergraduate/programs/2020/3980",
        "name": "Aviation (Flying)",
        "awards": "Bachelor of Aviation - BAv",
        "faculty": "science",
        "faculty_code": "57a56ceb4f0093004aa6eb4f0310c7ae",
        "code": "3980",
        "location": "Kensington"
    },
    {
        "entry_requirements": "None",
        "uac_code": "429520",
        "study_level": "Undergraduate",
        "credit_points": "144",
        "description": "The Bachelor of Aviation is offered by the Faculty of Science with input from the Business School.\nThe aim of this program is to provide an opportunity for students to prepare for a career in the aviation industry. Program 3981 is a Managerial stream which prepares students more specifically for careers in the managerial sector of the aviation industry. A Flying stream, which incorporates flight training, is also available - please refer to program 3980 in this Online Handbook.\nBoth streams consist of core courses selected from the Faculties offering the program together with a range of options. The Managerial stream offers a selection of courses designed to provide students with a broad base of knowledge in managing the operational aspects of the aviation industry.",
        "URL": "/Undergraduate/programs/2020/3981",
        "name": "Aviation (Management)",
        "awards": "Bachelor of Aviation - BAv",
        "faculty": "science",
        "faculty_code": "57a56ceb4f0093004aa6eb4f0310c7ae",
        "code": "3981",
        "location": "Kensington"
    },
    {
        "entry_requirements": "None",
        "uac_code": "425150",
        "study_level": "Undergraduate",
        "credit_points": "240",
        "description": "The School of Electrical Engineering and Telecommunications offers a five year integrated degree program (240 UOC) leading to a Bachelor of Engineering (Honours) and Master of Engineering (BE ME) in Electrical Engineering. The program includes a compulsory 24 UOC minor in a discipline outside the area of electrical engineering and telecommunications. Flexibility and choice are maintained throughout the entire structure by providing many elective courses.\nThe program outcomes are achieved through the learning outcomes of all courses including project work, electives and compulsory and relevant industrial training within the BE ME integrated degree program. The 5-year BE ME structure is designed such that at graduation, students would be expected to have desired skills competency, such as creative problem solving, innovative design, capacity for analytical and critical thinking, independent in reflective learning, in-depth discipline specific knowledge, good communication skills, professional attitude and ethical practice, and teamwork.",
        "URL": "/Undergraduate/programs/2020/3736",
        "name": "BE (Hons) ME Electrical Engineering",
        "awards": "Bachelor of  Engineering (Honours) - BE (Hons)Master of Engineering - ME",
        "faculty": "engineering",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7af",
        "code": "3736",
        "location": "Kensington"
    },
    {
        "entry_requirements": "None",
        "uac_code": "429400",
        "study_level": "Undergraduate",
        "credit_points": "192",
        "description": "Biotechnology can be defined as the use of various biological processes to make products and perform services. In biotechnology, living cells and biochemical macromolecules such as proteins, DNA and RNA are applied in a rapidly expanding range of activities of direct benefit to society. Biotechnology is used for the production of pharmaceuticals, food and industrial chemicals, in the development of improved crops and livestock for farming, for environmental clean-up, and in forensics. Modern biotechnology makes practical use of the most recent scientific advances in areas such as molecular genetics and molecular cell biology.\n\nThe development of recombinant DNA technology has resulted in the ability to create, modify and improve industrial organisms and to produce large quantities of any useful protein. Based on this technology, biopharmaceuticals including hormones, vaccines, anti-hypertensive agents, anti-inflammatory agents and new therapies for the treatment of cancer are being developed with the potential to revolutionise medicine. The sequencing of the human genome and the rapid emergence of high-throughput genomic and proteomic techniques is resulting in a surge of new drug targets. Translation of this advanced knowledge into useful therapies and improved medical practices requires the application of biotechnology.\n\nMicroorganisms and viruses are being modified for use in controlling plant and animal diseases and pests. Diagnostic kits are being developed for use in forensic science and in product identification and quality control. Genetic improvements in agriculture, plants and animals are becoming a reality, as is the control of inborn genetic disorders in humans. The ability to treat diseased and injured organs with replacement cells and tissues generated outside of the body is advancing rapidly.\n\nThe future for expansion in all the above areas is immense. Our ability to cope with many medical, environmental, agricultural and manufacturing problems in the 21st century will depend heavily on advances in biotechnology.",
        "URL": "/Undergraduate/programs/2020/3053",
        "name": "Biotechnology (Honours)",
        "awards": "Bachelor of Biotechnology (Honours) - BBiotech(Hons)",
        "faculty": "science",
        "faculty_code": "57a56ceb4f0093004aa6eb4f0310c7ae",
        "code": "3053",
        "location": "Kensington"
    },
    {
        "entry_requirements": "None",
        "uac_code": "450010",
        "study_level": "Undergraduate",
        "credit_points": "144",
        "description": "The Bachelor of Business is a three-year program at pass level.\nThe program has been introduced to enhance business acumen among future leaders and managers in the Australian Defence Organisation and to provide them with the capacity to interact effectively with external business providers. It aims to lay solid foundations in communication, numeracy and general problem solving capabilities developed within a specifically business-oriented context of study and to build students' knowledge in a diverse range of areas associated with organisational management and leadership.\nStudents taking this program will become familiar with bodies of knowledge and develop graduate attributes which will give them a strengthened capacity to manage Defence business throughout their Service careers.\nThe program structure reflects the diversity of knowledge and skills which contribute to the study and analysis of business issues, a focus on what are regarded as core business capabilities, the recognition that a business education requires integration among its parts and an acknowledgement that business managers and leaders benefit from exposure to thinking outside purely business-related areas.",
        "URL": "/Undergraduate/programs/2020/4405",
        "name": "Business",
        "awards": "Bachelor of Business - BBus",
        "faculty": "unsw canberra at adfa",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7ad",
        "code": "4405",
        "location": "Canberra"
    },
    {
        "entry_requirements": "For admission to the Diploma, an applicant is expected to have completed Secondary School or the equivalent, such as University Foundation Studies, prior to commencement of their studies.  For further details, including a statement on English language requirements, please see the Diplomas website.",
        "uac_code": "None",
        "study_level": "Undergraduate",
        "credit_points": "54",
        "description": "This 11 month program will provide students with the opportunity to pursue a degree inÂ Commerce, Economics or Information Systems that will lead to a career in a discipline ofÂ BusinessÂ or related area. Students will complete a set of eightÂ businessÂ courses in addition to a Communication and Academic Literacy course. Credit will be granted towards the Bachelor of Commerce,Economics or Information Systems for each of the eightÂ  courses achieved at a specified level, which are all equivalent to First-Year UNSW courses. After successful completion of allÂ nine courses, students willÂ be awarded a Diploma of Business.\nIn this Diploma program students will be able to experience a university environment and university life, while being supported to acquire all of the knowledge and skills needed for successful transition to undergraduate studies at UNSW. The courses in this programÂ are equivalent in content and outcomes to First-Year UNSW courses but the delivery pace is slower and the face-to-face contact hours are greater. The course structure allows students to get accustomed to University learning styles - in Lectures, Tutorials and Problem-Solving Workshops - while receiving additional support, as required, for the duration of the diploma program.\nIt is assumed that students have a certain level of knowledge in advanced mathematics in order to cope well with the mathematical or statistical component of a Business Diploma. If you are successful in obtaining a place without this assumed knowledge, you are strongly encouraged to consider studying aÂ Mathematics Bridging CourseÂ before starting your degree.",
        "URL": "/Undergraduate/programs/2020/7004",
        "name": "Business",
        "awards": "Diploma in Business - DipBus",
        "faculty": "unsw global",
        "faculty_code": "a9321f614ffd57009106fd501310c7eb",
        "code": "7004",
        "location": "Kensington"
    },
    {
        "entry_requirements": "None",
        "uac_code": "None",
        "study_level": "Undergraduate",
        "credit_points": "144",
        "description": "The Chief of Defence Force Students (CDFS) Program in Business offers the opportunity for students entering UNSW Canberra with a high Entrance Rank, and who maintain a high level of performance in their studies, to undertake research in a range of disciplines that will develop their critical thinking and independent research skills beyond that available in the standard Bachelor Degree programs.\nThe range of CDFS Programs, described in detail in the following sections, is characterised by the inclusion of specialist courses in critical analysis and/or research methods appropriate to the area of study. All programs also include discipline-specific research projects. The research projects will be supervised by academic staff from the relevant discipline. With the approval of the Head of School, multi- or cross-disciplinary projects may be undertaken. Students in the research courses may work independently or as part of a team, depending on the nature of the project undertaken, though all students will submit individual assessment. Final assessment will be based on a written paper or report and oral presentations.\nThroughout the program, and in addition to completing the courses given in the following schedules, students will be engaged with cohort activities so as to develop and maintain their interest and continuing involvement in the program via invited lectures, seminars, general reading and social events.\nThe CDFS Program has objectives and learning outcomes in common with the standard Bachelor of Business degree, but extends the educational principles embodied in the standard degree to a higher level. In the program, students will be exposed to courses in critical analysis and/or research methods, which will offer significant extension to the ideas and analysis normally available in the standard degree program. This will allow all CDFS to successfully undertake research-oriented courses at the appropriate level through their program, thereby integrating research into their studies in a way that is not available in the standard degree. The individual projects undertaken in close association with academic staff on research topics of mutual interest underpin the CDFS Programs and give students the ability to develop their full potential.",
        "URL": "/Undergraduate/programs/2020/4462",
        "name": "Business (CDF)",
        "awards": "Bachelor of Business - BBus",
        "faculty": "unsw canberra at adfa",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7ad",
        "code": "4462",
        "location": "Canberra"
    },
    {
        "entry_requirements": "None",
        "uac_code": "None",
        "study_level": "Undergraduate",
        "credit_points": "48",
        "description": "The purpose of BBus Honours degree is to enable students who have performed well at undergraduate level to deepen their knowledge of approaches, perspectives and traditions in their chosen scientific discipline and undertake a significant research project. Honours is a means for connecting undergraduate study with supervised independent research by consolidating and extending work completed in the undergraduate program and providing an academic foundation for students continuing on to a Masters by research or a PhD. Students who complete an Honours program and achieve an Honours Class 1 are well placed to apply for higher degree research (a Doctor of Philosophy (PhD) or Masters by Research (MPhil) and scholarships such as the Australian Postgraduate Award (APA). Further details on career opportunities for students who complete an Honours degree can be obtained from the School",
        "URL": "/Undergraduate/programs/2020/4512",
        "name": "Business (Honours)",
        "awards": "Bachelor of Business (Honours) - BBus (Hons)",
        "faculty": "unsw canberra at adfa",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7ad",
        "code": "4512",
        "location": "Canberra"
    },
    {
        "entry_requirements": "None",
        "uac_code": "423600",
        "study_level": "Undergraduate",
        "credit_points": "192",
        "description": "The Bachelor of City Planning (Hons) provides academic education and applied learning leading to professional, accredited qualifications in planning. The Program is of four years full-time duration with embedded Honours. The degree comprises core courses that develop and strengthen disciplinary foundations and help develop advanced and specific knowledge and skills; elective options including Built Environment Interdisciplinary Learning courses, an integrated learning Practice Year where students develop skills in the workplace as well as classroom; and a final year involving a Plan Making Studio, research thesis and opportunities to further pursue specialist areas of interest.\nPlanning is a varied and progressive profession which plays a pivotal role in decisions shaping the future of cities and regions. Planners need to see the whole picture: we need to be good thinkers, good analysts and good communicators. We work with stakeholders across the spectrum of interests - from global developers to local communities - to foster feasible, equitable, sustainable and progressive outcomes. Working at the interface between development and environment, the planner's role involves collecting and analysing information, identifying needs and options, making forecasts, preparing policies, plans and programs for implementation, exercising development control, investigating development proposals, and evaluating results, communicating outcomes and consultation. Sydney and NSW provide a fantastic laboratory to help understand the crucial role played by planners in addressing complex challenges, systematically placed in its global context through critical analysis and drawing upon best practice.\nThe Bachelor of City Planning (Hons) aims to produce high quality graduates who have acquired UNSW Graduate attributes and are capable, through their skills, knowledge and experience, of undertaking a wide range of tasks required of a qualified planning practitioner. As well as preparing for the profession, a planning degree provides lifelong analytical, collaborate and communication skills much in demand more widely.",
        "URL": "/Undergraduate/programs/2020/3362",
        "name": "City Planning (Honours)",
        "awards": "Bachelor of City Planning (Honours) - BCP (Hons)",
        "faculty": "built environment",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7ae",
        "code": "3362",
        "location": "Kensington"
    },
    {
        "entry_requirements": "None",
        "uac_code": "None",
        "study_level": "Undergraduate",
        "credit_points": "192",
        "description": "Background\nCivil Engineering takes its name from the division of engineering in the Middle Ages between military and civilian works. The profession of Civil Engineering was recognized by the formation of the Institution of Civil Engineers (UK) in 1825. In the 19th Century, the broadening scope of engineering led to the division of civilian engineering into civil, mechanical and electrical, with further specializations (aeronautical, chemical, industrial, materials, electronic etc.) having developed in the 20th Century.\nAfter contracting its sphere of interest over a long period of time, Civil Engineering is now broadening its scope with the recognition of the wider implications of its effects on modern society. Attention is given both to the interaction between civil engineering and other disciplines and to the effect of Civil Engineering works on the environment. Present day civil engineering has maintained strong commonality with military engineering - the design and construction of facilities such as roads, bridges, airfields, buildings, water supply and waste treatment facilities, structures of all types, and the associated planning and management of projects.\nProgram Description\nEngineering degrees offered by UNSW Canberra aim to provide outstanding engineering education to the future leaders of the Australian Defence Force and civilian students to pursue excellence through contributions to the engineering profession, industry and the community.\nThe Bachelor of Engineering (Honours) in Civil Engineering program is of four years duration and the degree may be awarded at Honours Class I, Honours Class II, Division I or Honours Class II, Division II. These honours levels will be displayed on the final testamur. Candidates who do not achieve Honours Class I or II will receive a Bachelor of Engineering (Honours) in Civil Engineering with no honours level displayed.\nThe engineering programs at UNSW Canberra have been granted full accreditation by Engineers Australia.\nIn the first year, students will complete most fundamental science, mathematics and computing courses. During the second and third years, students will be required to complete all core civil engineering courses in areas of structures, construction materials, geotechnics, transportation, hydraulics and environmental engineering. In the final year, all students will complete both final year thesis and integrated design project to enhance their skills in solving complex civil engineering problems. Furthermore, all students will also take two technical electives which will further enhance their technical knowledge in specific areas of civil engineering.",
        "URL": "/Undergraduate/programs/2020/4473",
        "name": "Civil Engineering (Honours)",
        "awards": "Bachelor of Engineering (Honours) - BE (Hons)",
        "faculty": "unsw canberra at adfa",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7ad",
        "code": "4473",
        "location": "Canberra"
    },
    {
        "entry_requirements": "None",
        "uac_code": "None",
        "study_level": "Undergraduate",
        "credit_points": "192",
        "description": "The Chief of Defence Force Honours Program in Engineering offers the opportunity for students entering UNSW Canberra with a high Entrance Rank, and who maintain a high level of performance in their studies, to undertake research in a range of disciplines that will develop their critical thinking and independent research skills beyond that available in the standard Engineering program.\nIn Year 1 of the program students will be engaged with cohort activities so as to develop and maintain their interest and continuing involvement in the program via invited lectures, seminars, general reading and social events.\nCommencing in Year 2, the research projects, each offered as separate courses, will be supervised by academic staff from the same or closely related discipline. Students in the research courses may work independently or as part of a team, depending on the nature of the project undertaken, though all students will submit individual assessment. Final assessment, due by the end of semester, will be based on a written paper and an oral presentation.\nThe Bachelor of Engineering (Honours) (CDF) in Civil Engineering program has objectives and learning outcomes in common with the standard Bachelor of Engineering (Honours) in Civil Engineering program. The program extends the educational principles embodied in the Bachelor of Engineering (Honours) in Civil Engineering to a higher level of the degree. In the program, students will be exposed in first year to research methods in Engineering and will be offered significant extensions to the ideas and analysis performed in the standard degree program. This will allow them to undertake research projects, at the appropriate level, in their later years, thereby, more fully integrating research into the standard undergraduate degree. The individual projects undertaken in close association with academic staff on research topics of mutual interest underpin the program and give the students the ability to develop their full potential.",
        "URL": "/Undergraduate/programs/2020/4477",
        "name": "Civil Engineering (Honours) (CDF)",
        "awards": "Bachelor of Engineering (Honours) - BE (Hons)",
        "faculty": "unsw canberra at adfa",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7ad",
        "code": "4477",
        "location": "Canberra"
    },
    {
        "entry_requirements": "None",
        "uac_code": "424000",
        "study_level": "Undergraduate",
        "credit_points": "144",
        "description": "The Bachelor of Commerce (BCom) is a highly valued qualification for a wide variety of business careers. The degree offers students the flexibility to design a degree which aligns with their interests and career ambitions. Building on foundational business courses in first year, students can choose up to two majors from an extensive list of specialisations (listed below); for example, Accounting, Business Law, Finance, Information Systems, Business Economics, Fintech, Human Resource Management, Marketing, and Taxation.\nThe Bachelor of Commerce gives students a unique platform to build transferrable career skills and professional networks throughout their degree, in the classroom and with the suite of opportunities offered through Career Accelerator @ UNSW Business School.Â  Students may choose up to two work-integrated learning courses as electives. In addition to more traditional internships (e.g. COMM2222), students can complete a Global Business Practicum (COMM3020), work with top employers on Industry Consulting Projects (COMM2233) and contribute to a just society with the Social Entrepreneurship Practicum (COMM3030), or the Tax Clinic (TABL3033).Â \nIt is assumed that students have a certain level of knowledge in advanced mathematics in order to cope well with the mathematical or statistical component of a business degree. If you are successful in obtaining a place without this assumed knowledge, you are strongly encouraged to consider studying a Mathematics Bridging Course before starting your degree.\nÂ \nA typical degree plan includes:Â \n1st year:Â Â Â \n4 compulsory core courses (24 UOC)Â A choice of 4 flexible core courses (24 UOC)Â Career Accelerator: Essentials (0 UOC)Â \n2ndÂ  and 3rd yearÂ \n1 Business majorÂ A second business major, minor, or free electivesÂ 1-2 Career Accelerator work-integrated learning coursesÂ 2 General Education coursesÂ \nÂ \nProgram benefits:Â \nHighly regarded by industryÂ Provides students with the fundamentals of business and the option to develop specialist knowledge in up to two majorsÂ Prepares students academically, technically and professionallyÂ Extensive opportunities to complete internships, mentoring, build professional networks and attend industry events through Career Accelerator @ UNSW Business SchoolEquips students with the skills and knowledge to pursue a variety of career optionsÂ Allows students to obtain professional recognition in a range of disciplines.",
        "URL": "/Undergraduate/programs/2020/3502",
        "name": "Commerce",
        "awards": "Bachelor of Commerce - BCom",
        "faculty": "unsw business school",
        "faculty_code": "5a3a1d4f4f4d97404aa6eb4f0310c77a",
        "code": "3502",
        "location": "Kensington"
    },
    {
        "entry_requirements": "None",
        "uac_code": "424600",
        "study_level": "Undergraduate",
        "credit_points": "192",
        "description": "The Bachelor of Commerce (Co-op) (BCom (Co-op)) is a highly valued and unique business qualification. It provides high-achieving students with a strong, 4-year academic program, integrated with fully assessable industry placement experiences that enable students to work with some of Australia's leading employers. The degree is also flexible enough to allow students to design a program which aligns their interests and career ambitions in accounting, finance, marketing or information systems with other areas of business.\n\nProgram benefits:\nHighly regarded by industryProvides students with the fundamentals of business and the option to explore their interestsPrepares students academically, technically and professionallyEquips students with the skills and knowledge to pursue a variety of career optionsAllows students to qualify for professional accreditation in a range of areas",
        "URL": "/Undergraduate/programs/2020/3554",
        "name": "Commerce (Co-op)",
        "awards": "Bachelor of Commerce (Co-op) - BCom(Co-op)",
        "faculty": "unsw business school",
        "faculty_code": "5a3a1d4f4f4d97404aa6eb4f0310c77a",
        "code": "3554",
        "location": "Kensington"
    },
    {
        "entry_requirements": "None",
        "uac_code": "424601",
        "study_level": "Undergraduate",
        "credit_points": "192",
        "description": "The Bachelor of Commerce (Co-op) (Honours) is a highly valued and unique business qualification. It provides high-achieving students with a strong, 4-year academic program, integrated with:\n\n(i) Fully assessable industry placement experiences that enable students to work with some of Australia's leading employers.\n(ii) Research training via advanced disciplinary and methodology courses and a thesis.\nThe BCom (Co-op) (Honours) combines the requirements of the degree with 18 months of coordinated industry placement at three different sponsoring organisations. The industry placement extends outside university semesters.\nA scholarship is payable from funds donated by the sponsoring organisations, and entry to the program is limited to students awarded a scholarship through the BCom (Co-op) (Honours) selection procedures administered by UNSW Co-op Program Office. For baseline requirements to the UNSW Co-op program visit the future students page.\n\nProgram benefits:\nHighly regarded by industryProvides students with the fundamentals of business and the option to explore their interestsPrepares students academically, technically and professionallyEquips students with the skills and knowledge to pursue a variety of career optionsAllows students to qualify for professional accreditation in a range of areas",
        "URL": "/Undergraduate/programs/2020/3565",
        "name": "Commerce (Co-op) (Honours)",
        "awards": "Bachelor of Commerce (Co-op) (Honours) - BCom(Co-op)(Hons)",
        "faculty": "unsw business school",
        "faculty_code": "5a3a1d4f4f4d97404aa6eb4f0310c77a",
        "code": "3565",
        "location": "Kensington"
    },
    {
        "entry_requirements": "To be admitted into the Bachelor of Commerce (Honours) program, a student must have completed a pass degree, normally a business-related degree, or equivalent, with a business major in the desired honours discipline (namely accounting, finance, marketing, or information systems). A student in a dual degree may gain entry to the Bachelor of Commerce (Honours) prior to completing the requirements for the dual degree program if they have completed 144 UOC, including 48 UoC in the Bachelor of Commerce compulsory and flexible core courses and all requirements for the relevant major. Students who have completed a non-business degree with a major in one of the specified business areas, or a specified cognate area, may be eligible to complete honours within this program. Disciplines may also have particular pre-requisite requirements for entry into honours. Students are required to meet the entry requirements for the study area they are applying. Please refer to each school's honours entry requirement for exact details.\nA student must have an overall Weighted Average Mark (WAM) of at least 70 (or equivalent) with a discipline/major WAM of at least 70. Due to the academic requirements of some disciplines and the competitive nature of honours places, the WAM required for entry may be higher in some disciplines. Students who have failed a course within their pass degree will not normally gain entry to the Bachelor of Commerce (Honours) program. Please refer to the relevant discipline Honours plan for exact details.\nThe availability and willingness of a supervisor to work with the candidate is another important criterion for successful admission to the program. The number of students accepted to the Bachelor of Commerce (Honours) in a particular discipline is dependent on the availability of supervisors in that discipline. If there are more applicants than a discipline can accommodate, admission will be determined according to students' academic merit. Hence meeting the academic requirements of the program does not guarantee a place in the program.\nNot all disciplines may accept students mid-year or on a part-time basis due the sequencing of the coursework.",
        "uac_code": "None",
        "study_level": "Undergraduate",
        "credit_points": "48",
        "description": "The Bachelor of Commerce (Honours) is a one year advanced undergraduate degree for high-achieving students which may be undertaken upon completion of an undergraduate pass degree. A student undertaking this program will normally complete honours within the business specialisation (major) of their pass degree.\nThe Bachelor of Commerce (Honours) program enables students to expand and deepen their understanding of this discipline and develop highly sought after analytical, problem solving and research skills through undertaking a significant independent research thesis. The program may be a pathway into a PhD. Honours may be completed within the disciplines of accounting, finance, human resource management, information systems, international business, management or marketing.\nProgram Benefits\nCompetitive advantage, increased employability, attractiveness and worth resulting in more career options - either in academia, business, government or applied research through gaining:\nadvanced analytical and problem solving skills required for specialist careers in business and governmenthighly sought after research, project management and communication skills in as well as advanced knowledge of the relevant discipline.",
        "URL": "/Undergraduate/programs/2020/4501",
        "name": "Commerce (Honours)",
        "awards": "Bachelor of Commerce (Honours) - BCom (Hons)",
        "faculty": "unsw business school",
        "faculty_code": "5a3a1d4f4f4d97404aa6eb4f0310c77a",
        "code": "4501",
        "location": "Kensington"
    },
    {
        "entry_requirements": "None",
        "uac_code": "424050",
        "study_level": "Undergraduate",
        "credit_points": "192",
        "description": "The Bachelor of Commerce (B Com (International)), which includes a one year international exchange component, is a highly valued business qualification. The program is designed for students who want to complement their business degree with international studies (including asian studies, european studies or languages), and also for those students who want to align their degree with their interests and careers ambitions in accounting, finance, human resource management, marketing or information systems.\n\nProgram Benefits:\nHighly regarded by industryProvides students with business fundamentals and the option to explore their interestsPrepares students academically, technically and professionallyEquips students with the skills and knowledge to pursue a variety of career options in business organisations, government and non-government agencies, nationally and internationallyAllows students to obtain accreditation in the fields of accounting, marketing and human resource managementThe international exchange component develops students' international experience and outlook",
        "URL": "/Undergraduate/programs/2020/3558",
        "name": "Commerce (International)",
        "awards": "Bachelor of Commerce (International) - BCom(International)",
        "faculty": "unsw business school",
        "faculty_code": "5a3a1d4f4f4d97404aa6eb4f0310c77a",
        "code": "3558",
        "location": "Kensington"
    },
    {
        "entry_requirements": "None",
        "uac_code": "423100",
        "study_level": "Undergraduate",
        "credit_points": "144",
        "description": "The Computational Design degree is the nexus of architecture and design with engineering and science all through a profound understanding of computing and computation. Computers have infiltrated all aspects of the built environment. Thus the program focuses on applying state of the art thinking in design, architecture and urbanism with theories from engineering and science together with frontier computer skills and digital fabrication technologies. The resulting creative, technical and aesthetic solutions are taught in individual interlinked modules. The degree offers unique skills on the application of digital technologies in the built environment to face the challenges of the 21st century.",
        "URL": "/Undergraduate/programs/2020/3268",
        "name": "Computational Design",
        "awards": "Bachelor of Computational Design - BCoDe",
        "faculty": "built environment",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7ae",
        "code": "3268",
        "location": "Kensington"
    },
    {
        "entry_requirements": "Bachelor degree in Computational Design with the equivalent of a UNSW Credit average.",
        "uac_code": "None",
        "study_level": "Undergraduate",
        "credit_points": "48",
        "description": "The purpose of Honours within the Discipline of Computational Design is to enable students who have performed well at undergraduate level to deepen their knowledge of design methods, literature and history by undertaking a significant research project. Honours is a means for connecting undergraduate study with supervised independent research by consolidating and extending work completed in the undergraduate program and providing an academic foundation for students continuing on to a Professional Masters, Masters by research or a PhD. As part of the Honours program students will be expected to complete a significant independent research project and coursework study. Students will generally also be expected to undertake research literacy training, Integrity in research training, attend OH & S and safety training in the Faculty's Squarehouse studios and present at Faculty research seminars.",
        "URL": "/Undergraduate/programs/2020/4523",
        "name": "Computational Design (Honours)",
        "awards": "Bachelor of Computational Design (Honours) - BCoDe (Hons)",
        "faculty": "built environment",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7ae",
        "code": "4523",
        "location": "Kensington"
    },
    {
        "entry_requirements": "None",
        "uac_code": "425800",
        "study_level": "Undergraduate",
        "credit_points": "144",
        "description": "Computer Science involves the study of the design, construction and uses of computer systems. It is concerned with the representation of data and data structures in computer systems and the design of algorithms for automatic manipulation of this information by programming languages and machine systems. It is very much concerned with the design and development of hardware and software tools by which computer applications may be developed, but not so much with the applications themselves. It is, however, noted that non-computing elements (such as human interface or psychological aspects) can often dictate the level of success of computing systems. At UNSW, particular emphasis is given to comprehension of the basic principles behind computing tools, operating systems, compilers and translators, and computer hardware.\n\nFurther details on the program requirements, electives, and advice regarding the order and placement of courses in the program can be found at: Courses-Programs",
        "URL": "/Undergraduate/programs/2020/3778",
        "name": "Computer Science",
        "awards": "Bachelor of Science - BSc",
        "faculty": "engineering",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7af",
        "code": "3778",
        "location": "Kensington"
    },
    {
        "entry_requirements": "For admission to the Diploma, an applicant is expected to have completed Secondary School or the equivalent, such as University Foundation Studies, prior to commencement of their studies. For further details, including a statement on English language requirements, please see the Diplomas website: https://www.unswglobal.unsw.edu.au/programs-courses/diplomas/",
        "uac_code": "None",
        "study_level": "Undergraduate",
        "credit_points": "54",
        "description": "This 11 month program will provide students with the opportunity to pursue a degree inÂ Computer Science that will lead to a career in a discipline ofÂ Computer Science or related area. Students will complete a set of eight science and engineering courses in addition to a Communication and Academic Literacy course. Credit will be granted towards the Bachelor of Computer Science for each of the eight science and engineering courses which are all equivalent to First-Year UNSW courses. After successful completion of allÂ nine courses, students will receive advanced standing equivalent to one year (48 UOC) towards their degree program andÂ move into the Bachelor ofÂ Computer Science at UNSW Sydney.\nIn this Diploma program studentsÂ will be able to experience a university environment and university life, while being supported to acquire all of the knowledge and skills needed for successful transition to undergraduate studies at UNSW. Students receive a solid background in science through their science courses, while some of the engineering courses they may choose provide them with the opportunity to engage in real-life situations including the design and construction of engineering prototypes.Â The courses in this programÂ are equivalent in content and outcomes to First-Year UNSW courses but the delivery pace is slower and the face-to-face contact hours are greater. The course structure allows students to get accustomed to University learning styles - in Lectures, Laboratories, and Problem-Solving Workshops - while receiving additional support, as required, for the duration of the diploma program.",
        "URL": "/Undergraduate/programs/2020/7003",
        "name": "Computer Science",
        "awards": "Diploma in Computer Science - DipCompSc",
        "faculty": "unsw global",
        "faculty_code": "a9321f614ffd57009106fd501310c7eb",
        "code": "7003",
        "location": "Kensington"
    },
    {
        "entry_requirements": "Admission to the Bachelor of Science (Honours) is subject to:\n\nCompletion of a 3 year BSc in Computer Science or Bioinformatics at UNSW or equivalent; and\nAn overall weighted average (WAM) mark of 65 or higher.\nNomination of a suitable thesis topic which will be subject to the availability of a suitable supervisor.\n\nApplications for this program should be made via Apply Online.",
        "uac_code": "None",
        "study_level": "Undergraduate",
        "credit_points": "48",
        "description": "The Bachelor of Science (Honours) program in Computer Science and Engineering is a 1 year full-time or 2 year part-time award undertaken by eligible students after completion of a 3 year Bachelor of Science program in a relevant discipline and offers students an opportunity to deepen their understanding of the discipline through the completion of advanced coursework and a research thesis.\nThe goals of the program are to:\nProvide advanced training to enable graduates to competently undertake sophisticated computing tasks in industry and commerce.Provide investigative academic training in preparation for undertaking postgraduate research, through Masters and PhD programs.\nIn attaining these goals the following objectives are considered important:\nTo expand the scope and depth of training, by coursework, in chosen areas.To foster the development of personal initiative and group interaction by encouraging individual and cooperative investigation of topics of interest.To foster the development of creativity and project management by the planning and undertaking of significant project work in the form of a research thesis.To promote the development of verbal and written presentation skills.To provide an environment for open and free enquiry based on the accepted tenets of academic scepticism.To expose students to the rigour and excitement of novel enquiry.",
        "URL": "/Undergraduate/programs/2020/4515",
        "name": "Computer Science & Engineering (Honours)",
        "awards": "Bachelor of Science (Honours) - BSc (Hons)",
        "faculty": "engineering",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7af",
        "code": "4515",
        "location": "Kensington"
    },
    {
        "entry_requirements": "None",
        "uac_code": "450030",
        "study_level": "Undergraduate",
        "credit_points": "144",
        "description": "The Bachelor of Computing and Cyber Security is a three-year program at pass level. Students who complete the pass degree at an appropriate level may be admitted to an additional one-year Honours program.\nThe program is designed to build the graduate attributes and skills for market-ready graduates seeking a career in emerging system environments and cyber security engineering, industry, innovation, and research. The program is delivered using state-of-the-art infrastructure for software design, development, networking, security, simulation, testing, and research.\nThe BCCS introduces students to Computer Science fundamentals and builds practical system design and development and cyber security skills. The program builds from foundational topics like programming and systems analysis and design through applications of sophisticated algorithms and techniques for system development and implementation. The focus on Cyber Security develops a broad understanding of cyber security defence, offense and analysis techniques and approaches. In the third-year capstone project course, teams of students select from a variety of a real-life ADF and civilian challenges to which they apply the knowledge and skills they have developed during the program.",
        "URL": "/Undergraduate/programs/2020/4427",
        "name": "Computing and Cyber Security",
        "awards": "Bachelor of Computing and Cyber Security - BCompCybSec",
        "faculty": "unsw canberra at adfa",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7ad",
        "code": "4427",
        "location": "Canberra"
    },
    {
        "entry_requirements": "A student for enrolment for the degree of Bachelor of Computing and Cyber Security (CDF) shall hold an Australian Tertiary Admission Rank (ATAR) or equivalent of no less than 98.",
        "uac_code": "None",
        "study_level": "Undergraduate",
        "credit_points": "144",
        "description": "The Bachelor of Computing and Cyber Security (Chief of the Defence Force) is a three-year program at pass level. If eligible, students who have completed the pass degree, may be admitted to an additional one-year Honours program (Program 4517).\nThe program is designed to build the graduate attributes and skills for market-ready graduates seeking a career in emerging system environments and cyber security engineering, industry, innovation, and research. The program is delivered using state-of-the-art infrastructure for software design, development, networking, security, simulation, testing, and research.\nThe BCCS(CDF) introduces students to Computer Science fundamentals and builds practical system design and development and cyber security skills. The program builds from foundational topics like programming and systems analysis and design through applications of sophisticated algorithms and techniques for system development and implementation. The focus on Cyber Security develops a broad understanding of cyber security defence, offense and analysis techniques and approaches.\nThe Bachelor of Computing and Cyber Security (CDF) program develops studentsâ\u0080\u0099 lifetime skills including creativity, problem-solving ability, critical thinking and communication skills that will be useful not only in a Cyber Security or Cyber war environment but in all professions. It prepares students to deal with technical issues in a computing environment. It develops intellectual and practical problem-solving skills through studies across a range of computing specialisations.",
        "URL": "/Undergraduate/programs/2020/4470",
        "name": "Computing and Cyber Security (CDF)",
        "awards": "Bachelor of Computing and Cyber Security - BCompCybSec",
        "faculty": "unsw canberra at adfa",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7ad",
        "code": "4470",
        "location": "Canberra"
    },
    {
        "entry_requirements": "To enrol for the award of the degree at Honours level, a student must have:\ni) completed a relevant Computing and Cyber Security pass degree; or\nii) gained an equivalent approved award from elsewhere; and\niii) have achieved at least a credit average (65) across the entire undergraduate program including a credit average over the Level 3 core Computing and Cyber Security courses or equivalent courses.",
        "uac_code": "None",
        "study_level": "Undergraduate",
        "credit_points": "48",
        "description": "The Bachelor of Computing and Cyber Security (Honours) degree is intended for students wishing to deepen their knowledge and develop more advanced, independent research skills. The student will undertake courses that will extend their knowledge in their chosen topic area as well as enhancing their research skills. A major project will be undertaken that will result in a thesis dissertation of between 20,000 and 35,000 words. The dissertation may be larger or smaller depending on the project, the production of a specific Computing and Cyber Security artefact and discussion with the Honours supervisor.\nA student must obtain, usually over one year of study, a minimum of 48 units of credit approved by the Head of School.\nThe course work component will normally consist of four discipline-based courses (24 UOC) and two research courses (24 UOC).The thesis component will be examined by two examiners, neither of whom will be the thesis supervisor.",
        "URL": "/Undergraduate/programs/2020/4517",
        "name": "Computing and Cyber Security (Honours)",
        "awards": "Bachelor of Computing and Cyber Security (Honours) - BCompCybSec (Hons)",
        "faculty": "unsw canberra at adfa",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7ad",
        "code": "4517",
        "location": "Canberra"
    },
    {
        "entry_requirements": "None",
        "uac_code": "423200",
        "study_level": "Undergraduate",
        "credit_points": "144",
        "description": "The Bachelor of Construction Management and Property is a three-year full-time (or equivalent part-time) program of study which students undertake to develop management skills within the construction and property industries.\nStudents will acquire a sound foundation of knowledge in Construction Management, Property Development and Quantity Surveying. There is a broad emphasis on the technologies and processes of construction, and management techniques specific to the construction and property industries. The program offers a concise structure which covers essential knowledge and skills in the construction and property areas.\nThe program is geared to provide management-ready careers for men and women in the broad range of construction-related and property-related organisations.\nThe program is offered over a minimum of six semesters, leading to the award of the degree of Bachelor of Construction Management and Property (BCMP).",
        "URL": "/Undergraduate/programs/2020/3332",
        "name": "Construction Management and Property",
        "awards": "Bachelor of Construction Management and Property - BCMP",
        "faculty": "built environment",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7ae",
        "code": "3332",
        "location": "Kensington"
    },
    {
        "entry_requirements": "A Bachelors degree in Construction Management with the equivalent of a UNSW 65 WAM (Weighted Average Mark).",
        "uac_code": "None",
        "study_level": "Undergraduate",
        "credit_points": "48",
        "description": "The Bachelor of Construction Management and Property (Honours) is a one-year program which provides students with a further study option after completing a three-year degree in the construction management and property discipline area. Students can choose to do a generalist honours degree or complete honours in one of the following disciplines: Building, Property Development, Quantity Surveying.\nThe program is offered over a minimum of two semesters. Students will be required to do a major thesis project which consists of two courses (a 12uoc Thesis Foundation and a 12uoc Thesis Project). These two courses provide students with key research training and critical thinking skills. Students who choose to complete Honours in one of the specialised discipline areas will be required to do a thesis project related to their chosen specialisation, plus 3 prescribed elective courses for the specific field and 1 program elective course. Students who are doing a generalist Honours degree will take 24uoc program electives. The prescribed elective courses are all delivered at advanced level which will equip students with high-order thinking skills and business analytical skills in each specialised field.",
        "URL": "/Undergraduate/programs/2020/4522",
        "name": "Construction Management and Property (Honours)",
        "awards": "Bachelor of Construction Management and Property (Honours) - BCMP(Hons)",
        "faculty": "built environment",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7ae",
        "code": "4522",
        "location": "Kensington"
    },
    {
        "entry_requirements": "None",
        "uac_code": "422350",
        "study_level": "Undergraduate",
        "credit_points": "144",
        "description": "This program is for students commencing from 2019\nStudents commencing prior to 2019 should refer to the program rules for the year in which they started.\nThe Bachelor of Criminology & Criminal Justice (BCCJ) is an innovative and interdisciplinary field of study with a real world focus designed to explore your interests in crime, deviance, social control and the legal system. Contemporary criminological scholars investigate a broad range of topics including justice, conflict, risk, security, policing, state crime, alternative justice systems, criminalisation and regulation. Key concerns include the nature of crime, how crime is defined and measured, why people commit crime and how societies might respond. Criminologists tackle 'real world' social problems including victimisation, juvenile justice, drug-related harm, community safety, Indigenous justice, organised crime and corrections. Criminology is shaped by scholars in law, philosophy, psychology and sociology, and other interdisciplinary fields including history, politics, economics, architecture, and cultural studies. The UNSW BCCJ also provides you with the skills of applied social research and policy analysis.\nYou can complete the Bachelor of Criminology & Criminal Justice full-time in single mode (normally 3 years), in dual mode (the equivalent of two years full-time) or part-time. The basic requirements of the program are simple. The program has a depth component and a breadth component. If you are enrolled in single mode, you do both the depth and breadth component. If you are enrolled in dual mode, you only complete the depth component.\nThe depth component (Blue Zone) is:\nThe completion of a Criminology Core (36 UOC - 6 courses)The completion of a Social Research and Policy Core (42 UOC - 7 courses)The completion of Prescribed Criminology Electives (18 UOC - 3 courses)\nThe breadth component (if you are completing the program in single mode) (Green Zone) is:\nUNSW Arts and Social Sciences Prescribed Electives (12 UOC - 2 courses)Free Electives (24 UOC - 4 courses)General Education (12 UOC - 2 courses)",
        "URL": "/Undergraduate/programs/2020/3422",
        "name": "Criminology & Criminal Justice",
        "awards": "Bachelor of Criminology and Criminal Justice - BCCJ",
        "faculty": "arts and social sciences",
        "faculty_code": "d7a56ceb4f0093004aa6eb4f0310c7ac",
        "code": "3422",
        "location": "Kensington"
    },
    {
        "entry_requirements": "Students must have completed the UNSW Bachelor of Criminology & Criminal Justice or other recognised Level 7 qualification with a major in a stream offered in the program. Students in a dual degree must have completed 144 uoc including all requirements for the Criminology & Criminal Justice component. Entry to Honours requires a WAM of 70 or higher (or equivalent) in the stream(s) seeking to be further studied. It is subject to resources and the approval of the Head of School in which the stream(s) is/are based.\nThe conferral of the honours degree for dual degree students is subject to students completing all requirements of the dual degree. Students who subsequently withdraw from their dual degree after the completion of honours will only be conferred the honours degree if they have met all requirements for the single degree.\nHow to Apply\nStudents intending to apply to the Honours program must first discuss their eligibility and study program with the Honours Convenor in the relevant school prior to submitting an application.\nAll applications are to be submitted to UNSW Apply Online.",
        "uac_code": "None",
        "study_level": "Undergraduate",
        "credit_points": "48",
        "description": "The Bachelor of Criminology (Honours) [BCCJ (Hons)] is a 48 UOC (one year equivalent) advanced undergraduate degree for high achieving students which may be taken upon completion of an undergraduate pass degree in Criminology & Criminal Justice. The BCCJ (Hons) can be completed full-time or part-time.\nThe Honours Program in Criminology is designed to provide students with appropriate training and guidance for the completion of a major piece of criminological research. Graduates of the Program should be able to demonstrate their ability as autonomous researchers and are well-prepared for a research and/or policy career in criminology in a variety of organisational settings. Some may proceed to a PhD or other research degrees. The program requires completion of fourth year seminars, and a substantial research project based on original research on a topic approved by the School.\nOn successful completion of the Bachelor of Criminology (Honours), students will have the ability to:\napply a highly developed understanding of the theoretical concepts and body of knowledge in Criminology to address a research topic;reflect critically on existing knowledge, ideas and practice within Criminology to address a research topic;plan and execute an independent piece of research into an issue relevant to contemporary Criminology; andcommunicate research ideas effectively in oral presentations and in writing.",
        "URL": "/Undergraduate/programs/2020/4505",
        "name": "Criminology (Honours)",
        "awards": "Bachelor of Criminology & Criminal Justice (Honours) - BCCJ (Hons)",
        "faculty": "arts and social sciences",
        "faculty_code": "d7a56ceb4f0093004aa6eb4f0310c7ac",
        "code": "4505",
        "location": "Kensington"
    },
    {
        "entry_requirements": "None",
        "uac_code": "429150",
        "study_level": "Undergraduate",
        "credit_points": "144",
        "description": "The three-year Bachelor of Data Science and Decisions has been developed to train scientists to meet the current, and future, strong demand for Data Scientists and Data Analysts.\nGraduates will have broad and coherent knowledge and skills in Data Science across the three areas of mathematics and statistics, computer science, and economics, and they will gain deeper knowledge of Data Science in one of these three areas by pursuing studies in one of three streams.\nStudents will also have the opportunity to increase their breadth of experience using electives.\nThe Bachelor of Data Science and Decisions has been designed to:\nDevelop graduates who have a working knowledge of scientific criteria and methods of investigation, and a concern for objectivity and precision.Enable students to understand the significance of science, technology, economics and social factors in modern society, and of the contributions they can make in improving material conditions.Produce graduates able to read critically and with understanding, to think logically, and to communicate clearly by written and oral means.Create graduates able to analyse information critically in a mathematical setting.Allow students to understand the role of speculation in the selection and solution of problems, the construction of hypotheses, and the design of experiments.Train graduates to work successfully as part of a team.Train students to demonstrate knowledge and skills in formulating problems involving both qualitative and quantitative data.Produce graduates able to prepare, process, interpret and present data using appropriate qualitative and quantitative techniques.Enable students to apply mathematical and computational techniques and business sensibilities to real-world problems involving complex data sets.Encourage graduates to apply the highest ethical standards to their professional and personal livesProvide opportunities for the development of students' motivations and social maturity, and an awareness of their capabilities in relation to a choice of career which will be fruitful to themselves and to society.",
        "URL": "/Undergraduate/programs/2020/3959",
        "name": "Data Science and Decisions",
        "awards": "Bachelor of Data Science and Decisions - BDataSci",
        "faculty": "science",
        "faculty_code": "57a56ceb4f0093004aa6eb4f0310c7ae",
        "code": "3959",
        "location": "Kensington"
    },
    {
        "entry_requirements": "None",
        "uac_code": "421100",
        "study_level": "Undergraduate",
        "credit_points": "144",
        "description": "The Bachelor of Design degree program at UNSW Art & Design provides a studio based, critical, research-led education in the overarching discipline of design. We produce graduates who are both versatile and adventurous. The program builds on UNSW Art & Design's strengths in equipping graduates with a commitment to material quality coupled with critical idealism. The 3-year program emphasises a distinctive understanding of how design can change our societies, grounded in a deep reflection on diverse historical, social and cultural values. Graduates of the Bachelor of Design program understand how design-led solutions assist people to perform at their best in agile and rapidly changing environments. We also ensure that the futures that they co-design are diverse and sustainable for all peoples. The merging of making, criticality, technology, research, management and business provides graduates with transferable skills for careers across a range of existing and emerging design fields.",
        "URL": "/Undergraduate/programs/2020/4822",
        "name": "Design",
        "awards": "Bachelor of Design - BDes",
        "faculty": "art design",
        "faculty_code": "57a56ceb4f0093004aa6eb4f0310c7af",
        "code": "4822",
        "location": "Paddington"
    },
    {
        "entry_requirements": "None",
        "uac_code": "None",
        "study_level": "Undergraduate",
        "credit_points": "48",
        "description": "The DesignÂ (Honours) program is a 48 UOC (one year equivalent) advanced undergraduate degree for high achieving students. The program is designed for those who have completed an undergraduate degree in DesignÂ (or cognate area), and wish to extend their critical and creative skills in Design. The DesignÂ (Hons) enables students to advance their knowledge and understanding of designÂ practice by developing a significant practice-led research project.Â Access to UNSW Art & Designâ\u0080\u0099s leading research labs and a selective professional placement program allow students to explore the potential of design in the 21st Century.\nSupported by coursework in designÂ theory and professional practice, the program supports students to gain an in-depth understanding of the relationship between theory and practice in contemporaryÂ design and the role of design in social challenges. Graduates of the program have a developed understanding of design strategy, design methods and research for design,Â onÂ design and through design, providing career pathways to design consultancy, innovation or a diverse array of professional and career outcomes in the design and cultural sectors as well as pathways to higher degree research programs such as an MPhilÂ or PhD.",
        "URL": "/Undergraduate/programs/2020/4527",
        "name": "Design (Honours)",
        "awards": "Bachelor of Design (Honours) - BDes(Hons)",
        "faculty": "art design",
        "faculty_code": "57a56ceb4f0093004aa6eb4f0310c7af",
        "code": "4527",
        "location": "Paddington"
    },
    {
        "entry_requirements": "None",
        "uac_code": "424400",
        "study_level": "Undergraduate",
        "credit_points": "144",
        "description": "The Bachelor of Economics (BEc) is a highly regarded professional qualification allowing graduates access to an extremely diverse range of occupations. Our graduates work as professional economists and can be found in leading government and international agencies, private firms and consultancies.\n\nGraduates who combine economics with other disciplines, such as accounting, finance or marketing, often work as professionals in those fields, with the economics training providing a highly valued understanding of the business environment.\n\nMore broadly, graduates develop analytical skills which have wide applications in business, finance and policy. The knowledge obtained from the degree also enables graduates to become economically literate, with an in-depth understanding of local and world economic issues.\n\nProgram Benefits:\nHighly regarded by industry and governmentPrepares you academically, technically and professionally, providing a solid grounding in modern economics analysisDeals with important issues, such as why some countries grow rich and some remain poor, global interactions of nations, the role and impact of economic policy and regulation, unemployment, inflation, property and wealth, firm organisation and competition, decision making and strategic behaviour",
        "URL": "/Undergraduate/programs/2020/3543",
        "name": "Economics",
        "awards": "Bachelor of Economics - BEc",
        "faculty": "unsw business school",
        "faculty_code": "5a3a1d4f4f4d97404aa6eb4f0310c77a",
        "code": "3543",
        "location": "Kensington"
    },
    {
        "entry_requirements": "To be admitted into the BEc(Hons) program, a student must have completed a Bachelors degree with a major in Economics, Econometrics, Business Economics, Financial Economics, or Business Strategy and Economic Management. A student in a dual degree may gain entry to the BEc(Hons) prior to completing the requirements for the dual degree program if they have completed 144 UOC including all requirements for the relevant major.\nStudents must have completed the equivalent of the following courses to be eligible for entry:\n\nECON2101 Microeconomics 2\nECON2102 Macroeconomics 2\n\nplus an econometric course requirement that depends on the specialisation. For details, please refer to the relevant Honours specialisation.\nIt is also recommended that a student complete ECON3202 Mathematical Economics, or an equivalent, before commencing the BEc(Hons).\nStudents who have failed a course within their pass degree will not normally gain entry to the BEc(Hons) program.\nA student must have an overall Weighted Average Mark (WAM) of at least 70 (or equivalent) with a discipline/major WAM of at least 70. Due to the academic requirements of some disciplines and the competitive nature of honours places, the WAM required for entry may be higher.\nThe number of students accepted to the BEc(Hons) in a particular discipline is dependent on the availability of supervisors in that discipline. If there are more applicants than a discipline can accommodate, admission will be determined according to students' academic merit.\nFull-time and part-time (during 3 semesters) study is available in this program. Mid-year entry to the BEc(Hons) is possible, but is typically recommended only for part-time study.\nHow to Apply\nFor detailed instructions and the application form please, refer to the School of Economics Honours website.",
        "uac_code": "None",
        "study_level": "Undergraduate",
        "credit_points": "48",
        "description": "The Bachelor of Economics (Honours) is a one year advanced undergraduate degree for high-achieving students which may be undertaken upon completion of the requirements of an undergraduate pass degree. A student undertaking this program will complete honours within the economics-related specialisation (major) of their pass degree. The program enables students to expand and deepen their understanding of this discipline and develop highly sought after analytical, problem solving and research skills through undertaking a significant independent research thesis. The program may be a pathway into a PhD. Honours may be completed within the areas of Economics and Econometrics.\nProgram Benefits:\nCompetitive advantage, increased employability, attractiveness and worth resulting in more career options - either in academia, business, government or applied research through having:\nadvanced analytical and problem solving skills required for specialist careers in business and governmenthighly sought after research, project management and communication skills and advanced knowledge of the relevant discipline.",
        "URL": "/Undergraduate/programs/2020/4502",
        "name": "Economics (Honours)",
        "awards": "Bachelor of Economics (Honours) - BEc (Hons)",
        "faculty": "unsw business school",
        "faculty_code": "5a3a1d4f4f4d97404aa6eb4f0310c77a",
        "code": "4502",
        "location": "Kensington"
    },
    {
        "entry_requirements": "None",
        "uac_code": "None",
        "study_level": "Undergraduate",
        "credit_points": "144",
        "description": "Note: This program is not available as a standalone degree.\nTheÂ Bachelor of Education (Secondary) [BEd (Sec)]Â is a program for intending secondary school teachers. It is designed to be combined with another appropriate Bachelor degree (eg. Bachelor of Arts, Science, Commerce, Economics, Music, etc) in order to provide students with a nationally accredited preservice qualification in one or two approved secondary teaching specialisations. The Bachelor of Education covers both theoretical and practical aspects of education, including 80 days supervised professional experience in at least two different secondary schools. The UNSW BEd (Sec) can only be completed full-time or part-time in Dual Mode (the equivalent of two years full-time study). The Bachelor of Education in Dual Mode has a depth component but no breadth component.Â \nThe Depth component is:\nThe completion of Education Core coursesÂ (66 UOC - 10 courses)The completion of prescribed Education method courses (24 UOC - 4 courses)The completion ofÂ oneÂ prescribed EducationÂ elective (6 UOC - 1 course)",
        "URL": "/Undergraduate/programs/2020/4056",
        "name": "Education (Secondary)",
        "awards": "Bachelor of Education (Secondary) - BEd (Secondary)",
        "faculty": "arts and social sciences",
        "faculty_code": "d7a56ceb4f0093004aa6eb4f0310c7ac",
        "code": "4056",
        "location": "Kensington"
    },
    {
        "entry_requirements": "Students must have completed the UNSW Bachelor of Education or other recognised Level 7 qualification with a major in a stream offered in the program. Students in a dual degree must have completed 144 uoc including all requirements for the Education component. Entry to Honours requires a WAM of 70 or higher (or equivalent) in the stream(s) seeking to be further studied. It is subject to resources and the approval of the Head of School in which the stream(s) is/are based.\nThe conferral of the honours degree for dual degree students is subject to students completing all requirements of the dual degree.\nHow to Apply\nStudents intending to apply to the Honours program must first discuss their eligibility and study program with the Honours Convenor in the relevant school prior to submitting an application.\nAll applications are to be submitted to UNSW Apply Online.",
        "uac_code": "None",
        "study_level": "Undergraduate",
        "credit_points": "48",
        "description": "The Bachelor of Education (Honours) is a 48 UOC (one year equivalent) advanced undergraduate degree for high achieving students which may be taken upon completion of an undergraduate pass degree in Education. The focus of the Honours year is on the further development of analytical and research skills, deepening of knowledge, and application of methods specific to educational research. The program may be a pathway into a graduate research degree (MEd Research; PhD).The BEd (Hons) can be completed full-time or part-time.\nThe aims of the BEd (Hons) are:\nTo further develop the knowledge and skills acquired by students in a specific area of education in the BEd (AQF Level 7). In particular, to inculcate higher-order research skills in critical thinking, reflection and analysis.To understand educational research methods and approaches and their assumptions, and to apply them in research.To deepen disciplinary-specific knowledge and to understand its theoretical frameworks and contexts of application, and to apply such knowledge while considering, where appropriate, interdisciplinary perspectives, and historical and comparative frameworks.To appreciate the place of ethics in education and to interrogate disciplinary frameworks, assumptions and processes in light of ethical values.",
        "URL": "/Undergraduate/programs/2020/4509",
        "name": "Education (Secondary) (Hons)",
        "awards": "Bachelor of Education (Secondary) (Honours) - BEd (Sec) (Hons)",
        "faculty": "arts and social sciences",
        "faculty_code": "d7a56ceb4f0093004aa6eb4f0310c7ac",
        "code": "4509",
        "location": "Kensington"
    },
    {
        "entry_requirements": "None",
        "uac_code": "None",
        "study_level": "Undergraduate",
        "credit_points": "192",
        "description": "Engineering degrees offered by UNSW Canberra aim to provide an outstanding engineering education to future leaders in the Australian Defence Force and to civilian students to pursue excellence through contributions to research, the profession, industry and the community.\nThe Bachelor of Engineering (Honours) in Electrical Engineering is of four years duration and the degree may be awarded at Honours Class I, Honours Class II, Division I or Honours Class II, Division II. Â These Honours levels will be displayed on the final testamur. Candidates who do not achieve Honours ClassÂ I orÂ II will receive a Bachelor of Engineering (Honours) in Electrical Engineering with no honours level displayed.\nThe Bachelor of Engineering (Honours) in Electrical Engineering program at UNSW Canberra has been granted full accreditation by Engineers Australia and has been recognised by the Institute of Electrical and Electronics Engineers.\nThe Bachelor of Engineering (Honours) in Electrical Engineering is built on a foundation of mathematics, computing science and physical science. A small component of electrical engineering is introduced in the first year, with progressively larger components in second and third year. The final year is devoted exclusively to electrical engineering courses. Each year of the program comprises a number of discipline-based courses and courses taught by other discipline areas. Most courses in the first three years of the program are common for all electrical engineering students. In the fourth year students have the option to select specialty topics in areas such as communications, surveillance and radar, computer engineering and guided weapons electronics.\nElectrical Engineering is one of the newer branches of engineering. It has its origin in the turning to practical use of the discoveries of Faraday, Ampere, Maxwell and a number of other eminent 19th century physicists. It has remained the most strongly science-oriented branch of engineering.\nAt first it had its major impact by providing the means for the generation, distribution and utilisation of electric power. However, while this remains an important sub-area of the whole discipline, the last few decades particularly have seen a rapid and extensive diversification into the fields of computers and control as well as electronics and communications, and beyond them into such areas as biology, medicine and space technology. It is now true to say that there are very few areas of civilised activity that have remained untouched by the ideas and products of modern electrical engineering. The absorption of recent scientific development has been very rapid and has demanded a fully developed scientific outlook on the part of electrical engineers for a proper understanding of the problems involved. Many devices, scarcely more than laboratory prototypes a decade ago, are now in widespread use as fully engineered hardware.",
        "URL": "/Undergraduate/programs/2020/4471",
        "name": "Electrical Engineering (Honours)",
        "awards": "Bachelor of Engineering (Honours) - BE (Hons)",
        "faculty": "unsw canberra at adfa",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7ad",
        "code": "4471",
        "location": "Canberra"
    },
    {
        "entry_requirements": "None",
        "uac_code": "None",
        "study_level": "Undergraduate",
        "credit_points": "192",
        "description": "The Chief of Defence Force Honours Program in Engineering offers the opportunity for students entering UNSW Canberra with a high Entrance Rank, and who maintain a high level of performance in their studies, to undertake research in a range of disciplines that will develop their critical thinking and independent research skills beyond that available in the standard Engineering program.\nIn Year 1 of the program students will be engaged with cohort activities so as to develop and maintain their interest and continuing involvement in the program via invited lectures, seminars, general reading and social events.\nCommencing in Year 2, the research projects, each offered as separate courses, will be supervised by academic staff from the same or closely related discipline. Students in the research courses may work independently or as part of a team, depending on the nature of the project undertaken, though all students will submit individual assessment. Final assessment, due by the end of semester, will be based on a written paper and an oral presentation.\nThe Bachelor of Engineering (Honours) (CDF) in Electrical Engineering is built on a foundation of mathematics, computing science and physical science. The program is specifically designed for undergraduate students who have shown academic excellence in their studies and it incorporates significant elements of training in research methods at all years of the program. A small component of electrical engineering is introduced in the first year, with progressively larger components in second and third year. The final year is almost exclusively devoted to electrical engineering courses. Each year of the program comprises a number of discipline-based courses, courses taught by other discipline areas and problem-based learning courses.\nElectrical Engineering is one of the newer branches of engineering. It has its origin in the turning to practical use of the discoveries of Faraday, Ampere, Maxwell and a number of other eminent 19th century physicists. It has remained the most strongly science-oriented branch of engineering. At first it had its major impact by providing the means for the generation, distribution and utilisation of electric power. However, while this remains an important sub-area of the whole discipline, the last few decades particularly have seen a rapid and extensive diversification into the fields of computers and control as well as electronics and communications, and beyond them into such areas as biology, medicine and space technology. It is now true to say that there are very few areas of civilised activity that have remained untouched by the ideas and products of modern electrical engineering. The absorption of recent scientific development has been very rapid and has demanded a fully developed scientific outlook on the part of electrical engineers for a proper understanding of the problems involved. Many devices, scarcely more than laboratory prototypes a decade ago, are now in widespread use as fully engineered hardware.\nThe Bachelor of Engineering (Honours) (CDF) in Electrical Engineering has program objectives and learning outcomes in common with the standard Bachelor of Engineering (Honours) in Electrical Engineering program. The program extends the educational principles embodied in the Bachelor of Engineering (Honours) in Electrical Engineering) to a higher level of the degree. In the program, students will be exposed in first year to research methods in Engineering and will be offered significant extensions to the ideas and analysis performed in the standard degree program. This will allow them to undertake research projects, at the appropriate level, in their later years, thereby, more fully integrating research into the standard coursework undergraduate degree. The individual projects undertaken in close association with academic staff on research topics of mutual interest underpin the program and give the students the ability to develop their full potential.",
        "URL": "/Undergraduate/programs/2020/4475",
        "name": "Electrical Engineering (Honours) (CDF)",
        "awards": "Bachelor of Engineering (Honours) - BE (Hons)",
        "faculty": "unsw canberra at adfa",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7ad",
        "code": "4475",
        "location": "Canberra"
    },
    {
        "entry_requirements": "For admission to the Diploma, an applicant is expected to have completed Secondary School or the equivalent, such as University Foundation Studies, prior to commencement of their studies.  For further details, including a statement on English language requirements, please see the Diplomas website.",
        "uac_code": "None",
        "study_level": "Undergraduate",
        "credit_points": "54",
        "description": "This 11 months program will provide students with the opportunity to pursue a degree in Engineering that will lead to a career in a discipline of Engineering or related area. Students will complete a set of courses in one of 5 streams of study. Successful completion of each stream will satisfy the first year requirements for various discipline majors or specialisations in the Bachelor of Engineering (Honours) program at UNSW Sydney, and students will be granted credit towards an undergraduate degree for equivalent courses.\nIn this Diploma program students will be able to experience a university environment and university life, while being supported to acquire all of the knowledge and skills needed for successful transition to undergraduate studies at UNSW. Students receive a solid background in science through their science courses, while the engineering courses provide them with the opportunity to engage in real-life situations including the design and construction of engineering prototypes. The courses in this program have been designed to be equivalent in content and outcomes to first year UNSW courses but the pace is slower and the face-to-face contact hours are greater. The course structure allows students to get accustomed to University learning styles - in Lectures, Laboratories, and Problem-Solving Workshops - while receiving additional support as required for the duration of the Diploma.\nAfter successful completion of a stream of nine courses, students will receive credit (advanced standing) for first year of a Bachelor of Engineering (Honours) and they will progress into the second year of a Bachelor of Engineering (Honours) to pursue studies in their choice of a number of allied areas.",
        "URL": "/Undergraduate/programs/2020/7002",
        "name": "Engineering",
        "awards": "Diploma in Engineering - DipE",
        "faculty": "unsw global",
        "faculty_code": "a9321f614ffd57009106fd501310c7eb",
        "code": "7002",
        "location": "Kensington"
    },
    {
        "entry_requirements": "None",
        "uac_code": "425450",
        "study_level": "Undergraduate",
        "credit_points": "192",
        "description": "This innovative program extends the current Civil Engineering bachelor degree by the inclusion of a stream of courses in Architecture from the Faculty of the Built Environment. Civil Engineers essentially engineer and manage the infrastructure of our built environment including buildings, bridges, roads and highways, tunnels, airfields, dams, ports and harbours, railways, new mines, water supply and sewerage schemes, irrigation systems and flood mitigation works.\n\nThe Civil Engineering with Architecture program provides for an appreciation of architectural principles and an understanding of both the architect's role in construction and the interaction between architects and engineers. The ultimate aim is to help students become conceptual thinkers, inspired by beautiful creations to build even better ones, to develop an appreciation for beauty with the mathematical ability to challenge the traditional boundaries of structural design. Students graduating from this degree will be well qualified to collaborate with architects and other professionals in the built environment to produce integrated and sustainable design. Creativity and inventiveness are the key attributes of this program.\nIn the final year of the program students may elect to major in structural engineering, geotechnical engineering, transport engineering, water engineering or engineering construction and management.\n\nThis program can be taken on a four-year full-time basis or on a part-time basis subject to the approval of the Head of School. Intending part-time students are advised that all courses are offered only in the daytime.",
        "URL": "/Undergraduate/programs/2020/3635",
        "name": "Engineering (Civil Eng w Arch) (Honours)",
        "awards": "Bachelor of Engineering (Honours) - BE (Hons)",
        "faculty": "engineering",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7af",
        "code": "3635",
        "location": "Kensington"
    },
    {
        "entry_requirements": "None",
        "uac_code": "425000",
        "study_level": "Undergraduate",
        "credit_points": "192",
        "description": "The UNSW Bachelor of Engineering (Honours) is designed to equip you for a career as a professional engineer. We provide you with a solid background in mathematics, natural sciences and computing that will prepare you for learning knowledge and skills in an engineering discipline specialisation. You will get the chance to apply yourself to engineering design and enquiry projects, professional engineering practice, engineering and technical management and conduct research towards your thesis project.\nThe four year program is offered in 19 engineering disciplines (listed below). A flexible first year engineering stream is offered for students who wish to study engineering but choose to delay their choice of which branch of engineering to study until the end of Year 1.",
        "URL": "/Undergraduate/programs/2020/3707",
        "name": "Engineering (Honours)",
        "awards": "Bachelor of Engineering (Honours) - BE (Hons)",
        "faculty": "engineering",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7af",
        "code": "3707",
        "location": "Kensington"
    },
    {
        "entry_requirements": "None",
        "uac_code": "425950",
        "study_level": "Undergraduate",
        "credit_points": "240",
        "description": "This dual degree program is specifically designed for undergraduate students wishing to pursue a career in either Engineering or Biomedical Engineering. Biomedical Engineering is the application of engineering principles to developing technologies and solving problems in a diverse range of health care related fields e.g. implantable bionics, drug delivery systems, medical imaging, radiotherapies, orthopedic devices, telemedicine, robotic surgery, cell and tissue engineering, records management, physical rehabilitation and others. This program is integrated to provide fundamental engineering skills with an undergraduate focus on an engineering discipline and specialist postgraduate level training in Biomedical Engineering.\n\nAt the end of the program successful candidates will graduate with a Bachelor in Engineering (Honours) and a Masters in Biomedical Engineering. Students are expected to perform at a credit average (65%) or better in their first three years to be permitted to continue with the Masters part of the program. Students who do not satisfy this requirement can revert to the Bachelor of Engineering (Honours) program.\n\nThis dual program is currently offered for the following BE (Hons) specialisations only:\nBioinformatics EngineeringChemical EngineeringComputer EngineeringElectrical EngineeringMechanical EngineeringMechatronic EngineeringSoftware EngineeringTelecommunications",
        "URL": "/Undergraduate/programs/2020/3768",
        "name": "Engineering (Honours)/Biomedical Engineering",
        "awards": "Bachelor of Engineering (Honours) - BE (Hons)Master of Biomedical Engineering - MBiomedE",
        "faculty": "engineering",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7af",
        "code": "3768",
        "location": "Kensington"
    },
    {
        "entry_requirements": "None",
        "uac_code": "None",
        "study_level": "Undergraduate",
        "credit_points": "144",
        "description": "This program is an exit point for students from the Bachelor of Engineering (Honours) program 3707.",
        "URL": "/Undergraduate/programs/2020/3706",
        "name": "Engineering Science",
        "awards": "Bachelor of Engineering Science - BEngSc",
        "faculty": "engineering",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7af",
        "code": "3706",
        "location": "Kensington"
    },
    {
        "entry_requirements": "None",
        "uac_code": "429540",
        "study_level": "Undergraduate",
        "credit_points": "144",
        "description": "The Bachelor of Environmental Management program contains a core sequence of compulsory courses, a choice of disciplinary Majors and choices from a group of Directed Electives. The Majors include Biology, Earth Science, Ecology, Environmental Chemistry, Geography and Marine and Coastal Science.\n\nThe aim of the program is to provide a strong education in the skills and knowledge necessary to work or carry out research as an environmental scientist. In addition to the graduate attributes applicable to 3970 Bachelor of Science, graduates of the B. Env. Mgmt. will need to be able to place their understanding of the scientific aspects of the environment within the general context of the policy and legal framework of environmental regulations, as well as economic and social dimensions to environmental policy and management. The B. Env. Mgmt. is designed as a 3 year (full-time) program. There is also an opportunity for students to continue onto an Honours year in Program 4500 Science (Honours), if they satisfy the entry requirements (usually a Credit WAM) or to combine the B. Env. Mgmt. with the Masters of Environmental Management (Program 8623).",
        "URL": "/Undergraduate/programs/2020/3965",
        "name": "Environmental Management",
        "awards": "Bachelor of Environmental Management - BEnvMgmt",
        "faculty": "science",
        "faculty_code": "57a56ceb4f0093004aa6eb4f0310c7ae",
        "code": "3965",
        "location": "Kensington"
    },
    {
        "entry_requirements": "None",
        "uac_code": "428100",
        "study_level": "Undergraduate",
        "credit_points": "192",
        "description": "The program offers a comprehensive education in the area of health and exercise science with a focus on the use of physical activity as a preventative and rehabilitative therapy. Four years of full-time study leads to the award of a Bachelor of Exercise Physiology. A total of 192 units of credit must be successfully completed for the award of this degree. Graduates may expect to find employment as Accredited Exercise Physiologists (AEP) in rehabilitation clinics and hospitals working in post-acute rehabilitation, sports medicine clinics, corporate health, specialised fitness centres, and private practice for rehabilitation/exercise prescription for people requiring specialist guidance (e.g. workplace rehabilitation). The Bachelor of Exercise Physiology is accredited by the national governing body, Exercise and Sports Science Australia (ESSA). Graduates are eligible to become members of ESSA and practice as Accredited Exercise Physiologists andÂ Accredited Exercise Scientists.\nProgram Structure\nFoundation science coursesÂ are an important component of the early stages of the program and include chemistry, molecular and cellular biology, biochemistry, statistics and psychology. Building on this knowledge base, the medical sciences of anatomy, physiology, pathology and pharmacology are studied concurrently with the exercise science sub-disciplines of biomechanics, motor control and exercise psychology - leading to an integrated understanding of human function in health and disease and how this is impacted by exercise. The professional role of Exercise Physiologists is emphasised from the commencement of the program in Stage 1 exercise science courses. Clinical courses in Stage 3 cover the four broad areas of practice for Exercise Physiologists being, 1) the primary prevention of disease in apparently healthy populations, 2) the management of chronic diseases under the broad categories of cardiopulmonary and metabolic conditions, 3) musculoskeletal conditions and work hardening and 4) neuromuscular conditions. Courses offer a mixture of traditional and interactive/case study approaches to learning.\nStudents are required to complete a minimum of 12 UOC of research courses in their final year. The majority of students achieve this through enrolment in HESC4501 Exercise Physiology Research Seminars and then HESC4551 Research Project.Â However, students can opt to take an additional 6 UOC of research by enrolling in a supervised research internship.Â Â Selection of this additional research component improves student eligibility and preparedness for entry into higher degree research programs (e.g. Masters by Research; PhD). Students who choose to take a total of 18 UOC of 4th year research can take HESC4501 Exercise Physiology Research Seminars, then HESC4561 Research Internship A followed by HESC4571 Research Internship B. Enrolment in HESC4561 and HESC4571 will constitute the first and second halves, respectively, of a 20-week supervised research internship.\nStudents are required to take one elective course (6 UOC) throughout their program. This allows students to select a course according to their areas of interest and career specialisation. These may include: a research internship, or coursework focusing on cardiopulmonary conditions, metabolic conditions, musculoskeletal conditions, neuromuscular conditions, nutrition, mental health, and rehabilitation biomechanics. Specific elective courses available are listed below under Electives.\nGeneral Education is a requirement of all undergraduate programs at UNSW Sydney. Elective and General Education courses in Stage 4 provide flexibility to facilitate international exchange in the latter stage of the program, while still completing the core courses and practicum required to be eligible to become an Accredited Exercise Physiologist.",
        "URL": "/Undergraduate/programs/2020/3871",
        "name": "Exercise Physiology",
        "awards": "Bachelor of Exercise Physiology - BExPhys",
        "faculty": "medicine",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7b0",
        "code": "3871",
        "location": "Kensington"
    },
    {
        "entry_requirements": "None",
        "uac_code": "421000",
        "study_level": "Undergraduate",
        "credit_points": "144",
        "description": "The Bachelor of Fine Arts (BFA) is a three-year program (equivalent full-time) designed for those who wish to thrive in and lead the future of global contemporary art and culture. Students in the BFA are encouraged to experiment with a range of artistic processes, mediums, and techniques in order to explore their ideas, curiosities and passions. Underpinned by specialised art history and theory courses, students are also grounded in the relationship between theory and practice, helping them become highly literate in the ways that creative processes intersect with critical frameworks, concepts, and ways of thinking. The BFA has two distinct majors that allow students to focus on Studio Practice or Art Theory. Both pathways feature professional practice and research skills throughout, meaning the BFA prepares students for a diverse range of professional contexts and careers in the arts and cultural sectors. For those wishing to extend their studies on completion of the degree, the BFA program is designed to provide a pathway to the UNSW one-year Honours program.",
        "URL": "/Undergraduate/programs/2020/4821",
        "name": "Fine Arts",
        "awards": "Bachelor of Fine Arts - BFA",
        "faculty": "art design",
        "faculty_code": "57a56ceb4f0093004aa6eb4f0310c7af",
        "code": "4821",
        "location": "Paddington"
    },
    {
        "entry_requirements": "None",
        "uac_code": "None",
        "study_level": "Undergraduate",
        "credit_points": "48",
        "description": "The Bachelor of Fine Arts (Honours) is a 48 UOC (one year equivalent) advanced undergraduate degree for high achieving students. The program is designed for those who have completed an undergraduate degree in Fine Arts (or cognate area), and wish to extend their critical and creative skills in contemporary art contexts. The BFA (Hons) enables students to advance their knowledge and understanding of artistic practice by developing a significant practice-led research project. Supported by coursework in art theory and professional practice, the program supports students to gain an in-depth understanding of the relationship between theory and practice in contemporary art contexts. By doing so, this program can provide pathways to higher degree research programs such as an MFA or PhD, as well as a diverse array of professional and career outcomes in the arts and cultural sectors.",
        "URL": "/Undergraduate/programs/2020/4526",
        "name": "Fine Arts (Honours)",
        "awards": "Bachelor of Fine Arts (Honours) - BFA(Hons)",
        "faculty": "art design",
        "faculty_code": "57a56ceb4f0093004aa6eb4f0310c7af",
        "code": "4526",
        "location": "Paddington"
    },
    {
        "entry_requirements": "None",
        "uac_code": "425600",
        "study_level": "Undergraduate",
        "credit_points": "192",
        "description": "The UNSW Bachelor of Science (Honours) Food Science program is designed to equip you for a career as a professional food scientist. We provide you with a solid background in mathematics, natural and applied sciences that will prepare you for acquiring knowledge and skills in a food science specialisation. You will get the chance to apply yourself to food product design and enquiry projects, professional food practice, food systems management and conduct research towards your thesis project.\nThe four year Food Science program is offered in 2 disciplines:\nFood Science and TechnologyÂ Food Science and NutritionÂ \nBoth of these options result in the award of a Bachelor of Science (Hons).",
        "URL": "/Undergraduate/programs/2020/3061",
        "name": "Food Science (Honours)",
        "awards": "Bachelor of Science (Honours) - BSc (Hons)",
        "faculty": "engineering",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7af",
        "code": "3061",
        "location": "Kensington"
    },
    {
        "entry_requirements": "None",
        "uac_code": "None",
        "study_level": "Undergraduate",
        "credit_points": "48",
        "description": "The Humanities Pathway Program is an enabling program that provides a pathway into academic study in Arts, Social Sciences and Law for Indigenous students with gaps in their knowledge or preparation for University. Indigenous students who are highly motivated to study in these areas will find this program attractive.\nBy undertaking the Humanities Pathway program, motivated students will have the opportunity to:\nstrengthen their academic literacy and communication skills;develop their critical and analytical thinking;complete introductory courses in their chosen field andadjust to University study with a strong support structure.\nStudents who successfully complete the Law Plan will, in addition, develop foundational legal skills and knowledge and be exposed to a range of practical legal experiences which will equip them to undertake the Dual Law/Arts program.",
        "URL": "/Undergraduate/programs/2020/7016",
        "name": "Humanities",
        "awards": "Non-Award - Not Applicable - NAWD - N/A",
        "faculty": "dvcacademicboardofstudies",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7b3",
        "code": "7016",
        "location": "Kensington"
    },
    {
        "entry_requirements": "None",
        "uac_code": "None",
        "study_level": "Undergraduate",
        "credit_points": "12",
        "description": "The Nura Gili Indigenous Preparatory Program (Pre-Program) is a four-week residential program for entry to Business, Education, Law, Medicine, Science / Engineering and Social Work for Aboriginal and Torres Strait Islander people. It is a program designed for Indigenous students who do not satisfy the minimum entry requirements for admission to university studies. The course has been designed to assess your academic potential and to provide a realistic environment within which you can develop the knowledge and skills to manage your undergraduate studies effectively. On successful completion of the program students may be offered a place at UNSW in an enabling program or undergraduate degree.\nStudents must complete their program within the allocated timeframe for their chosen course.Â",
        "URL": "None",
        "name": "Indigenous Preparatory Program",
        "awards": "None",
        "faculty": "dvcacademicboardofstudies",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7b3",
        "code": "7019",
        "location": "Kensington"
    },
    {
        "entry_requirements": "None",
        "uac_code": "423300",
        "study_level": "Undergraduate",
        "credit_points": "144",
        "description": "Behind many manufactured products and services encountered at home, at work and in the public arena is the creativity, problem solving and technical know-how of an Industrial Designer. Their role is to create practical, attractive and functional products that fulfil a genuine market demand or societal need. Understanding materials, manufacturing technology and user insights within economic, social and environmental contexts in which products are produced, marketed and used is essential. Students develop their creative and professional abilities to understand and resolve these requirements while working at the frontiers of social and technological change. Graduates will work with engineers, marketers and other design and business professionals to turn good ideas into successful products. Increasingly, Industrial Designers are playing an important role beyond the production line in strategic roles involving branding, corporate identity and design focusing upon the user experience.",
        "URL": "/Undergraduate/programs/2020/3387",
        "name": "Industrial Design",
        "awards": "Bachelor of Industrial Design - BIndDes",
        "faculty": "built environment",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7ae",
        "code": "3387",
        "location": "Kensington"
    },
    {
        "entry_requirements": "None",
        "uac_code": "None",
        "study_level": "Undergraduate",
        "credit_points": "48",
        "description": "The purpose of Honours within the Discipline of Industrial Design is to enable students who have performed well at undergraduate level in an Industrial Design or aligned program area an opportunity to undertake a substantial individual project of research and design exploration, the equivalent of an Honours thesis. Building upon the Â disciplinary foundation in knowledge, literacyÂ and skills of the Bachelors degree, the Honours yearÂ enables academic excellence, social engagement and global perspective to a level where graduates are prepared for transition to professional practice. The Honours program is also aÂ  means of connecting undergraduate study with supervised independent research by consolidating and extending work completed in the undergraduate program and providing an academic foundation for students who may wish to a Masters by research or a PhD program.",
        "URL": "/Undergraduate/programs/2020/4525",
        "name": "Industrial Design (Honours)",
        "awards": "Bachelor of Industrial Design (Honours) - BIndDes(Hons)",
        "faculty": "built environment",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7ae",
        "code": "4525",
        "location": "Kensington"
    },
    {
        "entry_requirements": "None",
        "uac_code": "424500",
        "study_level": "Undergraduate",
        "credit_points": "144",
        "description": "The Bachelor of Information Systems (BIS) degree is a highly prized qualification which provides students with information systems expertise and business skills. The program is intended to develop conceptual and practical skills. After an introductory first stage, students will learn about business systems analysis and design, data management, enterprise systems, business process management, big data business analytics, business systems infrastructure and security as well as mathematics, management accounting and commercial programming.\nThis three year degree is designed for students interested in the use and application of IS and IT commercial environment. It combines courses that assist students to learn about the technical environment of IS as well as develop an understanding of the business implications of these systems. Organisations are always looking for 'business savvy' IS graduates who understand the business and technical issues which surround and impact their information systems.\nBIS graduates from this degree can target careers in areas such as: business systems analysis, information system development, communications networks analysis and development; IS security development; e-business systems development; business intelligence systems construction, business analytics and IS and IT architecture and infrastructure development and maintenance. The program includes courses from many disciplines including: Information Systems, Technology and Management, and other Commerce and Economics courses.",
        "URL": "/Undergraduate/programs/2020/3979",
        "name": "Information Systems",
        "awards": "Bachelor of Information Systems - BIS",
        "faculty": "unsw business school",
        "faculty_code": "5a3a1d4f4f4d97404aa6eb4f0310c77a",
        "code": "3979",
        "location": "Kensington"
    },
    {
        "entry_requirements": "None",
        "uac_code": "424640",
        "study_level": "Undergraduate",
        "credit_points": "192",
        "description": "The BIS (Co-op) (Hons) is a full-time four year Honours degree program. It is an industry linked education program leading to the award of the qualification Bachelor of Information Systems (Co-op) (Honours). The program draws on both Information Systems and business and is intended to develop conceptual and practical skills. After an introductory first stage, students will learn about business analysis systems and design, data management, business systems infrastructure and security as well as commercial programming statistics, management accounting and commercial programming.\n\nThe BIS (Co-op) (Hons) program has been designed in conjunction with Information Systems and Information Technology industry professionals to provide for the needs of Australian businesses. The program combines the requirements for the award of the degree with 18 months of coordinated industrial experience at three different sponsoring organisations (24 weeks at each). Industry Training extends outside university semesters. \n\nThe program combines courses that assist students to learn about the technical environment of IS as well as develop an understanding of the business implications of these systems. Organisations are always looking for business savvy IS graduates who understand the business and technical issues which surround and impact their information systems. IS graduates from this degree can target careers in areas such as: business systems analysis, information system development, communications networks analysis and development; IS security development; e-business systems development; business intelligence systems construction, and IS and IT architecture and infrastructure development and maintenance.",
        "URL": "/Undergraduate/programs/2020/3964",
        "name": "Information Systems (Co-op) (Honours)",
        "awards": "Bachelor of Information Systems (Co-op) (Honours) - BIS(Co-op)(Hons)",
        "faculty": "unsw business school",
        "faculty_code": "5a3a1d4f4f4d97404aa6eb4f0310c77a",
        "code": "3964",
        "location": "Kensington"
    },
    {
        "entry_requirements": "None",
        "uac_code": "423400",
        "study_level": "Undergraduate",
        "credit_points": "192",
        "description": "Interior Architecture at UNSW is positioned as a research-led creative practice which focuses on the design and agency of the inhabited interiors of the built environment, from the scale of the room to the scale of the city, from permanent to temporary spaces.\nOur agenda is to imagine, debate and test the contemporary interior as a key agent in the production of the built environment. We consider the interior as a dynamic and open-ended conceptual space through which the human scale and experiences inherent in the private and public spaces of our urban environments can be interrogated and projected.\nThrough a focus on material and spatial assembly, agency and affect, we foster an agile and critical approach to design enquiry, underpinned by an informed appreciation of the environmental, cultural and historic contexts of interior architecture and design. We value an expansive approach in the speculation and projection of the contemporary interior, underpinned by rigour and creative risk taking.\nOur goal is to produce industry leaders with the ethical, collaborative and creative skills that will allow them to effectively respond to the multi-disciplinary, global demands inherent in the reshaping of our future interiorscapes.",
        "URL": "/Undergraduate/programs/2020/3256",
        "name": "Interior Architecture (Honours)",
        "awards": "Bachelor of Interior Architecture (Honours) - BIA(Hons)",
        "faculty": "built environment",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7ae",
        "code": "3256",
        "location": "Kensington"
    },
    {
        "entry_requirements": "None",
        "uac_code": "428200",
        "study_level": "Undergraduate",
        "credit_points": "144",
        "description": "The Bachelor of International Public Health (BIPH) offers a unique virtual classroom experience delivered through the groundbreaking PLuS Alliance partnership between UNSW Sydney, Arizona State University and Kings College London. Through this new international alliance, BIPH students have access to world-class higher education to address global health issues, learn in a dynamic online environment and be better prepared to join a workforce that increasingly operates across cultures and borders.Â  Unlike other other public health programs in Australia the program is internationally integrated with emphasis on coursesÂ for increasing understanding and improving the health of populations worldwide. The BIPH covers theÂ covers the scope and methods of international public health including: the basic medical sciences; epidemiology and biostatistics;Â health promotion; surveillance and prevention; health policy, programs and leadership; preparing students for new approaches to emerging global and public health issues related to communicable and non communicable diseases; women and children's health;Â Indigenous peoples and climate change.Â  Students explore a diverse range of case studies spanning international contexts and population health issues and priorities developing critical capabilities needed for the global health workforceÂ  such as cultural competence, systems thinking,Â teamwork and advocacy.Â \nA highlight of the program is theÂ  Capstone Project. Students in Year 3 undertake their internship across a whole term in a local or international public health organisation focusing on their preferred area of interest for their future career developing key capabilities and networks in the field.Â  Students for example have the opportunity to study abroad in a multinational/development agency or a health service organisation and leanr key organisational and public health skills for real world practice.Â Â Â \nThe BIPH is open to domestic and international students, either school leavers or mature age entrants, and is designed for those who are interested in rewarding international opportunities in the health sector particularly in public health, health administration, health management and community development.Â Â It is designed to be completed fully online and undertaken full time or part-time and to meet the needs of students wherever they are located.\nThe BIPH program provides students with the knowledge and skills needed to succeed in a public health career, both locally and globally.Â Â The BIPH will qualify students to apply a broad and coherent body of public health knowledge for undertaking work in a range of local and international contexts and as a pathway for further postgraduate education.Potential employers may include government health departments and other related government agenciesÂ and multinationals and development agencies such as the World Health Organisation and MÃ©decins SansFrontiÃ¨res.",
        "URL": "/Undergraduate/programs/2020/3880",
        "name": "International Public Health",
        "awards": "Bachelor of International Public Health - BIPH",
        "faculty": "medicine",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7b0",
        "code": "3880",
        "location": "Kensington"
    },
    {
        "entry_requirements": "None",
        "uac_code": "422200",
        "study_level": "Undergraduate",
        "credit_points": "192",
        "description": "This program is for students commencing from 2017.\nStudents commencing prior to 2017 should refer to the handbook for the year they commenced their program.\nThe Bachelor of International Studies (UNSW BInSt) is an innovative and practical program in which you will develop a comprehensive understanding of the contemporary world, pick up a useful second language, and experience one-year of study overseas. The program satisfies a growing demand in Australia and globally for graduates who are highly skilled, internationally informed and professionally equipped to meet the challenges of work in a rapidly changing global environment.\nThe program examines the interactions of nations, economies, institutions, peoples, cultures, technologies and ideas against a background of increasing international integration and changing modernity. The program challenges you to: examine the dynamics of global and regional change; explore key issues and challenges in global change, evaluate the importance of globalisation, and debate key questions centred on nationalism, sovereignty, social change, development, and transnational interaction. You specialize in an area of study, complete language study and a one-year Overseas Study Program (OSP) at one of the more than 200 approved partner universities around the world.\nThe UNSW BInSt can be completed full-time in Single Mode (normally 4 years), in Dual Mode (the equivalent of 3 years full-time) or part-time. The basic requirements of the program are simple. The BInSt has a depth component and a breadth component. If you study in either the Single or Dual Mode, you will complete the depth component. If you study in the Single Mode, you will also complete the breadth component.\nThe Depth component is:\nThe completion of an International Studies Core (24 UOC) (4 courses)The completion of Regional Electives (12 UOC ) (2 courses)The completion of Specialist Electives (12 UOC) (2 courses)The completion of a Language Study Core (24 UOC) (4 courses)The completion of a minor stream (24 UOC) (4 courses) selected from the list of UNSW BInSt approved minor streamsThe completion of an overseas exchange (48 UOC) (2 semesters)\nThe Breadth component (if you are completing the program in Single Mode) is:\nThe completion of Arts & Social Sciences Prescribed Electives (12 UOC) (2 courses)The completion of Free Electives (24 UOC) (4 courses)General Education (12 UOC) (2 courses)\nThe aims of UNSW BInSt are:\nTo satisfy a growing demand, in Australia and abroad, for graduates who are highly skilled, well informed and professionally equipped to meet the challenges of work in a rapidly changing global environment.To give you a thorough preparation for further study and employment in areas vital to Australia's increasing participation in the international arena.To examine and develop a better understanding of the interactions of nations, economies, institutions, peoples, cultures, technologies and ideas against a background of increasing international integration and changing modernity.To promote competence in a major language or languages relevant and useful for the global economy in which we live (viz. French, German, Spanish, Chinese, Japanese, Korean, Italian, Greek and Indonesian).To provide you with the invaluable experience of other cultures, languages and peoples - experience greatly valued by employers internationally, through the completion of a one-year Overseas Study Program.",
        "URL": "/Undergraduate/programs/2020/3447",
        "name": "International Studies",
        "awards": "Bachelor of International Studies - BlnSt",
        "faculty": "arts and social sciences",
        "faculty_code": "d7a56ceb4f0093004aa6eb4f0310c7ac",
        "code": "3447",
        "location": "Kensington"
    },
    {
        "entry_requirements": "None",
        "uac_code": "423500",
        "study_level": "Undergraduate",
        "credit_points": "192",
        "description": "Landscape Architecture is a design discipline which is concerned with the environment as a whole. Students at UNSW learn the theory and practice of Landscape Architecture through the exploration of design principles, graphic techniques, ecological processes and studies of human modification of the environment. The emphasis of the program is on creative design inspired by the Australian situation, and prepares our students to work anywhere in the world.\nThe Bachelor of Landscape Architecture degree provides academic education and practical experience leading to professional qualifications in landscape architecture. It requires full time attendance for four years plus work experience that must be completed prior to graduation. For students unable to undertake full-time study, the Program Director may negotiate a part-time study schedule to enable students to complete the program over a longer period. The degree may be awarded with honours based upon the quality of overall performance and performance in the research and design project courses in the final year ofÂ study.\nThe program seeks the synthesis of knowledge and skills through project based learning in a sequence of eight Design Studios. Design projects are related to the subject matter of concurrent courses and culminate in an independent design study of regional and national significance. Lectures and practical semesters cover theoretical knowledge in the following areas:\nLandscape Architectural DesignDesign CommunicationsLandscape Architectural History and TheoryLandscape Architectural TechnologyNatural and Cultural SystemsProfessional Practice\nAt UNSW landscape architecture is taught as a powerful way of thinking and a vocation. Graduates of the UNSW landscape architecture program are creative problem solvers, able to draw on a depth and range of knowledge and skills. The vocational aspects of landscape architectural education at UNSW equip students with the theoretical and practical knowledge needed for the implementation of landscape design at site, urban and regional scales.",
        "URL": "/Undergraduate/programs/2020/3381",
        "name": "Landscape Architecture (Hons)",
        "awards": "Bachelor of Landscape Architecture (Honours) - BLArch(Hons)",
        "faculty": "built environment",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7ae",
        "code": "3381",
        "location": "Kensington"
    },
    {
        "entry_requirements": "To be eligibile to enrol in the Diploma program, students must already hold a tertiary degree or currently be enrolled in a degree program at UNSW.\n\nApplication for Admission",
        "uac_code": "None",
        "study_level": "Undergraduate",
        "credit_points": "48",
        "description": "The Diploma in Language Studies is designed to provide students with the opportunity to acquire proficiency in a second language. It requires the completion of 48 UOC in a language specialisation and related courses as approved by the School of Humanities and Languages. It may be taken concurrently with another degree program or by graduates.",
        "URL": "/Undergraduate/programs/2020/3417",
        "name": "Language Studies",
        "awards": "Diploma in Language Studies - Dip Lang Studies",
        "faculty": "arts and social sciences",
        "faculty_code": "d7a56ceb4f0093004aa6eb4f0310c7ac",
        "code": "3417",
        "location": "Kensington"
    },
    {
        "entry_requirements": "None",
        "uac_code": "None",
        "study_level": "Undergraduate",
        "credit_points": "144",
        "description": "Please note: This Program is not available for enrolment. The Bachelor of Laws (LLB) cannot be studied as a single stand alone degree.\nThe LLB must be studied with another degree. The information on this page outlines the academic requirements for completion of the Bachelor of Laws (LLB) when taken as an undergraduate double degree at UNSW.\nThe Bachelor of Laws (LLB) is an undergraduate law degree that is recognised as satisfying the academic requirements for admission as a legal practitioner in NSW. The degree is only offered in combination with another approved undergraduate degree (double degree award mode).\nThe discipline-specific (depth) component of the LLB consists of 144 Units of Credit (UOC) of Law courses through such compulsory, prescribed electives and free electives as set out below.\nThe breath component of the program is achieved by satisfactory completion of the second program undertaken in the double degree award mode. Undergradraduate double degreeÂ LLB students are not required to do General Education courses.\nStudents cannot transfer from a double degree enrolment to single degree enrolment in the LLB. Transfer from concurrent double degreeÂ enrolment to the single enrolment in the non-Law program may be available, subject to the rules of that program.",
        "URL": "/Undergraduate/programs/2020/4701",
        "name": "Law",
        "awards": "Bachelor of Laws - LLB",
        "faculty": "law",
        "faculty_code": "57a56ceb4f0093004aa6eb4f0310c7b0",
        "code": "4701",
        "location": "Kensington"
    },
    {
        "entry_requirements": "None",
        "uac_code": "None",
        "study_level": "Undergraduate",
        "credit_points": "144",
        "description": "Please note:\nThis program (LLB (Honours)) is not available for enrolment. It cannot be studied as a single stand alone degree.This program is for LLB students who commenced their LLB studies in or after 2015 who wish to graduate with an LLB (Honours) degree. Please see the list of LLB (Honours) programs below.LLB students who commenced their LLB studies before 2015 who wish to graduate with an LLB (Honours) should consult the Faculty website.Admission into the LLB (Honours) programs  is via the Faculty of Law.\nThe LLB (Honours) is for high-achieving LLB students. While most of the requirements are identical to the LLB, what distinguishes the LLB (Honours) program is the requirement to undertake a mandatory, independent research project. Like the LLB, it must be undertaken as part of a double degree.",
        "URL": "/Undergraduate/programs/2020/4702",
        "name": "Law (Honours)",
        "awards": "Bachelor of Laws (Honours) - LLB(Hons)",
        "faculty": "law",
        "faculty_code": "57a56ceb4f0093004aa6eb4f0310c7b0",
        "code": "4702",
        "location": "Kensington"
    },
    {
        "entry_requirements": "None",
        "uac_code": "429050",
        "study_level": "Undergraduate",
        "credit_points": "144",
        "description": "The three-year Life Sciences degree has been designed for students who seek a 'generalist' degree in which there is a large element of choice but with an emphasis on the life and health sciences. A student will select a major area of study and can combine courses from two or more Science disciplines, or take courses from outside the Science disciplines. There is also the option to continue into an Honours year by enrolling in a further year of study (program 4500). The basic rules for this degree are set out below.\nThis program has been designed to:\nDevelop and sustain an interest in and knowledge of Science with an emphasis on the life and health sciences;Develop a working knowledge of scientific methods of investigation;Encourage curiosity and creative imagination and an appreciation of the role of speculation in the selection and solution of problems, the construction of hypotheses, and the design of experiments;Develop an appreciation of scientific criteria and a concern for objectivity and precision;Develop confidence and skill in formulating problems and in treating both qualitative and quantitative data;Develop the ability and disposition to think logically, to communicate clearly by written and oral means, and to read critically and with understanding;Develop the habit of seeking and recognising relationships between phenomena, principles, theories, conceptual frameworks and problems;Promote understanding of the significance of science, technology, economics and social factors in modern society, and of the contributions they can make in improving material conditions;Provide opportunities for the development of students' motivations and social maturity, and an awareness of their capabilities in relation to a choice of career which will be fruitful to themselves and to society;Provide opportunity to study science in combination with other disciplines.",
        "URL": "/Undergraduate/programs/2020/3966",
        "name": "Life Sciences",
        "awards": "Bachelor of Life Sciences - BLS",
        "faculty": "science",
        "faculty_code": "57a56ceb4f0093004aa6eb4f0310c7ae",
        "code": "3966",
        "location": "Kensington"
    },
    {
        "entry_requirements": "None",
        "uac_code": "429600",
        "study_level": "Undergraduate",
        "credit_points": "192",
        "description": "The field of Materials Science and Engineering offers unlimited possibilities for innovation and development. Attention is being focused on developing and processing metals, ceramics, polymers and composites with improved properties.\nThe activities of the materials engineer range from materials production, including their extraction from ores and their refining, to the design, development, processing and recycling of materials for use in aerospace, transportation, electronics, energy conversion and biomedical systems.\nAdvanced materials can provide a major competitive advantage in virtually every part of a country's manufacturing industry. Because Australia is a country rich in minerals, materials science has been designated as a priority area for research and development. Examples of recent and significant developments include the emergence of environmentally friendly and economical metal processing methods, advanced surface coatings, biomedical materials, electrical ceramics, engineering polymers, and advanced composites.\nThe School of Materials Science and Engineering is in a good position to provide the increased numbers of graduates necessary for development of these new initiatives in materials. It is the only school in Australia that offers professional courses in ceramic engineering, metallurgical engineering and materials engineering as well as providing postgraduate specialisation in these fields.\nThe School is extremely well equipped with a wide range of advanced computing, thermal analysis, mechanical testing, X-ray and optical and electron microscopy facilities. Students are provided with education and industrial training to prepare them for a significant and important professional career.",
        "URL": "/Undergraduate/programs/2020/3131",
        "name": "Materials Science and Engineering (Honours)",
        "awards": "Bachelor of Engineering (Honours) - BE(Hons)",
        "faculty": "science",
        "faculty_code": "57a56ceb4f0093004aa6eb4f0310c7ae",
        "code": "3131",
        "location": "Kensington"
    },
    {
        "entry_requirements": "None",
        "uac_code": "429630",
        "study_level": "Undergraduate",
        "credit_points": "240",
        "description": "This dual degree program is specifically designed for undergraduate students wishing to pursue a career in either Engineering or Biomedical Engineering. Biomedical Engineering is the application of engineering principles to developing technologies and solving problems in a diverse range of health care related fields e.g. implantable bionics, drug delivery systems, medical imaging, radiotherapies, orthopedic devices, telemedicine, robotic surgery, cell and tissue engineering, records management, physical rehabilitation and others. This program is integrated to provide fundamental engineering skills with an undergraduate focus on Materials Science and Engineering and specialist postgraduate level training in Biomedical Engineering.\n\nAt the end of the program successful candidates will graduate with a Bachelor in Engineering (Honours) in Materials Science and Engineering and a Masters of Biomedical Engineering. Students are expected to perform at a credit average (65%) or better in their first three years to be permitted to continue with the Masters part of the program. Students who do not satisfy this requirement can revert to the 3131 Bachelor of Engineering (Honours) in Materials Science and Engineering program.",
        "URL": "/Undergraduate/programs/2020/3133",
        "name": "Materials Science and Engineering (Honours) / Biomedical Engineering",
        "awards": "Bachelor of Engineering (Honours) - BE (Hons)Master of Biomedical Engineering - MBiomedE",
        "faculty": "science",
        "faculty_code": "57a56ceb4f0093004aa6eb4f0310c7ae",
        "code": "3133",
        "location": "Kensington"
    },
    {
        "entry_requirements": "None",
        "uac_code": "None",
        "study_level": "Undergraduate",
        "credit_points": "192",
        "description": "All engineering degrees within UNSW Canberra aim to provide outstanding engineering education to the future leaders of the Australian Defence Force and civilian students to pursue excellence through contributions to the engineering profession, industry and the community.\nThe Bachelor of Engineering (Honours) in Mechanical Engineering is of four years duration, and the degree may be awarded at Honours Class I, Honours Class II, Division I or Honours Class II, Division II. Â These honours levels will be displayed on the final testamur. Â Candidates who do not achieve Honours Class 1 or 2 will receive aÂ Bachelor of Engineering (Honours) in Mechanical Engineering with no honours level displayed.\nMechanical Engineering is the branch of engineering that is concerned with machines and the production of power, and particularly with forces and motion. It became a separate branch of engineering in the early 1800s, when steam power began to be used in manufacture and transportation.\nOne can identify four functions that are common to all branches of mechanical engineering.\nThe first is the understanding of and dealing with the bases of mechanical science. These include dynamics, concerning the relationship between forces and motion, such as vibration; automatic control: thermodynamics, dealing with the relations among the various forms of heat, energy, and power; fluid flow; heat transfer; lubrication; and properties of materials.\nSecond is the sequence of research, design, and development. This function attempts to bring about the changes necessary to meet present and future needs. Such work requires not only a clear understanding of mechanical science and an ability to analyse a complex system into its basic factors, but also the originality to synthesise and invent.\nThird is production of products and power, which embraces planning, operation and maintenance. The goal is to produce the maximum value with the minimum investment and cost while maintaining or enhancing longer term viability of the enterprise or the institution.\nFourth is the co-ordinating function of the mechanical engineer, including management, consulting and, in some cases, marketing.\nIn all of these functions there is a long continuing trend towards the use of scientific instead of traditional or intuitive methods. Operations research, value engineering and reliability centred maintenance are typical titles of such new rationalised approaches. Creativity, however, cannot be rationalised. The ability to take the important and unexpected step that opens up new solutions remains in mechanical engineering, as elsewhere, largely a personal and spontaneous characteristic.\n(The above description was adapted from the Encyclopedia Britannica).\nExcept for Electrical Engineering and those in the Chief of Defence Force Honours Program first-year engineering and technology students enrol in a common program taking foundation science and engineering courses. In second and increasingly in third and fourth years the programs diverge into their specialities although there are some courses that span across programs in all years. A key element in all years is the design stream which emphasises complex problem solving. Other streams such as stability, control, thermofluid dynamics, structures, mechanics, materials and management often incorporate project based learning informed by academic research and industrial practice. Electives and a final year thesis enable students to pursue particular interests both within and outside the specialist discipline.\nAt the end of the program students are expected to meet the graduate attributes of the University and Stage 1 Competencies of Engineers Australia, ready to practice in their chosen profession and with the ingenuity and resourcefulness to meet rapid technological change.",
        "URL": "/Undergraduate/programs/2020/4474",
        "name": "Mechanical Engineering (Honours)",
        "awards": "Bachelor of Engineering (Honours) - BE (Hons)",
        "faculty": "unsw canberra at adfa",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7ad",
        "code": "4474",
        "location": "Canberra"
    },
    {
        "entry_requirements": "None",
        "uac_code": "None",
        "study_level": "Undergraduate",
        "credit_points": "192",
        "description": "The Chief of Defence Force Honours Program in Engineering offers the opportunity for students entering UNSW Canberra with a high Entrance Rank, and who maintain a high level of performance in their studies, to undertake research in a range of disciplines that will develop their critical thinking and independent research skills beyond that available in the standard Engineering program.\nIn Year 1 of the program, students will be engaged with cohort activities so as to develop and maintain their interest and continuing involvement in the program via invited lectures, seminars, general reading and social events.\nCommencing in Year 2, the research projects, each offered as separate courses, will be supervised by academic staff from the same or closely related discipline. Students in the research courses may work independently or as part of a team, depending on the nature of the project undertaken, though all students will submit individual assessment. Final assessment, due by the end of semester, will be based on a written paper and an oral presentation.\nThe Bachelor of Engineering (Honours) (CDF) in Mechanical Engineering program has objectives and learning outcomes in common with the standard Bachelor of Engineering (Honours) in Mechanical Engineering program. The program extends the educational principles embodied in the Bachelor of Engineering (Honours) in Mechanical Engineering to a higher level of the degree. In the program, students will be exposed in first year to research methods in Engineering and will be offered significant extensions to the ideas and analysis performed in the standard degree program. This will allow them to undertake research projects, at the appropriate level, in their later years, thereby, more fully integrating research into the standard undergraduate degree. The individual projects undertaken in close association with academic staff on research topics of mutual interest underpin the program and give the students the ability to develop their full potential.",
        "URL": "/Undergraduate/programs/2020/4478",
        "name": "Mechanical Engineering (Honours) (CDF)",
        "awards": "Bachelor of Engineering (Honours) - BE (Hons)",
        "faculty": "unsw canberra at adfa",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7ad",
        "code": "4478",
        "location": "Canberra"
    },
    {
        "entry_requirements": "None",
        "uac_code": "None",
        "study_level": "Undergraduate",
        "credit_points": "144",
        "description": "This program structure applies to students commencing prior to 2019.\nIf you are commencing from 2019 please refer to program 3454 Media (Communication and Journalism)\n\nThe Bachelor of Media (Communication and Journalism) [UNSW BMedia (C&J)] will provide you with foundational and applied skills, knowledge and capabilities in professional communication and journalism. It will prepare you to be effective producers and analysts of a wide range of communication practices, informed by a solid understanding of media theory. Relevant career pathways include journalism, corporate and organizational communication, public sector communication and public relations. While specialising in Communication and Journalism, you will also be immersed in the culture and philosophy of media studies through your courses in the media core. In Single mode, you will also be able to complete a minor stream chosen from a wide range of subject areas\n\nLevel 1 and 2 courses cover contextual knowledge of communication and journalism, and practical and theoretical skills in text production and analysis. As you proceed into Level 3, the program expands and deepens your knowledge and understanding of these skills through application to contemporary communication contexts, requiring demonstration of the ability to situate, produce and evaluate effective communication texts.\n\nThe UNSW BMedia (C&J) aims to prepare you for a leadership role in the thoughtful application of communication skills to the professional and journalistic domains, informed by a solid understanding of media theory. In this program you are not simply skilled up as writers, but you are also encouraged to become, influential and strategic communicators able to tackle complex issues by drawing on your integrated practical and theoretical expertise. You will become immersed in the current cultures of contemporary media text production and are encouraged to engage with emerging communication practices in both print-based and participatory online media, and to look for novel ways to produce and evaluate texts in these domains.\n\nGraduates will have expertise in a range of foundational communication skills, but more importantly, will be able to contribute to, evaluate and intervene in emerging practices, enabling them to take leading roles in these rapidly changing industries.",
        "URL": "/Undergraduate/programs/2020/3429",
        "name": "Media (Comm & Journalism)",
        "awards": "Bachelor of Media - BMedia",
        "faculty": "arts and social sciences",
        "faculty_code": "d7a56ceb4f0093004aa6eb4f0310c7ac",
        "code": "3429",
        "location": "Kensington"
    },
    {
        "entry_requirements": "None",
        "uac_code": "422700",
        "study_level": "Undergraduate",
        "credit_points": "144",
        "description": "This program structure applies to students commencing from 2019. If you commenced prior to 2019 please consult the Handbook for the year in which you started.\nThe Bachelor of Media (Communication and Journalism) equips you to become an effective and ethical communicator within todayâ\u0080\u0099s media industry. You will learn multi-platform storytelling techniques, developing diverse professional skills, from creating digital communication strategies to producing audio-visual news stories. Not simply skilled up as a writer, you are also encouraged to become an influential, entrepreneurial and strategic communicator able to take a leadership role, tackle complex issues, and participate in a global industry. During the program, you will be immersed in the professional cultures of contemporary production and engage with emerging communication practices. This program will also encourage you to look for novel and agile ways to produce and evaluate media texts in these domains. You willÂ reflect critically upon how vocational skills operate within, and are mediated by, political, economic, mediatised and social discourses and the dynamics of industry, governments, markets, consumer cultures, valuing regimes and society. When you graduate you will be a creative producer and analyst of a wide range of current and emerging communication and journalism practices.\nThe UNSW BMedia (C&J) can be completed full-time in Single mode (normally 3 years), or in Dual mode (the equivalent of two years full-time study) or part-time. It has a depth component and a breadth component. If you are enrolled in Single mode you do both the depth and breadth component while in Dual mode you only complete the depth component.",
        "URL": "/Undergraduate/programs/2020/3454",
        "name": "Media (Communication and Journalism)",
        "awards": "Bachelor of Media - BMedia",
        "faculty": "arts and social sciences",
        "faculty_code": "d7a56ceb4f0093004aa6eb4f0310c7ac",
        "code": "3454",
        "location": "Kensington"
    },
    {
        "entry_requirements": "Students must have completed the UNSW Bachelor of Media or other recognised Level 7 qualification with a major in a stream offered in the program. Students in a dual degree must have completed 144 uoc including all requirements for the Media component. Entry to Honours requires a WAM of 70 or higher (or equivalent) in the media courses and the stream seeking to be further studied. The WAM for the Screen & Sound Production stream will also include the film studies courses. It is subject to resources and the approval of the Head of School in which the stream(s) is/are based.\nThe conferral of the honours degree for dual degree students is subject to students completing all requirements of the dual degree. Students who subsequently withdraw from their dual degree after the completion of honours will only be conferred the honours degree if they have met all requirements for the single degree.\nHow to Apply\nStudents intending to apply to the Honours program must first discuss their eligiblity and study program with the Honours Convenor in the relevant school prior to submitting an application.\nAll applications are to be submitted to UNSW Apply Online.",
        "uac_code": "None",
        "study_level": "Undergraduate",
        "credit_points": "48",
        "description": "The Bachelor of Media (Honours) is a 48 UOC (one year equivalent) advanced undergraduate degree for high achieving students which may be undertaken upon completion of an undergraduate pass degree in Media. The BMedia (Hons) can be completed full-time or part-time. A student undertaking this program will complete honours within the area of media specialisation in their pass degree. The program enables students to expand and deepen their knowledge and understanding of Media and to develop highly sought after analytical, problem solving and research skills through undertaking a significant independent research thesis or a practice-based research project. The program may be a pathway to a PhD.",
        "URL": "/Undergraduate/programs/2020/4510",
        "name": "Media (Honours)",
        "awards": "Bachelor of Media (Honours) - BMedia (Hons)",
        "faculty": "arts and social sciences",
        "faculty_code": "d7a56ceb4f0093004aa6eb4f0310c7ac",
        "code": "4510",
        "location": "Kensington"
    },
    {
        "entry_requirements": "None",
        "uac_code": "None",
        "study_level": "Undergraduate",
        "credit_points": "144",
        "description": "This program structure applies to students commencing prior to 2019. \nIf you are commencing from 2019 please refer to program 3453 Media (PR and Advertising)\n\nThe Bachelor of Media (PR and Advertising) [UNSW BMedia (PR&A)] is designed to provide you with foundational and applied skills, knowledge and capabilities in public relations and advertising. The program aims to develop communication leaders who inspire innovation and change at all levels of society and adhere to the highest ethical standards. The BMedia (PR&A) program is structured to offer a philosophical and cultural foundation in the media studies core, conceptual and practical skills in public relations and advertising, and access to free electives that provide a more general education.\n\nLevel 1 focuses on contextual knowledge of communication industries, Level 2 introduces communication theory, and Level 3 of the program deepens your knowledge of how such theories play out in society. At each level, an industry specific course in public relations or advertising is offered that augments the conceptual development and offers vocationally relevant knowledge in strategic communication. You are encouraged to think beyond industry specific problems to reflect on the broader socio-cultural, political and economic implications of the roles and responsibilities of public relations and advertising. The program focuses, in particular, on engagement, innovation and creativity.\n\nThe UNSW BMedia (PR&A) aims to develop your understanding of professional communication in contemporary Australian and international contexts. In particular, the program aims to provide you with knowledge of and opportunities to engage critically with debates relating to the fields of public relations and advertising. You will examine the role and responsibilities of persuasive communication in a democratic society and learn how to add value through engagement in social and environmental innovation and enterprise. The program will offer you the opportunity to reflect critically upon how your vocational skills operate within and are mediated by political, economic, mediatised and social discourses and the dynamics of industry, governments, markets, consumer cultures, valuing regimes and society. Modes of professional communication including informative, persuasive, political, creative, promotional, digital and interpersonal discourse will be examined. The program also aims to help you develop an in-depth understanding of how to ethically engage with publics and communities, creatively engage with communication concepts and production technology, and professionally engage with organisational practices.",
        "URL": "/Undergraduate/programs/2020/3434",
        "name": "Media (PR and Advertising)",
        "awards": "Bachelor of Media - BMedia",
        "faculty": "arts and social sciences",
        "faculty_code": "d7a56ceb4f0093004aa6eb4f0310c7ac",
        "code": "3434",
        "location": "Kensington"
    },
    {
        "entry_requirements": "None",
        "uac_code": "422710",
        "study_level": "Undergraduate",
        "credit_points": "144",
        "description": "This program structure applies to students commencing in 2019.Â If you commenced prior to 2019 please consult the Handbook for the year in which you started.\nThe UNSW Bachelor of Media (Public Relations andÂ Advertising) aims to equip youÂ with professional skills suitable for taking up roles in contemporary Australian and international public relations and advertising contexts. During the program, you willÂ examine the role and responsibilities of persuasive communication in a democratic society and learn how to add value through engagement in social and environmental innovation and enterprise. The program offers opportunities to reflect critically upon how vocational skills operate within, and are mediated by, political, economic, mediatised and social discourses and the dynamics of industry, governments, markets, consumer cultures, valuing regimes and society. Skills in modes of professional communication including informative, persuasive, political, creative, promotional, digital, and interpersonal discourse are developed. The program also aims to help youÂ develop an in-depth understanding of how to engage ethically with publics, audiences and communities; engage creatively with communication concepts and production technology; and engage professionally with organisational practices. When you graduate you will have expertise in a range of communication skills, but more importantly, will be able to contribute to, evaluate and intervene in, emerging practices; and, thus, be ableÂ to take leading roles in rapidly changing media industries.\nThe UNSW BMedia (PR&A) can be completed full-time in Single mode (normally 3 years), in Dual mode (the equivalent of two years full-time study) or part-time. It has a depth component and a breadth component. If you are enrolled in Single mode you do both the depth and breadth component while in Dual mode you only complete the depth component.",
        "URL": "/Undergraduate/programs/2020/3453",
        "name": "Media (Public Relations and Advertising)",
        "awards": "Bachelor of Media - BMedia",
        "faculty": "arts and social sciences",
        "faculty_code": "d7a56ceb4f0093004aa6eb4f0310c7ac",
        "code": "3453",
        "location": "Kensington"
    },
    {
        "entry_requirements": "None",
        "uac_code": "422720",
        "study_level": "Undergraduate",
        "credit_points": "144",
        "description": "THIS PROGRAM IS FOR STUDENTS COMMENCING IN 2015 ONWARDS.\n\nThe Bachelor of Media (Screen and Sound Production) [UNSW BMedia (S&SP)] is designed to provide you with foundational and applied skills, knowledge and capabilities relevant to career pathways in a broad range of audio-visual, digital and screen production industries. The emphasis is on the acquisition of relevant creative and professional skills relevant to current media industry contexts, along with a sophisticated conceptual understanding of the increasingly convergent role of media and film in contemporary societies.\n\nThrough a suite of electives, you will gain practical experience in digital film and sound production, animation, interaction and game design in a degree that is both ideas driven and vocationally relevant in its orientation. You will gain foundational practical experience in the thoughtful and creative application of established and emerging media technologies, while also being immersed in the history, culture and philosophy of media and film studies through a diverse suite of core and elective courses. The balance between practice and theory, film and media enables you to be at the forefront of an increasingly convergent media landscape.\n\nAt level 1 you will study introductory courses in film and media studies and also take a range of foundational courses in video production, sonic arts as well as a course that introduces you to foundational principles of graphic design, animation and interaction design.\n\nAt Levels 2 and 3 you select from a wide range of production and project-based courses to expand and deepen your knowledge and understanding in the technical, analytical and conceptual application of various media forms including audio-visual production, screenwriting, animation and game design. Concurrently, you will continue to expand your knowledge of the histories, theories and cultures in the disciplinary courses in film and media studies. It is here that you will develop discipline specific and generic skills in critical and creative thought, writing, research and presentation.\n\nThe UNSW BMedia (S&SP) aims to prepare graduates for a leadership role in the thoughtful application of screen and sound production technologies informed by a solid understanding of film and media histories, theories and cultures. Graduates will also gain a deep understanding of the convergence of film and media industries in the contemporary world. You are not simply skilled up in the use of video and sound recorders, computers and media applications, but are encouraged to become thoughtful and resourceful professionals capable of tackling complex issues by drawing on your integrated practical and theoretical expertise. You will become immersed in the current culture of contemporary screen and sound production and theory. You are encouraged to test out emerging ideas and developments and look for novel ways to approach the planning and production of contemporary audio-visual and digital media projects. Graduates will gain foundational expertise in a range of screen and sound production tools, but more importantly, you will be able to interpret and reflect on emerging audio-visual practices and increasingly diverse screen environments, enabling you to take leading, imaginative and inventive roles in the rapidly changing media industries.",
        "URL": "/Undergraduate/programs/2020/3438",
        "name": "Media (Screen and Sound Production)",
        "awards": "Bachelor of Media - BMedia",
        "faculty": "arts and social sciences",
        "faculty_code": "d7a56ceb4f0093004aa6eb4f0310c7ac",
        "code": "3438",
        "location": "Kensington"
    },
    {
        "entry_requirements": "None",
        "uac_code": "421200",
        "study_level": "Undergraduate",
        "credit_points": "144",
        "description": "The Bachelor of Media Arts (BMA) is a three-year program (equivalent full-time) that prepares students to thrive in a variety of media arts contexts. In a world of rapidly changing digital technologies, the BMA recognises the need for imaginative, informed, and critically-oriented media practitioners now and into the future. With a focus on developing skills and knowledge across a range of digital, interactive, and screen-based media, the BMA allows students to experiment with a variety of media technologies, platforms, and ideas. Whether working with video, sound, digital imaging, 3D modelling, animation, or interactive and immersive technologies, BMA students are given opportunities to explore their individual interests within a supportive and peer-oriented learning environment. Bolstered by studies in media arts histories and theories, BMA students simultaneously develop their creative and critical thinking skills within the domain of digital media. Graduates of this program are not only technically adept, they are also imaginative, responsive, and critically informed, enabling them to undertake careers across the entertainment, art and design, creative media, and technology industries. Through deep understandings of theory and practice, graduates are equipped to creatively respond to and lead to the mediated experiences of the future.",
        "URL": "/Undergraduate/programs/2020/4813",
        "name": "Media Arts",
        "awards": "Bachelor of Media Arts - BMA",
        "faculty": "art design",
        "faculty_code": "57a56ceb4f0093004aa6eb4f0310c7af",
        "code": "4813",
        "location": "Paddington"
    },
    {
        "entry_requirements": "None",
        "uac_code": "None",
        "study_level": "Undergraduate",
        "credit_points": "48",
        "description": "The Bachelor of MediaÂ Arts (Honours) is a 48 UOC (one year equivalent) advanced undergraduate degree for high achieving students. The program is designed for those who have completed an undergraduate degree in MediaÂ Arts (or cognate area), and wish to extend their critical and creative skills inÂ mediaÂ arts contexts. The BMA (Hons) enables students to advance their knowledge and understanding of creativeÂ practice by developing a significant practice-led research project. Supported by coursework in art and design theory and professional practice, the program supports students to gain an in-depth understanding of the relationship between theory and practice in contemporary media arts contexts. By doing so, this program can provide pathways to higher degree research programs such as an MFA or PhD, as well as a diverse array of professional and career outcomes in the arts, media, and cultural sectors.",
        "URL": "/Undergraduate/programs/2020/4528",
        "name": "Media Arts (Honours)",
        "awards": "Bachelor of Media Arts (Honours) - BMA(Hons)",
        "faculty": "art design",
        "faculty_code": "57a56ceb4f0093004aa6eb4f0310c7af",
        "code": "4528",
        "location": "Paddington"
    },
    {
        "entry_requirements": "None",
        "uac_code": "429700",
        "study_level": "Undergraduate",
        "credit_points": "144",
        "description": "This three-year degree program is jointly offered by the Faculty of Medicine and the Faculty of Science. It provides the basis for a career in biomedical research and is also an appropriate first degree for students planning to enter graduate medical or paramedical programs.\nMedical Science is the area of science which underpins the practice of medicine. It incorporates the study of structure and chemistry of the cells that make up living organisms (Cell & Molecular Biology and Biochemistry) with particular reference to humans, and specifically of the structure and function of the human body (Anatomy and Physiology). It then deals with the general processes leading to disease (Pathology), the role of bacteria, viruses and other micro-organisms in disease (Microbiology) as well as drugs which are used to cure human diseases (Pharmacology). Other areas available for study include the way in which our form and function is inherited (Genetics), the processes of development from the fertilised ovum (Embryology), the natural defences of the body (Immunology) and the study of the structure and function of the brain (Neuroscience).\nStudents completing this program with exceptional performance may have the opportunity to enrol in an Honours program leading to an Honours degree.\nA limited number of high-performing students may be able to gain entry to the UNSW Medicine program with advanced standing. For more information, please click here.\nStudents intending to apply for entry via this pathway must have completed all compulsory courses by the end of Stage 2.",
        "URL": "/Undergraduate/programs/2020/3991",
        "name": "Medical Science",
        "awards": "Bachelor of Medical Science - BMedSc",
        "faculty": "science",
        "faculty_code": "57a56ceb4f0093004aa6eb4f0310c7ae",
        "code": "3991",
        "location": "Kensington"
    },
    {
        "entry_requirements": "None",
        "uac_code": "429720",
        "study_level": "Undergraduate",
        "credit_points": "192",
        "description": "Important: prior to 2016 this program was known as 3992 Bachelor of Medicinal Chemistry. Students must follow the Handbook of the year they commenced their program, so continuing students should refer to the past edition Handbook here.\nThe Bachelor of Medicinal Chemistry (Honours) is a professionally oriented, truly interdisciplinary program taught as a joint initiative between the Schools of Chemistry and Biotechnology & Biomolecular Sciences (Faculty of Science), and the Pharmacology section of the School of Medical Sciences (Faculty of Medicine).\nMedicinal Chemistry is an exciting, rapidly-expanding area within the broad discipline of Chemistry that has seen enormous growth recently both within Australia and globally. It is, quite simply, the development of new pharmaceutical agents, from Concept to Clinic. Many different stages are involved; from the design and synthesis of novel drug candidates, to their biochemical effects, testing regimes and regulatory and ethical considerations. The Medicinal Chemistry (Honours) program had been designed to ensure that graduates will have a strong background in contemporary biology, biochemistry and pharmacology, based upon a solid foundation of essential chemistry.\nGraduates from the Medicinal Chemistry(Honours) program will be equipped with a unique and wide harmony of skills, ranging from fundamental chemistry enabling the synthesis and analysis of drug candidates, through to relevant pharmacology and molecular biology skills. This combination will see graduates in high demand both locally and globally in pharmaceutical companies involved in modern drug design. In addition, the multidisciplinary nature of the program will mean that graduates will also be highly marketable within other science-based industries and related fields. The research focus in the Honours year, which provides projects that emphasise the interdisciplinary and collaborative nature of the area, will also enable students to progress seamlessly into a higher degree if they wish.\nGraduates will obtain a broad education across a range of relevant scientific areas, as well as a strong grounding in advanced biological and chemical techniques. There will be particular emphasis on the medical sciences. The first year of the program will provide solid foundation knowledge in some fundamental areas of science, chemistry, mathematics, and biology- as well as specific graduate attributes courses. Year two and three will focus on chemistry, pharmacology, and biochemistry, with a number of recommended electives to broaden a student's knowledge in relevant fields (physiology, anatomy, genetics). The fourth (Honours) year provides a substantial research experience.",
        "URL": "/Undergraduate/programs/2020/3999",
        "name": "Medicinal Chemistry (Honours)",
        "awards": "Bachelor of Medicinal Chemistry (Honours) - BMedChem(Hons)",
        "faculty": "science",
        "faculty_code": "57a56ceb4f0093004aa6eb4f0310c7ae",
        "code": "3999",
        "location": "Kensington"
    },
    {
        "entry_requirements": "The majority of students are admitted into Medicine following a selection process based on academic merit, performance in the UMAT and performance at an interview. Only students selected for entry into Medicine can enrol in the BMed program.\nA limited number of students in the BMedSc program at UNSW may apply for entry into the Medicine program. Students offered a provisional place at the end of second year will undertake a plan of study specific to entry to UNSW Medicine including a number of bridging courses in conjunction with their Honours research project. After entry into Medicine, the students will complete the Phase 2 Integrated Clinical Studies courses and all Phase 3 courses.",
        "uac_code": "428000",
        "study_level": "Undergraduate",
        "credit_points": "288",
        "description": "UNSW Medicine offers a six year integrated Medicine program (288 UOC) which leads to the awards of Bachelor of Medical Studies (BMed) and Doctor of Medicine (MD).\nThe program includes a compulsory Independent Learning Project (30 UOC) to ensure that all graduates acquire knowledge of research principles and methods applicable to Medicine and its professional practice.\nThe objectives of the Medicine program are:\nTo establish an integrated, interconnected and organised medical knowledge base as a platform for a professional and personal life of learning through experience.To develop effective interactions with oneself through reflection; interaction with others through communication; and interaction with information and learning resources through information literacy and critical analysis.To develop a set of personal attributes and skills appropriate to the professional practice of Medicine.\nThe program is organised into two degrees:\nBachelor of Medical Studies (BMed)\nThe BMed includes Phase 1 and Phase 2. Phase 1 commences with the Foundations course, followed by 7 x 8 week courses focussing on basic medical sciences in relation to the human life cycle; social, ethical and legal issues related to health care; and early experience in clinical or other health-related environments. During this phase, students will undertake a variety of learning activities involving students from different stages of the program working collaboratively in small groups.\nPhase 2 consists of 2 x 16-week courses, with increased clinical content and an emphasis on correlation between prior and current learning.\nDoctor of Medicine (MD)\nThe MD includes the Independent Learning Project (ILP), followed by a Clinical Transition Course prior to the Phase 3 courses. During the Independent Learning Project students should also complete 12 UOC of General Education courses in a faculty or faculties other than Medicine.\nPhase 3 consists of 10 x 8-week courses with a clinical focus, but still includes relevant content from the basic medical sciences and the social sciences. Students are required to complete a course in the disciplines of Internal Medicine, Surgery, Psychiatry, Primary Care, Obstetrics and Gynaecology and Children's Health (Paediatrics). Students may choose from a range of other available clinical modules to complete Phase 3 requirements. In addition, a student's clinical experiences during Phase 3 must include a minimum of 4 weeks in a rural location. All clinical courses in Phase 3 adopt the principles of clinical clerkship, in which students learn through experience and participation in the treatment of patients under the care of medical practitioners and/or medical teams to which they are attached.\nStudents who have achieved a high standard in the BMed may undertake a one year program of supervised research leading to the award of the BSc(Med) Honours. Students wishing to undertake a full year of research may be able to enrol in the BSc (Med) Honours program 3831 subject to the approval from the Honours Committee. These students will be exempt from undertaking the Independent Learning Project. Exemption from the Independent Learning Project will also be granted to students who have previously completed a research Honours program or higher research degree, or a Master degree with a significant research component, or who can otherwise demonstrate acceptable evidence of independent study or research at a tertiary level.",
        "URL": "/Undergraduate/programs/2020/3805",
        "name": "Medicine",
        "awards": "Bachelor of Medical Studies - BMedDoctor of Medicine - MD",
        "faculty": "medicine",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7b0",
        "code": "3805",
        "location": "Kensington"
    },
    {
        "entry_requirements": "None",
        "uac_code": "422500",
        "study_level": "Undergraduate",
        "credit_points": "192",
        "description": "The Bachelor of Music (BMus) is a four-year, full-time degree that offers intensive pre-professional training in one of four specialisations: Music Creative Practice, Musicology, Sonic Arts, and Music Pedagogy. The first 1.5 years are common to all specialisations. All BMus candidates receive individual performance tuition (or composition tuition on approval) for the first two years of the program. Music Pedagogy candidates receive additional individual performance tuition in year three of the program and Music Creative Practice candidates receive additional individual performance tuition (or composition tuition) in years three and four of the program.\n\nMusic Creative Practice students may specialise in performance or composition in a self-selected musical style or tradition, including Jazz or World Music on approval. Musicology provides a highly academic focus on studies in Historical Musicology, Ethnomusicology, Music Analysis or the Psychology of Music. Sonic Arts develops technical and creative skills in Electro-Acoustic music and Sound Design and provides links with Media Studies at UNSW. Music Pedagogy provides a course of study in studio teaching with an emphasis on practical application and preparation for further study in music education. All specialisations include extensive training in developing musicianship skills and ensemble performance, which is supported by a variety of large and small, Western and Non-Western Music ensembles.\nThe BMus can be completed full-time in single mode (normally four years) and in Dual mode (the equivalent of three years full-time) or part-time. High-achieving students with a minimum WAM of 70 may, at the completion of all requirements for levels 1-3 apply to transfer to the Bachelor of Music (Honours) 3440.\n\nThe BMus has a depth component and a breadth component. Students enrolled in single mode do both the depth and breadth component while students enrolled in Dual mode only complete the depth component. Dual mode enables students to complete a degree in music and another degree.\nThe Depth component is:\nThe completion of core courses (102 UOC - 114 UOC )The completion of a stream including the Gateway course (6 UOC) and two Stream courses (12 UOC)The completion of two Prescribed Music Electives (12 UOC - 24 UOC)\nThe Breadth component is:\nPrescribed Faculty Electives (12 UOC)Free Electives (24 UOC)General Education (12 UOC)\nNote: Single mode students intending to transfer to the Honours program must complete all level 1-3 core courses and Stream course requirements as well as all breadthÂ course requirements before proceeding to level 4. A minimum WAM of 70 is required for entry to the Honours program.",
        "URL": "/Undergraduate/programs/2020/3436",
        "name": "Music",
        "awards": "Bachelor of Music - BMus",
        "faculty": "arts and social sciences",
        "faculty_code": "d7a56ceb4f0093004aa6eb4f0310c7ac",
        "code": "3436",
        "location": "Kensington"
    },
    {
        "entry_requirements": "The first three years of the Bachelor of Music 3436 and Bachelor of Music (Honours) 3440 are common to both degrees. Before transferring to the Bachelor of Music (Honours) students must successfully complete all core and stream requirements for levels 1-3 of the Bachelor of Music, attain a minimum WAM of 70 in Music courses and, in Single mode, must have completed all General Education, Free Elective and Arts and Social Sciences Prescribed Elective requirements. \n\nAn Advanced Entry Scheme is available to suitably qualified applicants. Students admitted into the advanced entry scheme may receive a block credit of up to 36 UOC in Level 1 music courses.",
        "uac_code": "None",
        "study_level": "Undergraduate",
        "credit_points": "192",
        "description": "THIS PROGRAM IS FOR STUDENTS TRANSFERRING INTO HONOURS FROM PROGRAM 3436 BACHELOR OF MUSIC THROUGH A UNSW INTERNAL PROGRAM TRANSFER.\nThe Bachelor of Music (Honours) is specifically for high-achieving students already admitted to the 4-year Bachelor of Music program 3436. It allows Bachelor of Music students to spend their final year of study completing a research thesis or a practice-based research project and thesis as well as undertaking discipline specific research training through the coursework component.\nThe first three years of the Bachelor of Music and Bachelor of Music (Honours) are common to both degrees. Before transferring to the Bachelor of Music (Honours) students must successfully complete all core and stream requirements for levels 1-3 of the Bachelor of Music, attain a minimum WAM of 70 in Music courses and, in Single mode, must have completed all General Education, Free Elective and UNSW Arts and Social Sciences Prescribed Elective requirements. Students undertaking the Bachelor of Music (Honours) in Dual mode must complete all core and stream requirements for levels 1-3 (96 UOC) of the Bachelor of Music before proceeding to level 4.\nStudents undertaking the Bachelor of Music (Honours) in Dual mode with the Bachelor of Arts must also have completed their General Education requirements (12 UOC) by the end of year three.\nFor a detailed description of years 1-3 of the Bachelor of Music (Honours), please refer to the program description for the Bachelor of Music 3436 and the relevant stream information.\nThe Bachelor of Music (Honours) can be completed full-time in Single mode (normally 4 years) and in Dual mode (the equivalent of three years full-time) or part-time.\nThe Bachelor of Music (Honours) has a depth component and a breadth component. Students enrolled in single mode do both the depth and breadth component while students enrolled in Dual mode only complete the depth component. Dual mode enables students to complete a degree in music and another degree.\nThe Depth (Blue Zone) component is:\nLevels 1-3\nThe completion of core courses at levels 1-3 (78 UOC)The completion of a stream including the Gateway course (6 UOC) and two Stream courses (12 UOC)\nLevel 4\nThe completion of a research-based course (6 UOC)The completion of a practice-based course (6 UOC)The completion of a research thesis (36 UOC)\nOR\nThe completion of a research-based course (6 UOC)The completion of a practice-based course (6 UOC)The completion of a Creative Practice research project (24 UOC)The completion of a research thesis (12 UOC)\nThe Breadth (Green Zone) component is:\nUNSW Arts and Social Sciences Prescribed Electives (12 UOC)Free Electives (24 UOC)General Education (12 UOC)\nNote: Single mode students intending to transfer to the Honours program must complete all Blue Zone level 1-3 core courses and Stream course requirements as well as all Green Zone course requirements before proceeding to level 4. A minimum WAM of 70 is required for entry to the Honours program.",
        "URL": "/Undergraduate/programs/2020/3440",
        "name": "Music (Honours)",
        "awards": "Bachelor of Music (Honours) - BMus (Hons)",
        "faculty": "arts and social sciences",
        "faculty_code": "d7a56ceb4f0093004aa6eb4f0310c7ac",
        "code": "3440",
        "location": "Kensington"
    },
    {
        "entry_requirements": "Students must have completed the UNSW Bachelor of Music or other recognised Level 7 qualification with a major in a stream offered in the program. Students in a dual degree must have completed 144 uoc including all requirements for the Music component. Entry to Honours requires a WAM of 70 or higher (or equivalent) in the stream seeking to be further studied. It is subject to resources and the approval of the Head of School in which the stream is based.\nThe conferral of the honours degree for dual degree students is subject to students completing all requirements of the dual degree. Students who subsequently withdraw from their dual degree after the completion of honours will only be conferred the honours degree if they have met all requirements for the single degree.\nHow to Apply\nStudents intending to apply to the Honours program must first discuss their eligibility and study program with the Honours Convenor in the relevant school prior to submitting an application.\nAll applications are to be submitted to UNSW Apply Online.",
        "uac_code": "None",
        "study_level": "Undergraduate",
        "credit_points": "48",
        "description": "The Bachelor of Music (Honours) is a 48 UOC (one year equivalent) advanced undergraduate degree for high achieving students which may be taken upon completion of an undergraduate pass degree in Music. The BMus (Hons) can be completed full-time or part-time.\nThe program enables students to further explore their studies in an area of musicological or practice-based research. The Honours year involves seminars and a thesis for candidates focusing on music research OR seminars, a thesis, and the completion of a practice-based project for candidates focusing on music practice. The program may be a pathway into a PhD.\nThe aims of the BMus (Hons) are to develop:\na deeper understanding of theories and knowledge in an area of musicological researchthe ability to critique existing musicological knowledge, ideas and practice as it applies to a specific research topicthe skills to plan and execute independent researchthe ability to present and communicate research effectively through writing.\nAdditional aims for creative practice candidates are to develop:\nan understanding of knowledge practices in music performance and compositionknowledge, skills, and resources for research in music performance or compositioncreative practice through collaboration between performers, composers and scholars.",
        "URL": "/Undergraduate/programs/2020/4508",
        "name": "Music (Honours)",
        "awards": "Bachelor of Music (Honours) - BMus (Hons)",
        "faculty": "arts and social sciences",
        "faculty_code": "d7a56ceb4f0093004aa6eb4f0310c7ac",
        "code": "4508",
        "location": "Kensington"
    },
    {
        "entry_requirements": "None",
        "uac_code": "422310",
        "study_level": "Undergraduate",
        "credit_points": "144",
        "description": "The Bachelor of Politics, Philosophy and Economics (BPPE) provides graduates with a uniquely powerful combination of intellectual tools with which to understand and act on the world. PPE graduates globally are recognised leaders in all aspects of public life, including the highest reaches of government, political parties and lobby groups, the public service, NGOs, and social activist organisations. It also equips students for careers in banking, consultancy work, and strategic advising to major corporations. PPE graduates are alsoÂ well knownÂ as public commentators on contemporary issues. The PPE will help you bring the perspectives of three crucial intellectual disciplines toÂ pressing contemporary national and global issues such as justice, inequality and climate change. As well as combining a carefully chosen combination of existing courses from the Politics and International Relations, Philosophy, and Economics streams, the program will include courses specifically designed to enable you to explore the synergies and tensions between them and assess their relevance to meeting humanity's most difficult challenges.",
        "URL": "/Undergraduate/programs/2020/3478",
        "name": "Politics, Philosophy and Economics",
        "awards": "Bachelor of Politics, Philosophy and Economics - BPPE",
        "faculty": "arts and social sciences",
        "faculty_code": "d7a56ceb4f0093004aa6eb4f0310c7ac",
        "code": "3478",
        "location": "Kensington"
    },
    {
        "entry_requirements": "None",
        "uac_code": "429800",
        "study_level": "Undergraduate",
        "credit_points": "144",
        "description": "Psychology is a discipline of both scientific research and applied practice. As a science, psychology is concerned with the study of behaviour and its underlying mental and neural processes. Students gain an integrated and comprehensive education in main discipline areas, including developmental, social, cognitive, biological, physiological and abnormal psychology. The program also develops research methods skills. Psychology has many areas of cutting edge interdisciplinary research and application and students have an option to pursue individual interests, choosing electives from a range of specialist areas, including psychology and law; psychology and work; development disorders; psychopathology; health psychology, language, cognitive science, neuroscience and others.\nPsychology has many areas of application, especially in clinical, correctional, counselling, educational, and organisational settings. In addition, people with training in psychology pursue careers in academic research, health research, developmental disabilities and rehabilitation, ergonomics, occupational health and safety, personnel selection, training, and management, vocational guidance, and marketing.\nThe program allows students to complete an APAC-accredited undergraduate sequence in psychology across three years. The program is designed to allow students to complete a complementary major (in a related discipline where there is a professional and/or academic rationale that supports the proposed combination). Complementary majors available outside of the Faculty of Science include marketing, human resource management, management, criminology, linguistics and philosophy. From the Faculty of Science, students may choose a complementary majorÂ in neuroscience or vision science. Upon completion of this program students may choose to complete an additional fourth year program in psychology (Honours), subject to satisfying the entry requirements (refer to the Pathways section).\nThe basic rules for the degree are set out under the Program Structure section of this Handbook. Students must ensure that they complete a minimum of 78 units of credit (UoC) in Psychology, a combination of PSYCxxxx core and PSYC3xxxÂ elective courses (as defined under Program Structure). The remaining UoC may comprise of courses offered by the Faculty of Science or any other Faculty. Please consult the School of Psychology for detailed definitions of complementary majors and their appropriate program structures (refer to the Sample Programs section).",
        "URL": "/Undergraduate/programs/2020/3435",
        "name": "Psychological Science",
        "awards": "Bachelor of Psychological Science - BPsychSc",
        "faculty": "science",
        "faculty_code": "57a56ceb4f0093004aa6eb4f0310c7ae",
        "code": "3435",
        "location": "Kensington"
    },
    {
        "entry_requirements": "Internal applicants (current UNSW students)\nEntry is obtained by achieving a Psychology Average mark of at least 75%. The Psychology Average is calculated from:\n\nMarks for psychology core courses common to all psychology programs / plans (see below); and\nThe three highest of marks for all Level 3 psychology electives ever attempted.\n\nThe psychology core courses are as follows:\n\nLevel 1: PSYC1001 Psychology 1A, PSYC1011 Psychology 1B, PSYC1111 Measuring Mind and Behaviour\nLevel 2: PSYC2001 Research Methods 2, PSYC2061 Social and Developmental Psychology, PSYC2071 Perception and Cognition, PSYC2081 Learning and Physiological Psychology, PSYC2101 Assessment, Personality and Psychopathology\nLevel 3: PSYC3001 Research Methods 3, PSYC3011 Research and Applications of Psychology\n\nNOTE:\n\nPsychology courses taken at another university do not count towards the Psychology Average.\nLevel 1 PSYC electives do not count towards the Psychology Average.\nThe average is based on a student’s mark for the first attempt at courses.\nCompletion of PSYC3371 Multivariate Data Analysis for Psychology, in conjunction with PSYC3001, is important as preparation for the Honours year. Students can take PSYC3371 as a Stream A or Stream B elective.\n\nExternal applicants (non-UNSW students)\nApplicants from other institutions must have completed, within the last 10 years, a three-year undergraduate sequence in psychology (accredited as such by the Australian Psychology Accreditation Council (APAC)). Applicants with international psychology qualifications must have the qualifications assessed by the Australian Psychological Society (APS) before submitting an application.\nPlaces are offered to external applicants on the basis of merit. The number of places available for external applicants (if any) varies from year to year and depends upon the number of eligible internal applicants and the availability of School resources.  Only external applicants with an exceptional academic record in psychology (i.e., Psychology WAM of 80 and above) are encouraged to submit an application.",
        "uac_code": "None",
        "study_level": "Undergraduate",
        "credit_points": "48",
        "description": "The purpose of Honours in Psychology is to enable students who have performed well at undergraduate level to deepen their knowledge of approaches, perspectives and traditions in psychology and undertake a significant research project. Honours is a means for connecting undergraduate study with supervised independent research by consolidating and extending work completed in the undergraduate program and providing an academic foundation for students continuing on to a Masters by coursework, a Masters by research, or a PhD.\nStudents conduct a year-long, 30 UOC major independent research project (completed under the guidance of an academic supervisor), and write a thesis based on the project. In addition, students complete 18 UOC of advanced-level core and elective coursework in both Term 1 and Term 2.\nThe research project may be undertaken in most areas of psychology, such as: psychopathology, behavioural neuroscience,Â cognitive science,Â cognition and perception,Â forensic psychology,Â and social, personality and developmental psychology. The project culminates in a written thesis, which is assessed independently by two academics (neither of which is the student's supervisor).\nThe coursework requirement includes content that encompasses history, professional ethics, evidence-based practice and advanced coverage of selected contemporary issues in psychology that reflect the expertise and research specialisations of School staff.",
        "URL": "/Undergraduate/programs/2020/4518",
        "name": "Psychological Science (Honours)",
        "awards": "Bachelor of Psychological Science (Honours) - BPsychSc(Hons)",
        "faculty": "science",
        "faculty_code": "57a56ceb4f0093004aa6eb4f0310c7ae",
        "code": "4518",
        "location": "Kensington"
    },
    {
        "entry_requirements": "None",
        "uac_code": "429850",
        "study_level": "Undergraduate",
        "credit_points": "192",
        "description": "Psychology is a discipline of both scientific research and applied practice. As a science, psychology is concerned with the study of behaviour and its underlying mental and neural processes. Topics of study include learning, memory, cognition, perception, motivation, life-span development, personality, social interactions, and abnormal psychology. The program also develops research methods skills. Psychology has many areas of cutting edge interdisciplinary research and application and students have an option to pursue individual interests, choosing electives from a range of specialist areas, including psychology and law; psychology and work; development disorders; psychopathology; health psychology, language, cognitive science, neuroscience and others.\nPsychology has many areas of application, especially in clinical, correctional, counselling, educational, and organisational settings. In addition, people with training in psychology pursue careers in academic research, health research, developmental disabilities and rehabilitation, ergonomics, occupational health and safety, personnel selection, training, and management, vocational guidance, and marketing.\nIn the fourth year of the program, students conduct a year-long, 30 UOC major independent research project (completed under the guidance of an academic supervisor), and write a thesis based on the project. In addition, students complete 18 UOC of advanced-level core and elective coursework in both Term 1 and Term 2.\nThe research project may be undertaken in most areas of psychology including: psychopathology; behavioural neuroscience; cognitive science; cognition and perception; forensic psychology; and social, personality and developmental psychology. The project culminates in a written thesis, which is assessed independently by two academics (neither of which is the student's supervisor).\nThe coursework requirement includes content that encompasses history, professional ethics, evidence-based practice and advanced coverage of selected contemporary issues in psychology that reflect the expertise and research specialisations of School staff.",
        "URL": "/Undergraduate/programs/2020/3632",
        "name": "Psychology (Honours)",
        "awards": "Bachelor of Psychology (Honours) - BPsych(Hons)",
        "faculty": "science",
        "faculty_code": "57a56ceb4f0093004aa6eb4f0310c7ae",
        "code": "3632",
        "location": "Kensington"
    },
    {
        "entry_requirements": "None",
        "uac_code": "429000",
        "study_level": "Undergraduate",
        "credit_points": "144",
        "description": "The three-year Bachelor of Science allows you to study a wide range of science subjects as well as many other areas of interest. This degree is ideal for students who seek a 'generalist' degree in which there is a large element of choice. Students are encouraged to choose a broad range of courses in the first year, to expand their general understanding of Science which then enables them to choose from a wide selection of major options in the second and third year. There is also the option to apply for an additional Honours year at the end of the three years, subject to a student's academic performance and other criteria. The rules and requirements for the degree are set out below.",
        "URL": "/Undergraduate/programs/2020/3970",
        "name": "Science",
        "awards": "Bachelor of Science - BSc",
        "faculty": "science",
        "faculty_code": "57a56ceb4f0093004aa6eb4f0310c7ae",
        "code": "3970",
        "location": "Kensington"
    },
    {
        "entry_requirements": "None",
        "uac_code": "None",
        "study_level": "Undergraduate",
        "credit_points": "144",
        "description": "This program is not available to international or Defence sponsored students.\n\nThe School of Engineering and Information Technology (SEIT) and the School of Physical, Environmental and Mathematical Sciences (PEMS) offer a dual degree program which qualifies students for two degrees after the equivalent of five years of successful full-time study leading to the award of the degrees Bachelor of Engineering (Aeronautical) (Honours) and Bachelor of Science(BE (Aero) (Hons) BSc). The School of Engineering and Information Technology (SEIT) will administer the program. Students should seek advice from the relevant School Office in the first instance, or from Student Administrative Services, UNSW Canberra.",
        "URL": "/Undergraduate/programs/2020/4415",
        "name": "Science",
        "awards": "Bachelor of Science - BSc",
        "faculty": "unsw canberra at adfa",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7ad",
        "code": "4415",
        "location": "Canberra"
    },
    {
        "entry_requirements": "None",
        "uac_code": "450020",
        "study_level": "Undergraduate",
        "credit_points": "144",
        "description": "The Bachelor of Science is a three-year program at pass level. A separate four-year program at Honours level (Program Code 4513) is also available for eligible applicants.\nScience is the understanding of the physical universe (from sub-atomic particles and microbes through to the planetâ\u0080\u0099s environment and the origin of the universe itself), and human interactions with it. Just as important is the scientific process by which this understanding is gained. In turn, Science is the foundation of the modern technologies that enhance the quality of lives and provide ever more sophisticated means of applying the scientific process. In addition, Science is crucial in control of disease, biotechnology, new sustainable energy sources, information technology, and management of precious natural resources.\nPass-level students in Science should complete their programs within three years. Honours students who are RAN midshipmen or RAAF officer cadets continue with their programs at UNSW Canberra at ADFA and complete their programs at the end of the fourth year. Army officer cadets, however, at the end of the third year transfer to the Royal Military College, Duntroon. After completing a year of military training they are commissioned as lieutenants and those who are continuing with Honours return to the Academy to complete their program.\nA Bachelor of Science program will develop studentsâ\u0080\u0099 lifetime skills including creativity, problem-solving ability, critical thinking and communication skills that will be useful not only in a scientific environment but in all professions. It will prepare students to deal with technical and management issues that will often require scientific knowledge and the intellectual and practical problem-solving skills developed through studies in physical, environmental and mathematical sciences, and information technology.",
        "URL": "/Undergraduate/programs/2020/4410",
        "name": "Science",
        "awards": "Bachelor of Science - BSc",
        "faculty": "unsw canberra at adfa",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7ad",
        "code": "4410",
        "location": "Canberra"
    },
    {
        "entry_requirements": "For admission to the Diploma, an applicant is usually expected to have completed Secondary School or the equivalent, such as University Foundation Studies, prior to commencement of their studies.  For further details, including a statement on English language requirements, please see the Diplomas website.",
        "uac_code": "None",
        "study_level": "Undergraduate",
        "credit_points": "48",
        "description": "This 11 month program will provide students with the opportunity to pursue a degree in Science that will lead to a career in a discipline of Science or a science-related area. Students will complete a set of courses in one of two streams of study: a Physical, Chemical and Mathematical Sciences stream, or a Biological and Medical Sciences stream. Successful completion of each stream will satisfy the first year requirements for various majors or specialisations in the Bachelor of Science program at UNSW Sydney, and students will be granted credit towards an undergraduate degree for equivalent courses.\nIn this Diploma program students will be able to experience a university environment and university life, while being supported to acquire all of the knowledge and skills needed for successful transition to undergraduate studies at UNSW. The courses in this program have been designed to be equivalent in content and outcomes to first year UNSW courses but the pace is slower and the face-to-face contact hours are greater. The course structure allows students to get accustomed to University learning styles - in Lectures, Laboratories, and Problem-Solving Workshops - while receiving additional support as required for the duration of the Diploma.\nAfter successful completion of a stream of eight courses, students will receive credit (advanced standing) for first year of a Bachelor of Science and they will progress into the second year of a Bachelor of Science to pursue studies in their choice of a number of allied areas.",
        "URL": "/Undergraduate/programs/2020/7001",
        "name": "Science",
        "awards": "Diploma in Science - DipSc",
        "faculty": "unsw global",
        "faculty_code": "a9321f614ffd57009106fd501310c7eb",
        "code": "7001",
        "location": "Kensington"
    },
    {
        "entry_requirements": "None",
        "uac_code": "None",
        "study_level": "Undergraduate",
        "credit_points": "144",
        "description": "The Chief of Defence Force Students (CDFS) Programs in Arts, Business, Engineering, Science and Technology - Aeronautical offer the opportunity for students entering UNSW Canberra with a high Entrance Rank, and who maintain a high level of performance in their studies, to undertake research in a range of disciplines that will develop their critical thinking and independent research skills beyond that available in the standard Bachelor Degree programs.\nThe range of CDFS Programs, described in detail in the following sections, is characterised by the inclusion of specialist courses in critical analysis and/or research methods appropriate to the area of study. All programs also include discipline-specific research projects. The research projects will be supervised by academic staff from the relevant discipline. With the approval of the relevant Heads of Schools, multi- or cross-disciplinary projects may be undertaken. Students in the research courses may work independently or as part of a team, depending on the nature of the project undertaken, though all students will submit individual assessment. Final assessment will be based on a written paper or report and oral presentations.\nThroughout the program, and in addition to completing the courses given in the following schedules, students will be engaged with cohort activities so as to develop and maintain their interest and continuing involvement in the program via invited lectures, seminars, general reading and social events.\nThe CDFS Programs are of three-years' duration in Arts, Business, Science and Technology - Aeronautical.\nEach of the CDFS Programs has objectives and learning outcomes in common with the standard Bachelor degree in the same area, but extends the educational principles embodied in the standard degree to a higher level. In the programs, students will be exposed to courses in critical analysis and/or research methods in the discipline(s) of their chosen program, which will offer significant extensions to the ideas and analysis normally available in the standard degree program. This will allow all CDFS to successfully undertake research-oriented courses at the appropriate level through their program, thereby integrating research into their studies in a way that is not available in the standard degree. The individual projects undertaken in close association with academic staff on research topics of mutual interest underpin the CDFS Programs and give students the ability to develop their full potential.",
        "URL": "/Undergraduate/programs/2020/4463",
        "name": "Science (CDF)",
        "awards": "Bachelor of Science - BSc",
        "faculty": "unsw canberra at adfa",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7ad",
        "code": "4463",
        "location": "Canberra"
    },
    {
        "entry_requirements": "Admission Requirements and Process\nStudents are expected to have completed the requirements for a three year full-time undergraduate Bachelor degree typically with a minimum overall WAM (weighted average mark) of a credit, and completed a major within the desired honours discipline. However, the academic requirements for particular disciplines within Science may be higher due to the competitive nature of Honours in some disciplines and the number of Honours places available within a School. Disciplines may also have particular prerequisite requirements for entry into Honours, and may consider a student’s performance in their major area of study when assessing their eligibility for admission. Students must apply to the relevant School for admission into Honours, and admission requirements as well as the number of places available are determined by the Head of School or nominee. For details of the entry requirements for a particular discipline, please see the relevant plan entry in this Handbook.\nTo apply for admission to Honours, students should contact the relevant School for information on research projects, available supervisors, and entry requirements. Once students have located a suitable supervisor, they should lodge an application for Honours to the School by the advertised deadlines. Deadlines for these are found on the School’s webpages. Students who have not completed their undergraduate degree at UNSW, or completed their UNSW degree at least 6 months beforehand, will need to lodge two applications – one to the relevant School, and another to the UNSW Admissions Office.\nNote: this Honours program is the honours pathway from the following UNSW Science programs: 3980 Bachelor of Aviation (Flying), 3981 Bachelor of Aviation (Management); 3970 Bachelor of Science, 3925 Bachelor of Science and Business, 3965 Bachelor of Science (Environmental Management), 3987 Bachelor of Science (International), and 3991 Bachelor of Medical Science, and the associated dual degrees.",
        "uac_code": "None",
        "study_level": "Undergraduate",
        "credit_points": "48",
        "description": "The purpose of Honours in the Faculty of Science is to enable students who have performed well at undergraduate level to deepen their knowledge of approaches, perspectives and traditions in their chosen scientific discipline and undertake a significant research project. Honours is a means for connecting undergraduate study with supervised independent research by consolidating and extending work completed in the undergraduate program and providing an academic foundation for students continuing on to a Masters by research or a PhD.\nAs part of the honours program students will be expected to complete a significant independent research project and may be expected to complete coursework. As the Faculty has a diverse range of disciplines the exact proportion of research-based work and coursework may differ by School. Students should refer to the plan pages in this Handbook for details of the different Honours programs.\nIn addition to conducting research and coursework students will generally also be expected to undertake Occupational Health & Safety (OH&S) training, attend and present seminars, write a literature review, and write a thesis.",
        "URL": "/Undergraduate/programs/2020/4500",
        "name": "Science (Honours)",
        "awards": "Bachelor of Science (Honours) - BSc(Hons)",
        "faculty": "science",
        "faculty_code": "57a56ceb4f0093004aa6eb4f0310c7ae",
        "code": "4500",
        "location": "Kensington"
    },
    {
        "entry_requirements": "To apply for admission to the award of the degree at Honours level, an applicant must have:\n\nsuccessfully completed a three year BSc with a major in the relevant honours discipline at UNSW Canberra at ADFA; or\ngained a BSc degree from another approved institution; and\nachieved at least a credit average (65%) across the entire undergraduate program including a credit average over the Level III courses in the discipline in which honours is proposed.",
        "uac_code": "None",
        "study_level": "Undergraduate",
        "credit_points": "48",
        "description": "The Bachelor of Science (Honours) is a one-year program following on from a three year full-time equivalent pass degree.\nThe purpose of Honours is to enable students who have performed well at undergraduate level to deepen their knowledge of approaches, perspectives and traditions in their chosen scientific discipline and undertake a significant research project. Honours is a means for connecting undergraduate study with supervised independent research by consolidating and extending work completed in the undergraduate program. As part of the honours program students will be expected to complete a significant independent research project and may be expected to complete coursework. In addition to conducting research and coursework students will generally also be expected to undertake Occupational Health & Safety (OH&S) training, attend and present seminars, write a literature review, and write a thesis.\nPathways\nStudents who complete an Honours program and achieve an Honours Class 1 are well placed to apply for higher degree research (a Doctor of Philosophy (PhD) or Masters by Research (MSc)) and scholarships such as the Australian Postgraduate Award (APA). Further details on career opportunities for students who complete an Honours degree can be obtained from the School.\nA Bachelor of Science (Honours) program will develop students' lifetime skills including creativity, problem-solving ability, critical thinking and communication skills that will be useful not only in a scientific environment but in all professions. It will prepare students to deal with technical and management issues that will often require scientific knowledge and the intellectual and practical problem-solving skills developed through studies in physical, environmental and mathematical sciences, and information technology. The key focus of the Honours year is to equip students with research and problem solving skills relevant to their discipline.",
        "URL": "/Undergraduate/programs/2020/4513",
        "name": "Science (Honours)",
        "awards": "Bachelor of Science (Honours) - BSc (Hons)",
        "faculty": "unsw canberra at adfa",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7ad",
        "code": "4513",
        "location": "Canberra"
    },
    {
        "entry_requirements": "None",
        "uac_code": "429420",
        "study_level": "Undergraduate",
        "credit_points": "192",
        "description": "The Bachelor of Science (International) recognises that science involves a global network, which is faced with and addresses global issues and often operates within companies and agencies that have an international focus. The BSc (International) is thus aimed at providing for the needs of students by preparing them for an increasingly globalised work environment.\nThe program is designed for students wishing to obtain a strong and highly regarded Science program coupled with specific emphasis on cross-cultural skills, knowledge and understanding. The program also provides the knowledge and skills essential for understanding and working in the rapidly changing global environment. It will provide a wide range of career opportunities in global scientific organisations and companies, international government and non-government agencies and in scientific research. The program requires students to undertake a coherent scientific program, achieved by completing a science-based major and adds a series of directed electives to provide a suite of attributes associated with 'global education'. The program also places emphasis on cross cultural understanding, competencies in languages and incorporates a period of overseas study. The Faculty provides a contribution to the expenses of this exchange.\nThe objectives of the program are:\nTo graduate scientists with both a breadth and depth of scientific knowledge and professional skills;To develop the capacity for critical thinking and independent learning;To expose students to the social context of science, to the globalization of science, the global issues in science and provide a greater appreciation and sensitivity to the cultural context of knowledge and learning in science;To foster greater cross cultural understanding and the development of international professional networks.",
        "URL": "/Undergraduate/programs/2020/3987",
        "name": "Science (International)",
        "awards": "Bachelor of Science (International) - BSc(International)",
        "faculty": "science",
        "faculty_code": "57a56ceb4f0093004aa6eb4f0310c7ae",
        "code": "3987",
        "location": "Kensington"
    },
    {
        "entry_requirements": "For candidates in the programs 3802, 3805, 3841, 3845 and 3855\n1.(a) Undergraduates who have successfully completed at least the first three years of the six year Medicine program (3802 or 3805), or at least the first four years of the Arts/Medicine program (3841, 3845, or 3855) may enrol for the degree of BSc(Med)Hons in a program approved by the BSc(Med)Hons Committee. \n(b) A student may register as a candidate for the degree in any of the Clinical Schools of UNSW Medicine, the School of Biochemistry, the School of Microbiology or the School of Psychology, subject to the permission of the Head of the School concerned and the BSc(Med)Hons Committee. Registration in any other School will be considered on a case-by-case basis, and is subject to the permission of the Head of School concerned and the BSc(Med)Hons Committee. \n2. The program for each candidate shall be designed to introduce the student to research in the appropriate discipline and shall consist of such formal and special work and any examinations prescribed by the BSc(Med)Hons Committee.",
        "uac_code": "None",
        "study_level": "Undergraduate",
        "credit_points": "48",
        "description": "Information regarding this program can also be obtained from the UNSW Medicine website\nThis is a one year research program offered to students in the six year Medicine program or Arts/Medicine who have achieved a high standard in their studies. Those who complete the research program in conjunction with the six year curriculum will be eligible for the award of the degree BSc(Med)Hons.\nIn general the aims of the year, normally spent in supervised research, are to enable the student to acquire an appreciation of the value of observation and research in the development of medical science, to determine the 'current state of knowledge' in a defined field, to provide experience in the written and spoken presentation of scientific information and scholarly research, and to provide an invaluable background in basic research philosophy and techniques on which a subsequent career in specialised medical research may be built, and develop an understanding of, and ability to interpret research that underpins evidenced-based clinical practice. This year enables the student to gain experience in the written and spoken presentation of scientific information.Â Â",
        "URL": "/Undergraduate/programs/2020/3831",
        "name": "Science (Medicine) Honours",
        "awards": "Bachelor of Science (Medicine) Honours - BSc(Med)Hons",
        "faculty": "medicine",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7b0",
        "code": "3831",
        "location": "Kensington"
    },
    {
        "entry_requirements": "None",
        "uac_code": "429100",
        "study_level": "Undergraduate",
        "credit_points": "144",
        "description": "The three-year Bachelor of Science and Business has been developed to provide a new generation of scientists for today's increasingly competitive and business-aware world. This program allows students to combine a coherent stream of studies in a contemporary Science discipline with courses that provide a broad background to business and management. Students will study a range of foundation business courses that will provide exposure to several aspects of business practices, and will also have the opportunity to increase their breadth of experience using electives, and select from a limited number of higher year courses to gain a greater understanding of a feature of the commercial domain. The program has been designed for students whose passion is Science, but who also recognise that awareness of contemporary business practices can be vital in the modern workplace.",
        "URL": "/Undergraduate/programs/2020/3925",
        "name": "Science and Business",
        "awards": "Bachelor of Science and Business - BSc&Bus",
        "faculty": "science",
        "faculty_code": "57a56ceb4f0093004aa6eb4f0310c7ae",
        "code": "3925",
        "location": "Kensington"
    },
    {
        "entry_requirements": "Students must have completed the UNSW Bachelor of Social Research & Policy or other recognised Level 7 qualification with a major in a stream offered in the program. Students in a dual degree must have completed 144 uoc including all requirements for the Social Research & Policy component. Entry to Honours requires a WAM of 70 or higher (or equivalent) in the stream(s) seeking to be further studied. It is subject to resources and the approval of the Head of School in which the stream(s) is/are based.\nThe conferral of the honours degree for dual degree students is subject to students completing all requirements of the dual degree. Students who subsequently withdraw from their dual degree after the completion of honours will only be conferred the honours degree if they have met all requirements for the single degree.\nHow to Apply\nStudents intending to apply to the Honours program must first discuss their eligibility and study program with the Honours Convenor in the relevant school prior to submitting an application.\nAll applications are to be submitted to UNSW Apply Online.",
        "uac_code": "None",
        "study_level": "Undergraduate",
        "credit_points": "48",
        "description": "The Bachelor of Social Research & Policy (Honours) is a 48 UOC (one year equivalent) advanced undergraduate degree for high achieving students which may be undertaken upon completion of an undergraduate pass degree in Social Research and Policy. The BSRP(Hons) can be completed full-time or part-time. A student undertaking this program will normally complete Honours within the policy specialisation (stream) of their Bachelor degree. The program enables students to expand and deepen their understanding of this discipline and develop highly sought after analytical, problem solving and research skills through undertaking a significant independent research thesis. The program may be a pathway into a PhD.\nOn successful completion of the Bachelor of Social Research & Policy (Honours) students will have the ability to:\napply a highly developed understanding of the theoretical concepts and body of knowledge in Social Research & Policy to address a research topic;reflect critically on existing knowledge, ideas and practice within Social Research & Policy to address a research topic;plan and execute an independent piece of research into an issue relevant to contemporary Social Research & Policy; andcommunicate research ideas effectively in oral presentations and in writing.",
        "URL": "/Undergraduate/programs/2020/4507",
        "name": "Social Research & Policy(Hons)",
        "awards": "Bachelor of Social Research & Policy (Honours) - BSRP (Hons)",
        "faculty": "arts and social sciences",
        "faculty_code": "d7a56ceb4f0093004aa6eb4f0310c7ac",
        "code": "4507",
        "location": "Kensington"
    },
    {
        "entry_requirements": "None",
        "uac_code": "422300",
        "study_level": "Undergraduate",
        "credit_points": "144",
        "description": "This program is for students commencing from 2019.\nStudents commencing prior to 2019 should refer to the program rules for the year in which they started.\nThe Bachelor of Social Research and Policy (UNSW BSRP) degree combines a core program of skills in policy analysis and research methods with in-depth study in one or more social science disciplines. The degree requires one major stream of study in an approved social science discipline and a minimum level of electives. You will have the opportunity to further develop your professional and workplace skills through an internship and career-orientated focus. The UNSW BSRP can be completed full-time in Single mode (normally 3 years), in Dual mode (the equivalent of 2.5 years full-time study) or part-time. The BSRP has a depth component and a breadth component. If you are enrolled in Single mode you will do both the depth and breadth component. If you are enrolled in Dual mode you will only complete the depth component.\nA Bachelor of Social Research and Policy degree offers the opportunity to pursue knowledge in the social research and policy while developing technical and professional skills to apply this knowledge to issues in the real world. Its objectives are:\nto develop your capacity to critically evaluate ideas and policy problems, andto undertake social research in order to contribute to enlightened policy-making.\nSkills developed include written communication skills with particular emphasis on reports, submissions, position papers and proposals; the ability to undertake research and data analysis, both quantitative and qualitative; analysis and critical evaluation of research, arguments and policies; and technologies involved in social research and information processing. The internship experience promotes development of excellence in professional practice.\nIf you study in either the single or dual mode, you will complete:\na social research and policy core of 54 UOC (nine courses)a social research and policy prescribed elective of 6 UOC (one course)a major stream of 60 UOC (ten courses) selected from the list of UNSW BSRP approved home and external major streams.\nIf you study in single mode, you will also complete:\n12 UOC of Free Electives (two courses)12 UOC of General Education (two courses)",
        "URL": "/Undergraduate/programs/2020/3420",
        "name": "Social Research and Policy",
        "awards": "Bachelor of Social Research and Policy - BSRP",
        "faculty": "arts and social sciences",
        "faculty_code": "d7a56ceb4f0093004aa6eb4f0310c7ac",
        "code": "3420",
        "location": "Kensington"
    },
    {
        "entry_requirements": "None",
        "uac_code": "422400",
        "study_level": "Undergraduate",
        "credit_points": "192",
        "description": "This program is for students commencing from 2019.\nStudents commencing prior to 2019 should refer to the program rules for the year in which they started.\nThe Bachelor of Social Work with Honours (UNSW BSW Hons) offers you an innovative and accredited program leading to qualification as a professional social worker with eligibility for membership of the Australian Association of Social Workers (AASW). The UNSW BSW (Hons) includes studies in the areas of social work practice, social and behavioural sciences, and fields of practice which include, work with Aboriginal people, counselling skills, community and group work, ethical practice, working with mental health and trauma and child protection. The program includes a number of courses aimed at the development of research skills, including research design and methodology, and every student completes a piece of independent or directed research or a professional practice portfolio as part of the Honours requirement.\nThe UNSW BSW (Hons) draws on the extensive expertise and experience of qualified Social Work practitioners to deliver a unique combination of scholarly and practice-based courses. Students also undertake two separate field placements in Years 3 and 4 of the degree to gain the necessary practical experience.\nLevel 4 of the program requires a research-based thesis or enquiry-based professional portfolio, undertaken through a capstone that integrates scholarship with professional work contexts.Â The Honours Thesis SOCW4015 has a WAM cut-off of 70 for entry. The Advanced Practice Honours Portfolio (SOCW4016) does not have a WAM cut-off.Â Upon successful completion of all program requirements, all students will graduate with Honours (AQF Level 8).Â",
        "URL": "/Undergraduate/programs/2020/4033",
        "name": "Social Work (Honours)",
        "awards": "Bachelor of Social Work (Honours) - BSW (Hons)",
        "faculty": "arts and social sciences",
        "faculty_code": "d7a56ceb4f0093004aa6eb4f0310c7ac",
        "code": "4033",
        "location": "Kensington"
    },
    {
        "entry_requirements": "None",
        "uac_code": "None",
        "study_level": "Undergraduate",
        "credit_points": "192",
        "description": "This program is only available combined with the Bachelor of Engineering (Honours) program 3707.\nThe Bachelor of Surveying is designed to equip you for a career as a professional surveyor. We provide you with a solid background that will prepare you for learning knowledge and skills in this disciplines. You will get the chance to apply yourself to surveying knowledge, application and professional practice. This new program will cater for students wishing to gain accreditation as Surveyors as part of an integrated five-year program in dual award mode with the Bachelor of Engineering (Hons) 3707. The School of Civil and Environmental Engineering administers the program.\nThe pass-level program is design to allow students to gain accreditation as both Engineers and Surveyors when taken as a dual award program with the Bachelor of Engineering (Honours) program 3707.",
        "URL": "/Undergraduate/programs/2020/3775",
        "name": "Surveying",
        "awards": "Bachelor of Surveying - BSurv",
        "faculty": "engineering",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7af",
        "code": "3775",
        "location": "Kensington"
    },
    {
        "entry_requirements": "None",
        "uac_code": "None",
        "study_level": "Undergraduate",
        "credit_points": "144",
        "description": "The Chief of Defence Force Students Program in Engineering offers the opportunity for students entering UNSW Canberra with a high Entrance Rank, and who maintain a high level of performance in their studies, to undertake research in a range of disciplines that will develop their critical thinking and independent research skills beyond that available in the standard Engineering program.\nIn Year 1 of the program, students will be engaged with cohort activities so as to develop and maintain their interest and continuing involvement in the program via invited lectures, seminars, general reading and social events. Commencing in Year 2, the research projects, each offered as separate courses, will be supervised by academic staff from the same or closely related discipline. Students in the research courses may work independently or as part of a team, depending on the nature of the project undertaken, though all students will submit individual assessment. Final assessment, due by the end of session, will be based on a written paper and an oral presentation.\nThe Program is of three years duration, and is awarded as a pass degree. There is provision for students who have completed the BTech to upgrade it to a BE degree in Aeronautical Engineering by undertaking at least 18 months further study at a later stage.\nThe BTech (Aero) (CDF) program is very similar to the first three years of the BE(Aero) (CDF) program. The BTech (Aero) (CDF) is primarily designed for RAAF Officer Cadets who intend to become aircrew and wish to enhance their understanding of the operation and performance of aircraft. The program extends the educational principles embodied in the BTech to a higher level of the degree. In the program, students will be exposed in first year to research methods in Engineering and will be offered significant extensions to the ideas and analysis performed in the standard degree program. This will allow them to undertake research projects, at the appropriate level, in their later years, thereby, more fully integrating research into the standard undergraduate degree. The individual projects undertaken in close association with academic staff on research topics of mutual interest underpin the program and give the students the ability to develop their full potential.",
        "URL": "/Undergraduate/programs/2020/4468",
        "name": "Tech Aero Engineering (CDF)",
        "awards": "Bachelor of Technology (Aeronautical Engineering) - BTech(AeroEng)",
        "faculty": "unsw canberra at adfa",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7ad",
        "code": "4468",
        "location": "Canberra"
    },
    {
        "entry_requirements": "None",
        "uac_code": "450080",
        "study_level": "Undergraduate",
        "credit_points": "144",
        "description": "Engineering technology degrees within UNSW Canberra provide outstanding technology education to the future leaders of the Australian Defence Force and encourage excellence through contributions to the engineering profession, industry and community.\n\nStudents holding a Bachelor of Technology in the Aeronautical Engineering program may, under normal circumstances, articulate to the Bachelor of Engineering in the Aeronautical Engineering program with 12 months of additional study.\n\nThis three year technology program at UNSW Canberra is accredited by Engineers Australia at the Engineering Technologist level.\nThe BTech (Aero) program is organised into streams developed for basic science/engineering principles and moving into specialised applications over three years. These streams include: foundation science engineering technology, materials and structures, dynamics and control, thermofluids, design and management as well as discipline specific streams such as aircraft systems and engines.\n\nExcept for Electrical Engineering and those in the Chief of Defence Force Students Program first year technology and engineering students enrol in a common program taking foundation science and engineering courses. In second and third year the programs diverge into their specialities although there are some courses that span across programs in all years. A key element in all years is the design stream which emphasises complex problem solving. Other streams such as aerodynamics, stability, control. thermofluids, structures, mechanics, materials and management often incorporate project based learning informed by academic research and industrial practice. Electives and a final semester project enable students to pursue particular interests both within and outside the specialist discipline.\n\nAt the end of the program students are expected to meet the graduate attributes of the University and Stage 1 Competencies of Engineers Australia, ready to practice in their chosen profession and with the ingenuity and resourcefulness to meet rapid technological change.\n\nThe BTech (Aero) is primarily designed for officer cadets and midshipmen of the Australian Defence Force who intend to become aircrew and wish to enhance their understanding of the operation and performance of aircraft. It is differentiated from the BTech (Aviation) program by providing a broader engineering technology foundation.",
        "URL": "/Undergraduate/programs/2020/4430",
        "name": "Technology (Aeronautical Eng)",
        "awards": "Bachelor of Technology - BTech",
        "faculty": "unsw canberra at adfa",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7ad",
        "code": "4430",
        "location": "Canberra"
    },
    {
        "entry_requirements": "None",
        "uac_code": "450090",
        "study_level": "Undergraduate",
        "credit_points": "144",
        "description": "Engineering Technology degrees within UNSW Canberra provide outstanding technology education to the future leaders of the Australian Defence Force and encourage excellence through contributions to the engineering profession, industry and community.\nThe BTech (Av) program is based on core engineering subjects, however specialist components of the BTech (Av) program focus on the interface between technology, individuals and organisations in the aviation industry. The aim is to provide the student with a deep understanding of the various technological and human systems that contribute to the safe and efficient operation of aircraft.\nA key element in this program is the focus on the role of people as key components in a technologically advanced and complex aviation system. There is particular emphasis on the role of human operators (e.g. pilots, air combat officers and air traffic controllers) in aviation infrastructure and safety management systems. Other courses such as aerodynamics and aircraft systems often incorporate problem-based learning informed by academic research and industrial practice. Electives and a final semester project enable students to pursue particular interests both within and outside the specialist discipline.\nThe BTech (Av) program is designed for potential pilots, navigators and air traffic controllers entering the Australian Defence Force. It is differentiated from the BTech (Aero) program in that there is greater focus on the role of humans in the operation of complex aerospace systems. This program does not provide a short articulation pathway to Bachelor of Engineering.",
        "URL": "/Undergraduate/programs/2020/4437",
        "name": "Technology (Aviation)",
        "awards": "Bachelor of Technology - BTech",
        "faculty": "unsw canberra at adfa",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7ad",
        "code": "4437",
        "location": "Canberra"
    },
    {
        "entry_requirements": "None",
        "uac_code": "430100",
        "study_level": "Undergraduate",
        "credit_points": "36",
        "description": "The UNSW Preparation Program (UNSWPrep 17-19) is an alternative entry pathway to undergraduate study at UNSW for educationally disadvantaged school leavers aged 17-19. It provides an opportunity for students with potential and an interest in tertiary education who have experienced educational disadvantage and who do not meet the entry requirements of their preferred Bachelor program at UNSW, and who meet the admission criteria listed below.\nThere are four specialisations in this program that enable entry to the following faculties upon successful completion of the program:\nArts and Social SciencesEngineeringScienceThe Australian School of Business\nThe preparation program is for entry to the UNSW programs listed above only.\nUNSW Prep 17-19 has been designed to assess students' academic potential and to provide a realistic and supportive environment within which the skills to manage university study can be developed effectively. Students enrol in a combination of academic skills courses, mathematical skills courses and relevant discipline-based courses depending upon their choice of specialisation.",
        "URL": "/Undergraduate/programs/2020/6115",
        "name": "UNSW Preparation Program 17-19",
        "awards": "Non-Award - Not Applicable - NAWD - N/A",
        "faculty": "dvcacademicboardofstudies",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7b3",
        "code": "6115",
        "location": "Kensington"
    },
    {
        "entry_requirements": "None",
        "uac_code": "430200",
        "study_level": "Undergraduate",
        "credit_points": "36",
        "description": "The University Preparation Program (UPP) is an enabling program for adults aged 21 and over who either do not possess formal qualifications or whose academic qualifications do not satisfy the minimum entry requirements for admission to university study. The program has been designed to assess students' academic potential and to provide a realistic environment within which the skills to manage tertiary study can be developed effectively.\nSatisfactory completion of the UPP does not guarantee admission to any specific program, but can be used as evidence of recent study when applying for admission to the University. A student's total educational background, and not just their UPP results will be taken into consideration for admission purposes.\nApplications for UPP places, which number approximately 250 each year, open in early December.",
        "URL": "/Undergraduate/programs/2020/6114",
        "name": "University Preparation Program",
        "awards": "Non-Award - Not Applicable - NAWD - N/A",
        "faculty": "dvcacademicboardofstudies",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7b3",
        "code": "6114",
        "location": "Kensington"
    },
    {
        "entry_requirements": "None",
        "uac_code": "429740",
        "study_level": "Undergraduate",
        "credit_points": "144",
        "description": "Vision Science is the study of the sensory processes that underlie vision, and the development and use of vision-related technologies. This is broad discipline degree that provides comprehensive knowledge and direct training in areas relevant to a career in Vision Science such as: Optics, anatomy and functioning of the eye, eye disorders, clinical optometry, ocular therapy, sensation and perception, psychophysics, and research design, methods and experimentation.\n\nThis degree is designed to develop scientists who can work with ophthalmic industries in the development of new technologies, diagnostic instruments, and patient care options, as well as develop persons who can liaise with ophthalmic practitioners dealing with the patient directly.\n\nStudents who complete this degree may be elligible to transfer to the Master of Clinical Optometry degree, see Additional Information below.",
        "URL": "/Undergraduate/programs/2020/3181",
        "name": "Vision Science",
        "awards": "Bachelor of Vision Science - BVisSc",
        "faculty": "science",
        "faculty_code": "57a56ceb4f0093004aa6eb4f0310c7ae",
        "code": "3181",
        "location": "Kensington"
    },
    {
        "entry_requirements": "None",
        "uac_code": "429750",
        "study_level": "Undergraduate",
        "credit_points": "240",
        "description": "Optometry combines the theoretical discipline of vision science with the clinical art of primary eye care. Vision science includes the optics of lenses and instruments, the physiology of the eye, the psychophysics of vision and the neuroscience of the brain.\nOptometry includes the diagnosis and management of ocular disease, the dispensing of spectacles and contact lenses, the management of people with special needs (children, low vision), sports vision and vision in the workplace. Graduates of this program will be able to register as an optometrist in Australia. The degree is also recognised in New Zealand and in most parts of Asia. Job opportunities in this field are excellent and are expected to remain excellent given the high visual demands in the modern computer-based workplace, and the ageing population in Australia.\nUpon completion of the Master of Clinical Optometry degree, students will be allowed to apply for registration with the Optometry Board leading to the practice of Optometry in Australia, New Zealand and most parts of Asia.\nGraduates of the dual award Bachelor of Vision Science/Master of Clinical Optometry will have specialised knowledge and skills for professional practice and research in Optometry and Vision Science and further learning.",
        "URL": "/Undergraduate/programs/2020/3182",
        "name": "Vision Science / Clinical Optometry",
        "awards": "Bachelor of Vision Science - BVisScMaster of Clinical Optometry - MClinOptom",
        "faculty": "science",
        "faculty_code": "57a56ceb4f0093004aa6eb4f0310c7ae",
        "code": "3182",
        "location": "Kensington"
    }
]