[
    {
        "study_level": "Undergraduate",
        "credit_points": "48",
        "code": "ACCTA1",
        "description": "Accounting is concerned with the provision of information for the management of economic resources and activities by means of measurement, communication and interpretation of financial data; with the development of information systems; and with the financial accountability and governance of enterprises. By economic resources, we mean both tangible and intangible resources. Accounting information is increasingly used to manage intangible resources such as an organisations knowledge base, its supplier/customer relationships, its brands etc. \n\nAccounting concepts lie at the heart of economic exchange, whether conducted in physical or electronic markets. It enables students to comprehend many of the fundamental principles, processes and outcomes of business, thereby equipping students for a wide range of careers (from chartered accounting, management consulting, provision of financial services to general management). Students of Accounting end up not just as accountants but as entrepreneurs, entertainment promoters, treasurers, chief financial officers, etc.",
        "level": "Major",
        "url": "/Undergraduate/specialisations/2020/ACCTA1",
        "name": "Accounting",
        "faculty": "unsw business school",
        "faculty_code": "5a3a1d4f4f4d97404aa6eb4f0310c77a",
        "programs": [
            3502,
            3543,
            3554,
            3558,
            3586,
            3587
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "48",
        "code": "ACTLE1",
        "description": "The Actuarial Risk Management and Analytics major focuses on the actuarial analysis and management of a broad spectrum of risks that financial organisations are confronted with in the context of the fast changing, increasingly global financial environment. The major helps students develop a broad perspective on risks, including modelling, data analysis, and management. It is designed for actuarial students interested in further extending their knowledge of actuarial analysis and management of risks, and aims to extend students' knowledge on the use of risk analysis and decision tools and their applications in practice.",
        "level": "Major",
        "url": "/Undergraduate/specialisations/2020/ACTLE1",
        "name": "Actuarial Risk Management and Analytics",
        "faculty": "unsw business school",
        "faculty_code": "5a3a1d4f4f4d97404aa6eb4f0310c77a",
        "programs": [
            3586,
            3587
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "48",
        "code": "ACTLAH",
        "description": "At UNSW, Honours in Actuarial Studies provides an introductory but rigorous training in the research process. Research training provides the opportunity to be recognised as a leader in a specialised area of theory and/or practice of relevance to the actuarial profession. It promotes the development of analytical skills and provides high level training in research methods. It encourages the development of a rigorous and scientific approach to problem solving.\nIn 2013, completion of Honours in Actuarial Studies is offered as part of the Bachelor of Commerce (Honours). The program is open to both local and international students, subject to the admission requirements that are outlined below.\nEntry into the Actuarial Studies Honours program is competitive and is subject to availability of academic staff for supervision.",
        "level": "Honours",
        "url": "/Undergraduate/specialisations/2020/ACTLAH",
        "name": "Actuarial Studies",
        "faculty": "unsw business school",
        "faculty_code": "5a3a1d4f4f4d97404aa6eb4f0310c77a",
        "programs": []
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "168",
        "code": "AEROAH",
        "description": "The Aerospace Engineering stream covers the analysis, design and operation of aircraft and spacecraft. Graduates work mainly on the design and manufacture of flight vehicles, their operation with major or satellite airlines and research for civil and military aerospace organisations. Owing to the international nature of aerospace industry, the topics studied cover a similar area and, in general, to the same depth of understanding as professional training programs in aerospace in other industrial countries. The aerospace industry is one of Australia's major exporters of high value added manufactured goods.",
        "level": "Honours",
        "url": "/Undergraduate/specialisations/2020/AEROAH",
        "name": "Aerospace Engineering",
        "faculty": "engineering",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7af",
        "programs": [
            3707
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "48",
        "code": "SOMSEH",
        "description": "The Anatomy Honours stream introduces undergraduate students to medical research. Students undertake a supervised research project that places emphasis on scientific research methods, the use of relevant specialised techniques, critical thinking and scientific communication via written submissions and oral presentations. The research project may be undertaken in a wide range of laboratories within the School of Medical Sciences (SoMS), affiliated Hospitals and Research Institutes/Centres or other Schools within the Faculty of Medicine.",
        "level": "Honours",
        "url": "/Undergraduate/specialisations/2020/SOMSEH",
        "name": "Anatomy",
        "faculty": "medicine",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7b0",
        "programs": [
            3962,
            4500
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "24",
        "code": "ARTHB2",
        "description": "The minor in Art History and Theory allows students from a wide variety of study areas to engage with the histories and theories of contemporary art. The minor introduces students to the foundations of art history and theory, and provides opportunities to delve deeper into art's relationship with an array of social and cultural contexts. Students interested in developing their understandings of contemporary art and culture will find real value in the minor in Art History and Theory.",
        "level": "Minor",
        "url": "/Undergraduate/specialisations/2020/ARTHB2",
        "name": "Art History and Theory",
        "faculty": "art design",
        "faculty_code": "57a56ceb4f0093004aa6eb4f0310c7af",
        "programs": [
            3409,
            3429,
            3434,
            3438,
            3444,
            3453,
            3454
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "60",
        "code": "DARTA1",
        "description": "The Art Theory major allows students to investigate the histories and theories of contemporary art. Situated in the Bachelor of Fine Arts program in the Faculty of Art & Design, this major is comprised of courses that examine art and its intersections with a range of historical, cultural, social, and theoretical contexts. With scholarly, research, and professional skills woven throughout, the major also prepares students to engage with future pathways across a range of arts and cultural contexts.",
        "level": "Major",
        "url": "/Undergraduate/specialisations/2020/DARTA1",
        "name": "Art Theory",
        "faculty": "art design",
        "faculty_code": "57a56ceb4f0093004aa6eb4f0310c7af",
        "programs": [
            4821
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "48",
        "code": "HUMSA1",
        "description": "This plan offers a course of study designed to provide Indigenous students with a pathway into academic study in Arts and Social Sciences.",
        "level": "Major",
        "url": "/Undergraduate/specialisations/2020/HUMSA1",
        "name": "Arts & Soc Sc (Indigenous)",
        "faculty": "dvcacademicboardofstudies",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7b3",
        "programs": [
            7016
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "24",
        "code": "ARTSB2",
        "description": "THIS STREAM IS FOR STUDENTS COMMENCING FROM 2016.\n\nThis minor stream allows you to develop a 24 UOC sequence of study to meet your individual professional, disciplinary or interdisciplinary development. You must put forward a case for doing a UNSW Arts and Social Sciences minor stream that will enhance your BA program. The content of the minor stream must be approved by the BA Convenor and must provide a coherent program of study. Courses are drawn from the home majors/minors in the BA Program. For example, a student doing Film Studies may want to focus on ethics in Australian film so may select courses from Australian Studies and Philosophy.",
        "level": "Minor",
        "url": "/Undergraduate/specialisations/2020/ARTSB2",
        "name": "Arts and Social Sciences",
        "faculty": "arts and social sciences",
        "faculty_code": "d7a56ceb4f0093004aa6eb4f0310c7ac",
        "programs": [
            3409,
            3429,
            3434,
            3438,
            3444,
            3454
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "48",
        "code": "ZEITS1",
        "description": "The Aviation major provides the student with a deep understanding of the various technological and human systems that contribute to the safe and efficient operation of aircraft and the aviation environment. A key element in this major is the focus on the role of people as key components in a technologically advanced and complex aviation environment. There is a particular emphasis on the role of human operators (e.g. pilots, air combat officers and air traffic controllers) in aviation in infrastructure and safety management systems.\n\nThe Aviation major is designed for potential pilots, air combat officers and air traffic controllers entering the Australian Defence Force.",
        "level": "Major",
        "url": "/Undergraduate/specialisations/2020/ZEITS1",
        "name": "Aviation",
        "faculty": "unsw canberra at adfa",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7ad",
        "programs": [
            4410,
            4463
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "48",
        "code": "ZEITSH",
        "description": "The Aviation Honours stream introduces undergraduate students to aviation research. Students undertake a supervised research project that places emphasis on scientific research methods, the use of relevant specialised techniques, critical thinking and scientific communication via written submissions and oral presentations. The learning and teaching philosophy underpinning this course is centred on Honours students taking on their 'role as a researcher' to develop these skills and the relevant advanced disciplinary knowledge. \n\nStudent research projects relate to multiple fields of aviation and closely related research interests of staff.\n\nThe Aviation Honours stream involves undertaking a research project that, although conducted under supervision, contains substantial independent research and self-direction. The research project is described in a thesis that forms a major part of the assessment. The research project is complemented by introductory written and oral background presentations and oral presentation of the research project. There are also relevant advanced level courses that students must undertake.",
        "level": "Honours",
        "url": "/Undergraduate/specialisations/2020/ZEITSH",
        "name": "Aviation",
        "faculty": "unsw canberra at adfa",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7ad",
        "programs": [
            4513
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "48",
        "code": "BABSBH",
        "description": "The Honours program in Bioinformatics aims to help students achieve, through research, a deeper and skilled understanding of specific aspects of bioinformatics while developing their critical thinking, writing and presentation skills. Students undertake a supervised research project in an area of research significance as approved by the Head of School. The BABS BSc (Hons) Degree provides an opportunity for students to experience hands-on scientific research. Honours students become part of a research team within one of the research labs in the School, and complete a supervised research project and thesis during the year-long program. A key benefit of the Honours year is that it provides for a different type of learning experience. It proceeds at the pace of the individual student, with suitable supervisory oversight providing relevant training in an informal, relaxed atmosphere. Honours is also an opportunity for the student to undertake measured and reflective decision making about their future scientific career. Examples of recent projects and further information regarding Honours in Bioinformatics can be found at http://www.babs.unsw.edu.au/future_students/future-honours-students/honours-mphil-projects.\nHonours in Bioinformatics is to be completed full-time. Students commence their enrolment in Term 1 (T1) or Term 2 (T2) or Term 3 (T3). Students should check with undergraduate school administrator and honours coordinator for current enrolment deadlines and completion dates.\nStudents must enrol in BABS4516 School of Biotechnology and Biomolecular Sciences Honours  (16 UOC) for three terms.\nThe program involves a research project that forms the majority of the assessment. The project, although supervised, is to be completed with substantial independence and self-direction. In addition, the program involves a series of student consultations, tutorials and seminars. Students should seek to meet with other School researchers and academics to stimulate research ideas and aid the research process. Honours Students must attend a series of compulsory workshops on ethics, research design, data analysis, thesis writing, presentation skills and publishing (see Assessment below).",
        "level": "Honours",
        "url": "/Undergraduate/specialisations/2020/BABSBH",
        "name": "Bioinformatics",
        "faculty": "science",
        "faculty_code": "57a56ceb4f0093004aa6eb4f0310c7ae",
        "programs": [
            3962,
            4500
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "168",
        "code": "BINFAH",
        "description": "Bioinformatics Engineering is studied as a major stream in the BE (Hons). \nThis page outlines the core rules for the Bioinformatics Engineering stream when taken as part of a single or dual award. The requirements total 168 units of credit, plus 60 days of industrial training. Refer to the program page for full details on the overall program requirements.\nFurther details on the stream requirements, electives, and advice regarding the order and placement of courses in the stream can be found at: Bioinformatics",
        "level": "Honours",
        "url": "/Undergraduate/specialisations/2020/BINFAH",
        "name": "Bioinformatics Engineering",
        "faculty": "engineering",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7af",
        "programs": [
            3707,
            3768
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "48",
        "code": "BIOSKH",
        "description": "The School of Biological, Earth and Environmental Sciences (BEES) offers a number of Honours streams including in Biology. Honours in Biology introduces undergraduate students to research and project work of relevance to various endeavours in the biological sciences. Students undertake a supervised research project that places emphasis on scientific research methods, the use of relevant specialised techniques, critical thinking and scientific communication via written submissions and oral presentations. The learning and teaching philosophy underpinning this Program is centred on Honours students taking on their role as a researcher to develop these skills and the relevant advanced disciplinary knowledge with some degree of independence. The Program, run over three sessions, includes a a Research Proposal (which may include an extended literature review and a risk management component) and a substantial and independent Research Project conducted under the close supervision of academic(s) within The School of BEES. These components are complemented by more formal seminars and workshops, focusing on graduate attributes (scientific communication, risk management, ethics and professional development) as well as School (and Institute/Centre) seminars.",
        "level": "Honours",
        "url": "/Undergraduate/specialisations/2020/BIOSKH",
        "name": "Biology",
        "faculty": "science",
        "faculty_code": "57a56ceb4f0093004aa6eb4f0310c7ae",
        "programs": [
            3962,
            4500
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "42",
        "code": "BIOSD2",
        "description": "Biology is the study of life and living organisms.",
        "level": "Minor",
        "url": "/Undergraduate/specialisations/2020/BIOSD2",
        "name": "Biology",
        "faculty": "science",
        "faculty_code": "57a56ceb4f0093004aa6eb4f0310c7ae",
        "programs": [
            3962,
            3970
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "78",
        "code": "BIOSJ1",
        "description": "Biology is the study of life and living organisms.The School of Biological, Earth and Environmental Sciences offers expertise in the fields of botany, ecology, marine biology and zoology. Botany explores aspects of both green and non-green plants and their relation to the environment. An understanding of ecology is necessary for conservation. Marine biology is about life in the ocean, estuaries and other coastal environments. Zoology looks at the structure, behaviour, habits, genetics, distribution, evolution and classification of animals.",
        "level": "Major",
        "url": "/Undergraduate/specialisations/2020/BIOSJ1",
        "name": "Biology",
        "faculty": "science",
        "faculty_code": "57a56ceb4f0093004aa6eb4f0310c7ae",
        "programs": [
            3925,
            3962,
            3965,
            3966,
            3970,
            3987
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "84",
        "code": "BIOTB1",
        "description": "Biotechnology can be defined as the use of various biological processes to make products and perform services. The essential feature of biotechnology therefore is the use of biological processes based on living cells and biochemical macro-molecules such as proteins, DNA and RNA in a rapidly-expanding range of activities of benefit to mankind.",
        "level": "Major",
        "url": "/Undergraduate/specialisations/2020/BIOTB1",
        "name": "Biotechnology",
        "faculty": "science",
        "faculty_code": "57a56ceb4f0093004aa6eb4f0310c7ae",
        "programs": [
            3962
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "84",
        "code": "BIOTA1",
        "description": "Biotechnology can be defined as the use of various biological processes to make products and perform services. The essential feature of biotechnology therefore is the use of biological processes based on living cells and biochemical macro-molecules such as proteins, DNA and RNA in a rapidly-expanding range of activities of benefit to mankind.",
        "level": "Major",
        "url": "/Undergraduate/specialisations/2020/BIOTA1",
        "name": "Biotechnology",
        "faculty": "science",
        "faculty_code": "57a56ceb4f0093004aa6eb4f0310c7ae",
        "programs": [
            3925,
            3966,
            3970,
            3987
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "48",
        "code": "ZBUSA1",
        "description": "Business is about managing human, financial, physical and information resources to achieve the best outcomes for an organisation in its business environment. Effective business decision making requires both an internal focus on people, operations and finances, and a strategic focus on developments in the economic and social environment - markets, ethics, the law and government policy.",
        "level": "Major",
        "url": "/Undergraduate/specialisations/2020/ZBUSA1",
        "name": "Business",
        "faculty": "unsw canberra at adfa",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7ad",
        "programs": [
            4400,
            4461
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "24",
        "code": "REGZH1",
        "description": "REGZH16114 is the 24 UoC Business stream within 6114 University Preparation Program (UPP).\n\nThe UPP Business stream is designed to provide access to study in areas of Business at university level upon successful completion of the program. \n\nUPP Business students may apply to transfer to the UPP Humanities stream at the end of Semester 1 if they have successfully completed REGZ9000.",
        "level": "Major",
        "url": "/Undergraduate/specialisations/2020/REGZH1",
        "name": "Business (UPP)",
        "faculty": "dvcacademicboardofstudies",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7b3",
        "programs": [
            6114
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "30",
        "code": "COMMJ2",
        "description": "Business Analytics equips students with the technical and non-technical skills required to produce and communicate actionable findings and insights from an organisation’s data. Students will be introduced to descriptive, predictive and prescriptive analytics for business problems, evaluating policies, and understanding the interplay between financial and non-financial data. In addition to statistical modelling, programming and database management skills, students will be introduced to the ethical and legal issues of data governance. Business Analytics equips graduated with a holistic framework to span the bridge between business-problem owners and technical experts, and to communicate the output of analysis to improve business decision making.",
        "level": "Minor",
        "url": "/Undergraduate/specialisations/2020/COMMJ2",
        "name": "Business Analytics",
        "faculty": "unsw business school",
        "faculty_code": "5a3a1d4f4f4d97404aa6eb4f0310c77a",
        "programs": [
            3502,
            3543,
            3554,
            3558
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "48",
        "code": "COMMJ1",
        "description": "Business Analytics equips students with the technical and non-technical skills required to produce and communicate actionable findings and insights from an organisation’s data. Students will be introduced to descriptive, predictive and prescriptive analytics for business problems, evaluating policies, and understanding the interplay between financial and non-financial data. In addition to statistical modelling, programming and database management skills, students will be introduced to the ethical and legal issues of using data. Business Analytics equips graduates with a holistic framework to span the bridge between business-problem owners and technical experts, and to communicate the output of analysis to improve business decision making.",
        "level": "Major",
        "url": "/Undergraduate/specialisations/2020/COMMJ1",
        "name": "Business Analytics",
        "faculty": "unsw business school",
        "faculty_code": "5a3a1d4f4f4d97404aa6eb4f0310c77a",
        "programs": [
            3502,
            3543,
            3554,
            3558
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "66",
        "code": "ECONL1",
        "description": "Business Data Sciences is the study of methods for organising, modelling and analysing large and complex data relevant for businesses, governments or other organisations. The information gleaned from the data analysis is intended to improve business decisions and inform policies.\n\nThe program provides a strong technical background in mathematics, statistics, computer science and economics. The Business Data Science major enables a student to specialise further in econometrics and business applications and to choose from electives across economics and business disciplines as well as specialised courses in mathematics, statistics and computer science.\n\nThe program and this major open a pathway to exciting careers in data science with applications to economics and business. Any organisation interested in insights from data about consumer choices, online searches and numerous other monitored or surveyed activities requires a team to model and analyse this data and to inform evidence-based decisions and policies.",
        "level": "Major",
        "url": "/Undergraduate/specialisations/2020/ECONL1",
        "name": "Business Data Science",
        "faculty": "unsw business school",
        "faculty_code": "5a3a1d4f4f4d97404aa6eb4f0310c77a",
        "programs": [
            3959
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "48",
        "code": "ECONF1",
        "description": "A major in Business Economics consists of 48 UOC (8 courses). Two (2) of these courses are specified; the other six (6) are elective courses that are chosen from the lists below. This is regardless of whether you are doing a single major or taking Business Economics as a second majorA minor consists of 30 UOC (5 courses) containing ECON 1102, ECON 1202 and 18 UOC at level 2 or 3. The minor does not form part of the nominated major.",
        "level": "Major",
        "url": "/Undergraduate/specialisations/2020/ECONF1",
        "name": "Business Economics",
        "faculty": "unsw business school",
        "faculty_code": "5a3a1d4f4f4d97404aa6eb4f0310c77a",
        "programs": [
            3502,
            3554,
            3558,
            3586,
            3587
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "30",
        "code": "ECONF2",
        "description": "None",
        "level": "Minor",
        "url": "/Undergraduate/specialisations/2020/ECONF2",
        "name": "Business Economics",
        "faculty": "unsw business school",
        "faculty_code": "5a3a1d4f4f4d97404aa6eb4f0310c77a",
        "programs": [
            3502,
            3554,
            3558,
            3586,
            3587
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "48",
        "code": "ECONFH",
        "description": "The Honours year provides students with an opportunity to deepen their knowledge of business economics and to develop the necessary skills to tackle the business economics issues and challenges that they will encounter throughout their careers. Students learn and put into practice the skills needed to conduct an independent and original research project and to communicate and defend the results of their research. Graduates with an Honours degree from the School of Economics at UNSW have moved on to successful careers in both the public and private sectors and academia.\n\nThe Commerce Honours program is designed for students with the equivalent of a BCom degree with a major in Business Economics, Financial Economics or Business Strategy and Economic Management. There are prerequisite courses for the Business Economics specialisation that may be in addition to your specific major requirements and that must be completed prior to your Honours year.\n\nTo satisfy the Honours requirements, students complete an additional year of study, including Honours level courses (both compulsory and elective) and a research thesis in business economics. Full-time and part-time (during 3 semesters) study is available in this program. Mid-year entry to the BEc(Hons) is possible, but is typically recommended only for part-time study.",
        "level": "Honours",
        "url": "/Undergraduate/specialisations/2020/ECONFH",
        "name": "Business Economics",
        "faculty": "unsw business school",
        "faculty_code": "5a3a1d4f4f4d97404aa6eb4f0310c77a",
        "programs": [
            4501
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "48",
        "code": "TABLA1",
        "description": "The Business Law major is designed for students who are interested in commercial law in a business context rather than entering legal practice. It provides students with an understanding of organisations' legal obligations in today's complex business world.",
        "level": "Major",
        "url": "/Undergraduate/specialisations/2020/TABLA1",
        "name": "Business Law",
        "faculty": "unsw business school",
        "faculty_code": "5a3a1d4f4f4d97404aa6eb4f0310c77a",
        "programs": [
            3502,
            3543,
            3554,
            3558,
            3586,
            3587
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "48",
        "code": "TABLLH",
        "description": "The Honours year will provide students with an opportunity to learn the necessary skills to tackle Business Law issues and challenges that they will encounter throughout their careers. These include analytical skills in problem solving (identification of problems, mapping out solutions and executing them) and Business Law (both practical and academic) research skills.\nTo satisfy the Honours requirements, students undertake an additional year of study, completing Honours level courses (both compulsory and elective) and undertaking a research thesis. Students must have completed the prerequisite courses prior to their Honours year.\nThis stream is only offered on a full-time basis each year.",
        "level": "Honours",
        "url": "/Undergraduate/specialisations/2020/TABLLH",
        "name": "Business Law",
        "faculty": "unsw business school",
        "faculty_code": "5a3a1d4f4f4d97404aa6eb4f0310c77a",
        "programs": [
            4501
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "30",
        "code": "TABLA2",
        "description": "A minor in Business Law consists of 30 UOC (5 courses) containing at least 18 UOC at Level 2 or 3. The minor does not form part of the nominated major.\n\nPlease refer to the Specialisation Structure to see the list of courses under this stream.",
        "level": "Minor",
        "url": "/Undergraduate/specialisations/2020/TABLA2",
        "name": "Business Law",
        "faculty": "unsw business school",
        "faculty_code": "5a3a1d4f4f4d97404aa6eb4f0310c77a",
        "programs": [
            3502,
            3543,
            3554,
            3558,
            3586
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "48",
        "code": "ECONI1",
        "description": "A successful manager seeks to anticipate the strategic behaviour of competitors. A manager must also be able to deal with people's different motives and with major uncertainties in the decision-making process. Dealing with these issues is the essence of business strategy and economic management. Study in this area provides students with the tools to understand the fundamental economic behaviour that underlies all business decisions. Hence, it allows future managers to make informed decisions throughout their careers.\n\nStrategic decision-making is not only useful for relations with competitors, but for relations with suppliers, customers, business partners, and for the range of relations inside the firm. Employees, managers, shareholders and the board of directors all have different goals, and they behave strategically, not unlike competitors. They also have 'incomplete information'? about each other: Because employees and managers have complex skills and assignments, others cannot perfectly assess them through performance evaluations. And each employee understands certain aspects of the business and its customers better than others. Economics allows managers and owners to structure divisions, teams and salary packages for employees to gain the highest profits. The flexibility of strategic thinking tools from economics allows a manager to deal with any new situations that arise - be it new research projects, start-up businesses, or business alliances.",
        "level": "Major",
        "url": "/Undergraduate/specialisations/2020/ECONI1",
        "name": "Business Strategy & Econ Mngmt",
        "faculty": "unsw business school",
        "faculty_code": "5a3a1d4f4f4d97404aa6eb4f0310c77a",
        "programs": [
            3502,
            3554,
            3558
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "96",
        "code": "CEICM1",
        "description": "Please see the description for Program 3773. \n\nFurther information on the program study plan can be found on the Faculty of Engineering Website",
        "level": "Major",
        "url": "/Undergraduate/specialisations/2020/CEICM1",
        "name": "Chemical Engineering",
        "faculty": "engineering",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7af",
        "programs": [
            3706
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "168",
        "code": "CEICAH",
        "description": "Chemical Engineering involves researching, developing and improving properties of products we use every day through the selection of raw materials, the design of chemical processes, and improving the conditions for production. It's about taking projects from inception as a research proposal, through product development and on to commercialisation and manufacture. You'll learn how to apply your knowledge in chemical engineering and chemistry to optimise complex chemical processes in environmental management, general industry and services like water delivery. You'll master the entire process, extrapolating small scale, laboratory chemistry into large, industrial scale production. To get work ready, you'll apply these skills through 60 days of approved industry training.",
        "level": "Honours",
        "url": "/Undergraduate/specialisations/2020/CEICAH",
        "name": "Chemical Engineering",
        "faculty": "engineering",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7af",
        "programs": [
            3707,
            3768
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "168",
        "code": "CEICDH",
        "description": "Chemical Product Engineering involves researching, developing and improving the properties of the products that we use every day through the selection and design of the materials that are used. Product engineers work on the fluids that you use in your everyday life, including chemicals (cosmetics, pharmaceuticals, shampoos, paints, glues), foods, and drinks. As a product engineer, you will learn to take consumer needs and turn them into technical requirements, finding the right combinations of chemicals to deliver those properties and then developing the product and strategies for commercialisation and manufacture. You will learn how to apply your knowledge of engineering and chemistry to design complex chemical products for the pharmaceutical, consumer products and food industries. You'll master the entire development process, testing out ideas for products and extrapolating small scale, laboratory chemistry into large, industrial scale production. In the final year Product Design Project, you will work with industry partners to develop a new consumer product up to the point where it could be patented and commercialised. To get work ready, you'll apply these skills through 60 days of approved industry training.\n\nThe courses listed below have to be completed to finish the degree, but the order in which they are taken is important and you need to follow advice on this. Many courses are offered only once per year and others have pre-requisites or exclusions which govern the order in which they can be taken. Both of these things can have a big impact on enrolment planning if poor choices of course combinations are made. You are strongly encouraged to consult the School website and follow the recommended course sequence linked here.\n\nThe timing of the general education courses and elective courses may be modified to optimise your choice of courses. It is your responsibility to plan your enrolment appropriately. Assistance is available from the School of Chemical Engineering Student Office, should you require it.",
        "level": "Honours",
        "url": "/Undergraduate/specialisations/2020/CEICDH",
        "name": "Chemical Product Engineering",
        "faculty": "engineering",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7af",
        "programs": [
            3707
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "48",
        "code": "ZPEMAH",
        "description": "The Chemistry Honours stream introduces undergraduate students to chemical research. Students undertake a supervised research project that places emphasis on scientific research methods, the use of relevant specialised techniques, critical thinking and scientific communication via written submissions and oral presentations. The learning and teaching philosophy underpinning this course is centred on Honours students taking on their ‘role as a researcher’ to develop these skills and the relevant advanced disciplinary knowledge.\nStudent research projects relate to multiple fields of chemistry and closely related research interests of staff.\nThe Chemistry Honours stream involves undertaking a research project that, although conducted under supervision, contains substantial independent research and self-direction. The research project is described in a thesis that forms a major part of the assessment. The research project is complemented by introductory written and oral background presentations and oral presentation of the research project. There are also relevant advanced level courses that students must undertake.",
        "level": "Honours",
        "url": "/Undergraduate/specialisations/2020/ZPEMAH",
        "name": "Chemistry",
        "faculty": "unsw canberra at adfa",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7ad",
        "programs": [
            4513
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "48",
        "code": "CHEMFH",
        "description": "The Chemistry Honours stream introduces undergraduate students to the principles and practice of chemistry research. Students in Chemistry Honours undertake a supervised research project that places emphasis on scientific research methods, the use of relevant specialised techniques, critical thinking and scientific communication via written submissions and oral presentations.\n\nThe learning and teaching philosophy underpinning Chemistry Honours is centred on students taking on their 'role as a researcher' to develop these skills and the relevant advanced disciplinary knowledge, with some degree of independence.\n\nIn addition to the research project, Chemistry Honours includes formal coursework and requires attendance at School seminars, aimed at broadening a graduate's knowledge. Most students would complete Honours as full-time students, where the program is completed over two consecutive semesters. Part-time study is also possible depending on availability of supervision and suitable projects.\n\nStudent research projects are available across the full range of Chemistry disciplines, with a focus on our School’s major research themes of Catalysis and Energy, Nanoscience, and Medicinal Chemistry. Further information on the Honours program and the School’s research can be found on the Chemistry Honours page and the Chemistry Research Themes page.\n\nMost students commence their enrolment in a trimester (commonly T1 and T3). Students are expected to commence work on their project in Week 1 of their first trimester. Honours typically runs until mid-November (T1 commencement) or end of their final trimester. Students should check the Chemistry Honours webpages for current enrolment deadlines, and assessment and completion dates.\n\nThe Chemistry Honours stream involves undertaking a research project that, although conducted under supervision, contains substantial independent research and self-direction. The research project is described in a submitted Project Thesis that forms the largest component of the assessment. The Project Thesis is complemented by introductory written and oral background presentations, oral presentation of the research project, and an oral examination (viva voce). Students are also required to attend compulsory Workplace Health and Safety training, relevant inductions, as well as School seminars.\n\nThe Chemistry Honours stream also contains an advanced coursework component. Students elect to study a series of advanced topics covering a broad range of chemistry.",
        "level": "Honours",
        "url": "/Undergraduate/specialisations/2020/CHEMFH",
        "name": "Chemistry",
        "faculty": "science",
        "faculty_code": "57a56ceb4f0093004aa6eb4f0310c7ae",
        "programs": [
            3962,
            4500
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "168",
        "code": "CVENAH",
        "description": "Civil Engineering is responsible for projects that enhance the overall quality of life. Civil engineers design, construct, manage, operate and maintain the infrastructure that supports modern society including buildings, bridges, roads and highways, tunnels, airfields, dams, ports and harbours, railways, new mines, water supply and sewerage schemes, irrigation systems and flood mitigation works. The profession is very broad and affords opportunities for involvement in many specialist activities.\n\nIn the final year of the Civil Engineering program students may choose electives in structural engineering, geotechnical engineering, transport engineering, water engineering or engineering construction and management. This program can be taken on a four-year full-time basis, or on a part-time basis subject to the approval of the Head of School. Intending part-time students are advised that all courses are offered only in the daytime.\n\nA detailed program structure can be found on the School website, which includes suggested scheduling of courses by semester. While some courses are given twice a year, many courses are given only once a year. In addition, courses may have prerequisites and exclusions. Thus students should plan their enrolments appropriately.",
        "level": "Honours",
        "url": "/Undergraduate/specialisations/2020/CVENAH",
        "name": "Civil Engineering",
        "faculty": "engineering",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7af",
        "programs": [
            3707
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "96",
        "code": "CVENJ1",
        "description": "Please see the description for Program 3773 here \nFurther information on the program study plan can be found on the\nFaculty of Engineering Website.",
        "level": "Major",
        "url": "/Undergraduate/specialisations/2020/CVENJ1",
        "name": "Civil Engineering",
        "faculty": "engineering",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7af",
        "programs": [
            3706
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "84",
        "code": "CLIMC1",
        "description": "The Climate Dynamics stream is focused on the science of the Earth's climate with particular emphasis on understanding the dynamic processes within the atmosphere and oceans. This understanding has applications in climate and weather research, forecasting, environmental and resource management. Courses are designed to provide the skills to use and interpret models of fluid flows as well as the ability to undertake directed research in a related area.",
        "level": "Major",
        "url": "/Undergraduate/specialisations/2020/CLIMC1",
        "name": "Climate Dynamics",
        "faculty": "science",
        "faculty_code": "57a56ceb4f0093004aa6eb4f0310c7ae",
        "programs": [
            3962
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "42",
        "code": "CLIMA2",
        "description": "Climate Science is focused on a broad introduction to the science of the Earth's climate system.",
        "level": "Minor",
        "url": "/Undergraduate/specialisations/2020/CLIMA2",
        "name": "Climate Science",
        "faculty": "science",
        "faculty_code": "57a56ceb4f0093004aa6eb4f0310c7ae",
        "programs": [
            3962,
            3970
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "48",
        "code": "CLIMDH",
        "description": "The School of Biological, Earth and Environmental Sciences (BEES) offers a number of Honours streams including Climate Science. Honours in Climate Science introduces undergraduate students to research and project work of relevance to various endeavours in climate dynamics, global climate change, and extremes of weather and climate. Students undertake a supervised research project that places emphasis on scientific research methods, the use of relevant specialised techniques, critical thinking and scientific communication via written submissions and oral presentations. The learning and teaching philosophy underpinning this program is centred on Honours students taking on their ‘role as a researcher’ to develop these skills and the relevant advanced disciplinary knowledge with some degree of independence. The program, run over three sessions, includes a Research Proposal (which may include a literature review and a risk management component) and a substantial  independent Research Project under the close supervision of academics in the school of BEES. These components are complemented by more formal seminars and workshops, focusing on graduate attributes (scientific communication, risk management, ethics and professional development) as well as School (and Institute/Centre) seminars.",
        "level": "Honours",
        "url": "/Undergraduate/specialisations/2020/CLIMDH",
        "name": "Climate Science",
        "faculty": "science",
        "faculty_code": "57a56ceb4f0093004aa6eb4f0310c7ae",
        "programs": [
            3962,
            4500
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "84",
        "code": "CLIMB1",
        "description": "The Climate Systems Science stream is focused on a broad introduction to the science of the Earth's climate system. Students will gain an understanding of the fundamentals of atmospheric science, oceanography and chemistry and have the option of focusing their studies in areas such as climate and vegetation, hydrology, biology, biogeochemistry or environmental and resource management. Courses are designed to highlight the interrelated nature of climate system components and give students the ability to critically analyse problems in multi-disciplinary science context. Students will also develop an ability to undertake directed research.",
        "level": "Major",
        "url": "/Undergraduate/specialisations/2020/CLIMB1",
        "name": "Climate Systems Science",
        "faculty": "science",
        "faculty_code": "57a56ceb4f0093004aa6eb4f0310c7ae",
        "programs": [
            3962
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "66",
        "code": "COMPZ1",
        "description": "Computational Data Science is the study of methods for organising, modelling and analysing large and complex data relevant for businesses, governments or other organisations. The information gleaned from the data analysis is intended to improve business decisions and inform policies.\n\nThe Computational Data Science major enables a student to specialise further in computational data methods.",
        "level": "Major",
        "url": "/Undergraduate/specialisations/2020/COMPZ1",
        "name": "Computational Data Science",
        "faculty": "engineering",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7af",
        "programs": [
            3959
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "168",
        "code": "COMPBH",
        "description": "Computer Engineering encompasses the structured and integrated design of the hardware and software components of computerised systems. Not only do personal computer systems, such as desktops and laptops fall into this category, but so do embedded systems for gaming, cars and PDAs, supercomputers used in climate modelling and gene analysis, and prosthetic systems such as ocular implants intended to improve quality of life. The challenge for the engineer is to design these systems with maximal impact, and to trade off competing factors using engineering, scientific and mathematical principles. This stream teaches the principles and techniques necessary to engineer high quality systems.\nComputer Engineering is studied as a major stream in the BE(Hons). Day to day administration of this stream is conducted through the Computer Science and Engineering Student Office.\nThis page outlines the core rules for the Computer Engineering stream when taken as part of a single or dual award. The requirements total 168 units of credit, plus 60 days of industrial training. Refer to the program page for full details on the overall program requirements.\nFurther details on the stream requirements, electives, and advice regarding the order and placement of courses in the stream can be found at the: School website",
        "level": "Honours",
        "url": "/Undergraduate/specialisations/2020/COMPBH",
        "name": "Computer Engineering",
        "faculty": "engineering",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7af",
        "programs": [
            3707,
            3768
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "96",
        "code": "COMPA1",
        "description": "Computers are now ubiquitous, and critical to the functioning of all enterprises in modern industrial societies, from commerce to health and education. They now also play an important social role, opening new avenues for people to connect and to engage in public discourse. The demand for computing professionals capable of managing existing computing infrastructure or, more importantly, creating the next generation of computing applications, will continue to grow into the future.\n\nThis stream provides a solid grounding in the fundamentals of the computing discipline (programs, algorithms, design, systems, software engineering) and then allows students to choose from a wide range of electives in later years. The flexibility of the stream allows students to take a broad range of courses, or to focus on one particular area of computing.\n\nThis is the default plan for students in the 3778 BSc in Computer Science program or in dual degrees involving Computer Science.",
        "level": "Major",
        "url": "/Undergraduate/specialisations/2020/COMPA1",
        "name": "Computer Science",
        "faculty": "engineering",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7af",
        "programs": [
            3778
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "48",
        "code": "ZITEK1",
        "description": "Computer Science is one of three disciplines of study offered in the field of Information Technology. The study of Computer Science is intimately linked with the study of the modern digital computer, its design, operational characteristics and control. Teaching is concentrated principally in the areas of algorithm specification, data structures, programming languages, operating systems, computer networks and artificial intelligence.",
        "level": "Major",
        "url": "/Undergraduate/specialisations/2020/ZITEK1",
        "name": "Computer Science",
        "faculty": "unsw canberra at adfa",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7ad",
        "programs": [
            4410,
            4415,
            4463
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "48",
        "code": "COMPAH",
        "description": "The Computer Science Honours program is a one year full-time or two year part-time program. It is undertaken after completing the requirements for the Bachelor of Science in Computer Science with a WAM of 65.\n\nApplicants from other universities who have majored in computer science and obtained the equivalent of a 65 average are also eligible.",
        "level": "Honours",
        "url": "/Undergraduate/specialisations/2020/COMPAH",
        "name": "Computer Science",
        "faculty": "engineering",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7af",
        "programs": [
            4515
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "96",
        "code": "COMPI1",
        "description": "Artificial Intelligence (AI), once simply a branch of computing research, has over the last decade moved into the mainstream of computational problem solving techniques. Many systems, from search engines to financial systems and health systems employ AI techniques such as machine learning. While true 'intelligence' via computers is still remote, AI techniques are increasingly being used to enhance the performance of a vast range of existing systems, and to enable new applications, especially those involving large amounts of data.\n\nIn many applications (e.g. driverless vehicles), AI allows existing systems to work with less and less manual intervention. As autonomous devices become more common, potential employers include companies that can make ready use of automation. This includes companies concerned with home and office automation, entertainment companies and autonomous systems research and development. Autonomous systems and the sophisticated sensors they employ are also adopted in many industries to enhance production and to improve safety (e.g. mining, manufacturing, transport).\n\nThis stream introduces students to the foundations of artificial intelligence and the core technologies (machine learning, knowledge representation) that are required to apply AI in the real world.",
        "level": "Major",
        "url": "/Undergraduate/specialisations/2020/COMPI1",
        "name": "Computer Science (Artificial Intelligence)",
        "faculty": "engineering",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7af",
        "programs": [
            3778
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "96",
        "code": "COMPN1",
        "description": "Networks are critical infrastructure in modern society, and look set to grow in importance in the future. Business, finance, health services, education, defence and leisure all rely on the existence of a stable, secure, fast, high-capacity network. Computing professionals with a deep understanding of networks will be in high demand for the foreseeable future both to maintain and enhance existing network infrastructure (especially mobile networks), and to develop new forms of networking. \n\nThe Computer Networks stream in the Computer Science program exposes students to the foundations of computer networks, their architecture, their management and emerging application areas, such as the Internet of Things.",
        "level": "Major",
        "url": "/Undergraduate/specialisations/2020/COMPN1",
        "name": "Computer Science (Computer Networks)",
        "faculty": "engineering",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7af",
        "programs": [
            3778
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "96",
        "code": "COMPD1",
        "description": "Database management systems (DBMSs) provide essential infrastructure for handling the large volumes of data required by modern enterprises: corporate, government, scientific and educational. How database systems are applied can critically affect the success of an organisation. In the future, the management of very large volumes of organisational data will be an essential component of the livelihood and growth of every organisation.\n\nSince databases are so widely used, potential employers include any organisation that relies on the effective management of data. Obvious examples of large organisations with significant data management needs are financial institutions, telecommunications companies, manufacturing enterprises, and government departments. However, employment is not limited to such organisations, since data management is also critical in medium and small enterprises, such as scientific research labs and small businesses.\n\nThe Database Systems stream in the Computer Science program exposes students both to the foundations of DBMS architecture (essential knowledge for database administrators) as well as to the principles behind leading edge applications of databases, such as e-Commerce, data warehousing, and data mining.",
        "level": "Major",
        "url": "/Undergraduate/specialisations/2020/COMPD1",
        "name": "Computer Science (Database Systems)",
        "faculty": "engineering",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7af",
        "programs": [
            3778
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "96",
        "code": "COMPS1",
        "description": "Embedded systems comprise over 99% of all computer systems in operation. They are designed for specific purposes ranging from household appliances, such as microwave ovens and set-top boxes, to sophisticated real-time controllers used in fly-by-wire aircraft and the Large Hadron Collider. The study of embedded systems encompasses the design of both software and hardware and considers important economic factors including cost, performance and reliability.\n\nThe Embedded Systems stream in the Computer Science program exposes students to both the underlying hardware technologies and the techniques for controlling hardware programmatically.",
        "level": "Major",
        "url": "/Undergraduate/specialisations/2020/COMPS1",
        "name": "Computer Science (Embedded Systems)",
        "faculty": "engineering",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7af",
        "programs": [
            3778
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "96",
        "code": "COMPJ1",
        "description": "Programming languages form the underpinnings of all software development. Over the years, computer scientists have identified a number of major programming paradigms and developed a wide variety of programming languages based on these, ranging from general purpose languages to application specific languages. The study of programming languages gives valuable insights into the nature of computation in all of its manifestations.\n\nThe Programming Languages stream in the Computer Science program exposes students to the foundations of programming languages, how they are designed, how they are implemented, and how they might best be exploited by programmers.The stream considers procedural languages, functional languages, object-oriented languages and parallel languages.",
        "level": "Major",
        "url": "/Undergraduate/specialisations/2020/COMPJ1",
        "name": "Computer Science (Programming Languages)",
        "faculty": "engineering",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7af",
        "programs": [
            3778
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "96",
        "code": "COMPY1",
        "description": "This offers a stream to undergraduate students intending to practice in Cyber Security in industry. This is a high demand area of employment and is forecast to have serious undersupply of graduates to at least 2025. The cyber security education design is based on the security approaches of Ross Anderson and Bruce Schneier and incorporates an explicit engineering focus to security, rather than the more usual ad hoc \"hacker\"?, or commercial \"responsive\"? approaches of cyber security education.\n\nThe core courses in the stream teach analysis and systematic professional approaches to engineering security and examine failures, bugs, and human / system interactions and issues. There is an ongoing focus on security by design and professional ethical security practice.\n\nSpecialist elective courses allow students to specialise in their areas of interest and skill. Graduates of the stream are equipped for careers in penetration testing, incident response, software assessment, malware analysis, forensics, military or law enforcement, security consulting, and security lead in dev teams. This stream relies on students being exposed to C and to secure coding and vulnerabilities in first year including: memory use (data representation, the heap, function calls and the stack), and some assembly.",
        "level": "Major",
        "url": "/Undergraduate/specialisations/2020/COMPY1",
        "name": "Computer Science (Security Engineering)",
        "faculty": "engineering",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7af",
        "programs": [
            3778
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "96",
        "code": "COMPE1",
        "description": "Businesses today conduct more and more of their work online, and there is a need for computing professionals who understand how to develop online systems, integrate them into the workflow of modern businesses, and build connections between businesses. eCommerce systems are typically built on top of database technology and run over the web, whether as user interfaces or as online services.\n\nThe Electronic Commerce stream in the Computer Science program exposes students to a range of core network, database and interface technologies, the principles behind them, and techniques for analysing them, and explores how these technologies might be used to create effective online services.",
        "level": "Major",
        "url": "/Undergraduate/specialisations/2020/COMPE1",
        "name": "Computer Science (eCommerce Systems)",
        "faculty": "engineering",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7af",
        "programs": [
            3778
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "24",
        "code": "CRIMC2",
        "description": "Criminology is an interdisciplinary field devoted to the study of crime, deviance, social control and the legal system. Over the past 50 years, criminology has evolved into a rich, broad-based discipline, no longer narrowly focused on crime and punishment. Contemporary criminological scholars investigate a broad range of topics including justice, conflict, risk, security, insurance, policing, governance and regulation. Criminology is shaped not only by scholars in law, philosophy, psychology and sociology, but also those in history, politics, economics, architecture, cultural studies, and other interdisciplinary fields.\n\nCriminology aims to provide you with a critical and informed understanding of crime and justice issues in contemporary society. At UNSW we use an interdisciplinary approach that integrates disciplinary knowledge from Sociology, Psychology, History, Law and Policy Studies, to provide a critical and theoretically informed understanding of crime and the justice system, criminal law and procedures, criminological research methods, as well as a range of current issues with respect to social control, juvenile justice, human rights, regulation, and penal policy.",
        "level": "Minor",
        "url": "/Undergraduate/specialisations/2020/CRIMC2",
        "name": "Criminology",
        "faculty": "arts and social sciences",
        "faculty_code": "d7a56ceb4f0093004aa6eb4f0310c7ac",
        "programs": [
            3409,
            3429,
            3434,
            3438,
            3444,
            3453,
            3454
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "60",
        "code": "CRIMC1",
        "description": "Criminology is an interdisciplinary field devoted to the study of crime, deviance, social control and the legal system. Over the past 50 years, criminology has evolved into a rich, broad-based discipline, no longer narrowly focused on crime and punishment. Contemporary criminological scholars investigate a broad range of topics including justice, conflict, risk, security, insurance, policing, governance and regulation. Criminology is shaped not only by scholars in law, philosophy, psychology and sociology, but also those in history, politics, economics, architecture, cultural studies, and other interdisciplinary fields.\n\nThe major stream in Criminology will provide you with an advanced understanding of crime and justice issues in contemporary society. At UNSW we use an interdisciplinary approach that integrates disciplinary knowledge from Sociology, Psychology, History, Law and Policy Studies, to provide a critical and theoretically informed understanding of crime and the justice system, criminal law and procedures, criminological research methods, as well as a range of current issues with respect to social control, juvenile justice, human rights, regulation, and penal policy. A major stream in Criminology pairs well with a minor stream in Politics and International Relations or Sociology and Anthropology.",
        "level": "Major",
        "url": "/Undergraduate/specialisations/2020/CRIMC1",
        "name": "Criminology",
        "faculty": "arts and social sciences",
        "faculty_code": "d7a56ceb4f0093004aa6eb4f0310c7ac",
        "programs": [
            3409,
            3435,
            3444
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "78",
        "code": "GEOLS1",
        "description": "Earth Scientists study the nature and evolution of the structure of our planet, covering everything from natural crystals and fossils to the powerful forces that drive earthquakes and volcanoes and move continents across the globe. Almost everything we do involves the Earth in some way. Tuition covers environmental geology, geochemistry, geophysics, hydrogeology and groundwater contamination, mineral and petroleum exploration and resources, palaeontology, remote sensing and much more. Field work in different regions of New South Wales is an essential part of geology courses.",
        "level": "Major",
        "url": "/Undergraduate/specialisations/2020/GEOLS1",
        "name": "Earth Science",
        "faculty": "science",
        "faculty_code": "57a56ceb4f0093004aa6eb4f0310c7ae",
        "programs": [
            3925,
            3962,
            3965,
            3970,
            3987
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "48",
        "code": "BIOSLH",
        "description": "The School of Biological, Earth and Environmental Sciences (BEES) offers a number of Honours streams including in Ecology. Honours in Ecology introduces undergraduate students to research and project work of relevance to various endeavours in the biological, ecological and environmental sciences. Students undertake a supervised research project that places emphasis on scientific research methods, the use of relevant specialised techniques, critical thinking and scientific communication via written submissions and oral presentations. The learning and teaching philosophy underpinning this Program is centred on Honours students taking on their role as a researcher to develop these skills and the relevant advanced disciplinary knowledge with some degree of independence. The Program, run over three sessions, includes a Research Proposal (which may include an extended literature review and a risk management component) and a substantial independent Research Project under the close supervision of academic(s) within the School of BEES. These components are complemented by more formal seminars and workshops, focusing on graduate attributes (scientific communication, risk management, ethics and professional development) as well as School (and Institute/Centre) seminars.",
        "level": "Honours",
        "url": "/Undergraduate/specialisations/2020/BIOSLH",
        "name": "Ecology",
        "faculty": "science",
        "faculty_code": "57a56ceb4f0093004aa6eb4f0310c7ae",
        "programs": [
            3962,
            4500
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "78",
        "code": "BIOSG1",
        "description": "Ecology is a branch of Science concerned with the interrelationship of organisms and their environment.",
        "level": "Major",
        "url": "/Undergraduate/specialisations/2020/BIOSG1",
        "name": "Ecology",
        "faculty": "science",
        "faculty_code": "57a56ceb4f0093004aa6eb4f0310c7ae",
        "programs": [
            3925,
            3962,
            3965,
            3966,
            3970,
            3987
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "60",
        "code": "ECONE1",
        "description": "A major in Econometrics consists of 60 UOC (10 courses). This is regardless of whether you are doing a single major or taking Econometrics as a second major. All courses are specified below.",
        "level": "Major",
        "url": "/Undergraduate/specialisations/2020/ECONE1",
        "name": "Econometrics",
        "faculty": "unsw business school",
        "faculty_code": "5a3a1d4f4f4d97404aa6eb4f0310c77a",
        "programs": [
            3543
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "48",
        "code": "ECONEH",
        "description": "The Honours year provides students with an opportunity to deepen their knowledge of econometrics and to develop the necessary skills to tackle the economic and econometric issues and challenges that they will encounter throughout their careers. Students learn and put into practice the skills needed to conduct an independent and original research project and to communicate and defend the results of the research. Graduates with an Honours degree from the School of Economics at UNSW have moved on to successful careers in both the public and private sectors and academia.\n\nThe Economics Honours program with specialisation in Econometrics is designed for students with the equivalent of a BEc degree with a major in Econometrics. There are prerequisite courses for the Econometrics Honours degree which students must complete prior to their Honours year.\n\nTo satisfy the Honours requirements, students complete an additional year of study, including Honours level courses (both compulsory and elective) and a research thesis in econometrics. Full-time and part-time (during 3 semesters) study is available in this program. Mid-year entry to the BEc(Hons) is possible, but is typically recommended only for part-time study.",
        "level": "Honours",
        "url": "/Undergraduate/specialisations/2020/ECONEH",
        "name": "Econometrics",
        "faculty": "unsw business school",
        "faculty_code": "5a3a1d4f4f4d97404aa6eb4f0310c77a",
        "programs": [
            4502
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "60",
        "code": "ECONA1",
        "description": "A major in Economics consists of 60 UOC (10 courses). Eight (8) of these courses are specified; the other two (2) are elective courses that are chosen from the list below. This is regardless of whether you are doing a single major or taking Economics as a second majorA minor consists of 30 UOC (5 courses) containing ECON1101, ECON1102 and 18 UOC at level 2 or 3. The minor does not form part of the nominated major.Economics/Law students must take 96 UOC (16 courses) in the Business School consisting of the major requirements (10 courses), ECON1401 Economic Perspectives, and five (5) additional elective courses (including at least 2 ECON courses offered by the School of Economics) as per the BEc program.",
        "level": "Major",
        "url": "/Undergraduate/specialisations/2020/ECONA1",
        "name": "Economics",
        "faculty": "unsw business school",
        "faculty_code": "5a3a1d4f4f4d97404aa6eb4f0310c77a",
        "programs": [
            3409,
            3420,
            3478,
            3543
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "48",
        "code": "ECONAH",
        "description": "The Honours year provides students with an opportunity to deepen their knowledge of economics and to develop the necessary skills to tackle the economic issues and challenges that they will encounter throughout their careers. Students learn and put into practice the skills needed to conduct an independent and original research project and to communicate and defend the results of the research. Graduates with an Honours degree from the School of Economics at UNSW have moved on to successful careers in both the public and private sectors and academia.\n\nThe Economics Honours program is designed for students with the equivalent of a BEc degree with a major in Economics or Econometrics or an economics major in another program.There are prerequisite courses for the Economics Honours degree that must have completed prior to their Honours year.\n\nTo satisfy the Honours requirements, students complete an additional year of study, including Honours level courses (both compulsory and elective) and a research thesis in economics. Full-time and part-time (during 3 semesters) study is available in this program. Mid-year entry to the BEc(Hons) is possible, but is typically recommended only for part-time study.",
        "level": "Honours",
        "url": "/Undergraduate/specialisations/2020/ECONAH",
        "name": "Economics",
        "faculty": "unsw business school",
        "faculty_code": "5a3a1d4f4f4d97404aa6eb4f0310c77a",
        "programs": [
            4502
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "30",
        "code": "ECONA2",
        "description": "A minor consists of 30 UOC (5 courses) containing at least 18 UOC at level 2 or 3.",
        "level": "Minor",
        "url": "/Undergraduate/specialisations/2020/ECONA2",
        "name": "Economics",
        "faculty": "unsw business school",
        "faculty_code": "5a3a1d4f4f4d97404aa6eb4f0310c77a",
        "programs": [
            3409,
            3409,
            3429,
            3429,
            3434,
            3434,
            3438,
            3438,
            3453,
            3453,
            3454,
            3454
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "96",
        "code": "ELECF1",
        "description": "This stream is an exit point for students from the Bachelor of Engineering (Honours) program 3707 in Electrical Engineering.\nStream Structure\nStudents will need to complete 96 UOC of engineering courses from the BE (Hons) stream in Electrical Engineering, with at least 24 UOC of these courses being from year 3 or above.\nPlease see handbook information on Electrical Engineering stream for full details on courses. Students should seek further information from their school.",
        "level": "Major",
        "url": "/Undergraduate/specialisations/2020/ELECF1",
        "name": "Electrical Engineering",
        "faculty": "engineering",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7af",
        "programs": [
            3706
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "168",
        "code": "ELECAH",
        "description": "The School of Electrical Engineering & Telecommunications offers a wide range of undergraduate and postgraduate study in all areas of the professions of Electrical Engineering and Telecommunications. The School's streams within the undergraduate Bachelor of Engineering (Hons) program in Electrical and Telecommunications Engineering continue to act as models for educating engineers in tomorrow's technology. Options within Electrical Engineering include: Telecommunications, Photonics, Systems and Control, Energy Systems, Microelectronics, and Signal Processing. The BE degree programs in Electrical Engineering are accredited by the Engineers Australia as meeting the requirements for admission to graduate membership.\n\nThe undergraduate curricula are being progressively revised to provide flexible training to suit the future needs of students. Individual student needs can be further met by substitution provisions within the programs.",
        "level": "Honours",
        "url": "/Undergraduate/specialisations/2020/ELECAH",
        "name": "Electrical Engineering",
        "faculty": "engineering",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7af",
        "programs": [
            3707,
            3768
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "36",
        "code": "REGZC1",
        "description": "REGZC1 is the engineering stream of 6114 University Preparation Program",
        "level": "Major",
        "url": "/Undergraduate/specialisations/2020/REGZC1",
        "name": "Engineering (UPP)",
        "faculty": "dvcacademicboardofstudies",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7b3",
        "programs": [
            6114
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "48",
        "code": "ZHSSEH",
        "description": "The English and Media Studies Honours stream introduces undergraduate students to research in various literary genres. Students undertake a supervised research project that places emphasis on humanities research methods, critical thinking and high-level analytical skills, and communication via written submissions and oral presentations. The learning and teaching philosophy underpinning this course is centred on Honours students taking on their 'role as a researcher' to develop these skills and the relevant advanced disciplinary knowledge. \n\nStudent undertake research projects in multiple fields of English literature and media studies closely related to research interests of staff.\n\nThe English and Media Studies Honours stream involves undertaking a research project that, although conducted under supervision, contains substantial independent research and self-direction. The research project is described in a thesis that forms a major part of the assessment. The research project is complemented by introductory written and oral background presentations and oral presentation of the research project. There are also relevant advanced level courses that students must undertake.",
        "level": "Honours",
        "url": "None",
        "name": "English and Media Studies",
        "faculty": "unsw canberra at adfa",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7ad",
        "programs": []
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "60",
        "code": "ENVST1",
        "description": "This stream is for students enrolled in the Bachelor of Science (Environmental Management) undertaking a disciplinary specialisation in Environmental Chemistry. \n\nStudents choose an Approved Major as a part of the core component of the BSc (EnvMgmt) degree. See the program page for 3965 Bachelor of Science (Environmental Management) for the courses to be taken in addition to the courses listed below.",
        "level": "Major",
        "url": "/Undergraduate/specialisations/2020/ENVST1",
        "name": "Environmental Chemistry",
        "faculty": "science",
        "faculty_code": "57a56ceb4f0093004aa6eb4f0310c7ae",
        "programs": [
            3965
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "96",
        "code": "CVENK1",
        "description": "Please see the description for Program 3773 here \n\nFurther information on the program study plan can be found on the\nFaculty of Engineering Website.",
        "level": "Major",
        "url": "/Undergraduate/specialisations/2020/CVENK1",
        "name": "Environmental Engineering",
        "faculty": "engineering",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7af",
        "programs": [
            3706
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "168",
        "code": "CVENBH",
        "description": "The School of Civil and Environmental Engineering offers a four year honours degree stream leading to a Bachelor of Engineering (Hons) in Environmental Engineering professionally accredited by Engineers Australia. Flexibility and choice are maintained throughout the entire structure by providing many elective courses.\n\nEnvironmental engineers are concerned with the environmental impact of engineering activities. They apply their broad knowledge of engineering and environmental processes in identifying environmental problems and in developing effective solutions to them. They also coordinate the activities of specialist groups such as biologists, ecologists and geologists within major projects. The discipline of environmental engineering embraces parts of civil engineering, with emphasis on management, systems design, water, geotechnical and transport engineering, together with aspects of chemical engineering, applied and biological sciences and environmental studies.\n\nThis stream can be taken on a four-year full-time basis or on a part-time basis subject to the approval of the Head of School. Intending part-time students are advised that all courses are offered only in the daytime.\n\nA detailed stream structure can be found on the School website, which includes suggested scheduling of courses by semester. While some courses are given twice a year, many courses are given only once a year. In addition, courses may have prerequisites and exclusions. Thus students should plan their enrolments appropriately.",
        "level": "Honours",
        "url": "/Undergraduate/specialisations/2020/CVENBH",
        "name": "Environmental Engineering",
        "faculty": "engineering",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7af",
        "programs": [
            3707
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "48",
        "code": "ENVPEH",
        "description": "The Honours program in Environmental Humanities equires the completion of 48 UOC (the equivalent of one year full-time study or two years part-time study).\n\nThe Honours program involves seminars and the completion of a research project or thesis. It consists of 18 UOC of coursework and 30 UOC of thesis/project. The thesis/research project should not exceed 20,000 words in length.",
        "level": "Honours",
        "url": "/Undergraduate/specialisations/2020/ENVPEH",
        "name": "Environmental Humanities",
        "faculty": "arts and social sciences",
        "faculty_code": "d7a56ceb4f0093004aa6eb4f0310c7ac",
        "programs": [
            4504
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "24",
        "code": "ENVPE2",
        "description": "Species extinction, genetically modified organisms, climate change and nuclear power are just a few of the challenges facing us today. While these are all clearly 'environmental' issues, they are also all profoundly social, cultural and political challenges. Education in the Environmental Humanities focuses on developing critical insight into the 'human dimensions' of these environmental issues; issues that now permeate almost every aspect of our lives, from everyday lifestyle decisions to collective and public choices concerning urban development, energy security and food production.\nEnvironmental Humanities is an interdisciplinary minor stream that is designed to provide you with a foundation from which to understand and critically engage with contemporary environmental issues. Drawing on resources from across the humanities and social sciences, teaching in Environmental Humanities provides you with a valuable and distinctive approach to the environment, grounded in the fields of history, philosophy, geography, cultural studies, literature, science and technology studies (STS) and social theory.",
        "level": "Minor",
        "url": "/Undergraduate/specialisations/2020/ENVPE2",
        "name": "Environmental Humanities",
        "faculty": "arts and social sciences",
        "faculty_code": "d7a56ceb4f0093004aa6eb4f0310c7ac",
        "programs": [
            3429,
            3434,
            3438,
            3447,
            3453,
            3454,
            3543
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "60",
        "code": "ENVPE1",
        "description": "Species extinction, genetically modified organisms, climate change and nuclear power are just a few of the challenges facing us today. While these are all clearly 'environmental' issues, they are also all profoundly social, cultural and political challenges. Education in the Environmental Humanities focuses on developing critical insight into the 'human dimensions' of these environmental issues; issues that now permeate almost every aspect of our lives, from everyday lifestyle decisions to collective and public choices concerning urban development, energy security and food production.\nEnvironmental Humanities is an interdisciplinary major stream that is designed to provide you with a deep understanding with which to critically engage with contemporary environmental issues. Drawing on resources from across the humanities and social sciences, teaching in Environmental Humanities provides you with a valuable and distinctive approach to the environment, grounded in the fields of history, philosophy, geography, cultural studies, literature, science and technology studies (STS) and social theory.\nYour final course in the Environmental Humanities major will introduce you to a substantial research project focusing on a contemporary environmental issue.",
        "level": "Major",
        "url": "/Undergraduate/specialisations/2020/ENVPE1",
        "name": "Environmental Humanities",
        "faculty": "arts and social sciences",
        "faculty_code": "d7a56ceb4f0093004aa6eb4f0310c7ac",
        "programs": [
            3409,
            3420,
            3444
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "48",
        "code": "ENVSUH",
        "description": "The School of Biological, Earth and Environmental Sciences (BEES) offers a number of Honours streams including in Environmental Management. Honours in Environmental Management introduces undergraduate students to research and project work of relevance to various endeavours in the biological, ecological and environmental sciences. Students undertake a supervised research project that places emphasis on scientific research methods, the use of relevant specialised techniques, critical thinking and scientific communication via written submissions and oral presentations. The learning and teaching philosophy underpinning this Program is centred on Honours students taking on their role as a researcher to develop these skills and the relevant advanced disciplinary knowledge with some degree of independence. The Program, run over three sessions, includes a a Research Proposal (which includes an extended literature review and a risk management component) and a substantial independent Research Project  under the close supervision of academics in the School of BEES. These components are complemented by more formal seminars and workshops, focusing on graduate attributes (scientific communication, risk management, ethics and professional development) as well as School (and Institute/Centre) seminars.",
        "level": "Honours",
        "url": "/Undergraduate/specialisations/2020/ENVSUH",
        "name": "Environmental Management",
        "faculty": "science",
        "faculty_code": "57a56ceb4f0093004aa6eb4f0310c7ae",
        "programs": [
            4500
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "48",
        "code": "SOMSFH",
        "description": "The Exercise Physiology Honours stream introduces undergraduate students to medical research. Students undertake a supervised research project that places emphasis on scientific research methods, the use of relevant specialised techniques, critical thinking and scientific communication via written submissions and oral presentations. The research project may be undertaken in a wide range of laboratories within the School of Medical Sciences (SoMS), affiliated Hospitals and Research Institutes/Centres or other Schools within the Faculty of Medicine.",
        "level": "Honours",
        "url": "/Undergraduate/specialisations/2020/SOMSFH",
        "name": "Exercise Physiology",
        "faculty": "medicine",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7b0",
        "programs": [
            4500
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "48",
        "code": "FINSA1",
        "description": "Finance is a study of financial and capital markets. It is concerned with decision making within those markets, and how values or prices of financial assets are determined. Finance is also concerned with investment decisions (for example, selection among alternative projects, selection of securities to include in a portfolio), financing decisions of a firm (dividend policy, debt and equity structures, and lease purchase decisions), and the development of risk-hedging strategies so as to minimise the damaging effects of adverse movements in share prices, interest rates, exchange rates, and other uncertainties in domestic and international financial markets.\nThis stream is not to be undertaken by Finance Co-op students.",
        "level": "Major",
        "url": "/Undergraduate/specialisations/2020/FINSA1",
        "name": "Finance",
        "faculty": "unsw business school",
        "faculty_code": "5a3a1d4f4f4d97404aa6eb4f0310c77a",
        "programs": [
            3502,
            3543,
            3554,
            3558,
            3586,
            3587
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "84",
        "code": "FINSD1",
        "description": "The finance co-op major stream provides outstanding scholars with the opportunity of undertaking their course work in the Bachelor of Commerce degree with industrial training experience. By combining their degree with hands-on practical experience, Co-op scholars are provided with an excellent opportunity for furthering their knowledge and skills in partnership with sponsor organisations. This stream gives scholars an opportunity to broaden their knowledge beyond finance by taking up another major i.e. double major instead of taking up compulsory honours subjects.\nThis stream can be completed within the four-year degree program which combines the requirements of the Bachelor of Commerce with 18 months of coordinated industry placement (Industry placement extends outside university semesters).\nNote: Finance Co-op students are required to maintain a Distinction Average to meet the program requirements.",
        "level": "Major",
        "url": "/Undergraduate/specialisations/2020/FINSD1",
        "name": "Finance Co-op",
        "faculty": "unsw business school",
        "faculty_code": "5a3a1d4f4f4d97404aa6eb4f0310c77a",
        "programs": []
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "96",
        "code": "FINSBH",
        "description": "The Finance Co-op Honours major provides outstanding scholars with the opportunity of undertaking their coursework with industrial training experience. Further, in 4th year the students take compulsory honours finance courses followed by thesis writing. The Honours (research) component of the School of Banking and Finance's Co-op model is a central component of preparing future leaders of the financial services industry.\nNote: Finance Co-op honours students are required to maintain a Distinction Average and minimum distinction in finance subjects to remain in program 3565.\nThe finance co-op honours major is within the four-year degree program which combines the requirements of the Bachelor of Commerce with 18 months of coordinated industry placement plus honours (Industry placement extends outside university semesters).",
        "level": "Honours",
        "url": "/Undergraduate/specialisations/2020/FINSBH",
        "name": "Finance Co-op Honours",
        "faculty": "unsw business school",
        "faculty_code": "5a3a1d4f4f4d97404aa6eb4f0310c77a",
        "programs": [
            3565
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "60",
        "code": "ECONJ1",
        "description": "Financial Economics is concerned with understanding how financial instruments are priced in markets and how individuals and firms manage financial risk.\n\nMarkets for financial instruments arise because some firms and individuals want to borrow while others want to save. A large corporation, for example, may borrow funds to purchase new plant and equipment by issuing further stock while an individual may save by purchasing stocks or government bonds. Markets for financial instruments also arise because firms and individuals want to manage financial risk. For example, a large corporation may bet against the risk of large fluctuations in the Australian - U.S. dollar exchange rate by selling its goods by way of futures contracts. Understanding how the prices of financial instruments are determined in the market place is a central concern of financial economics, along with the design of new financial derivatives.\n\nThe area of financial economics that deals with the study of real-world data is known as financial econometrics. Financial econometrics is concerned with the statistical analysis of financial data and testing the real-world applicability of asset-pricing theories. This major provides students with a thorough understanding of the economic principles that underlie the pricing and allocative role of all financial assets, whether they are stocks, bonds, futures or options.",
        "level": "Major",
        "url": "/Undergraduate/specialisations/2020/ECONJ1",
        "name": "Financial Economics",
        "faculty": "unsw business school",
        "faculty_code": "5a3a1d4f4f4d97404aa6eb4f0310c77a",
        "programs": [
            3502,
            3543,
            3554,
            3558,
            3586,
            3587
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "48",
        "code": "FINSR1",
        "description": "Financial Technology (FinTech) is a rapidly growing field in finance where technology is used to enhance and reimagine financial services and sometimes results in disruptive changes. The most well-known examples are payment systems (PayPal, WeChat, Bitcoin and cryptocurrency), portfolio management and Robo-advice (US, Europe, Australia), peer-to-peer lending (US, China, India and elsewhere), high-frequency trading (global), and decentralized finance (of which Bitcoin and cryptocurrency form the foundation). Established financial services firms (BigTech) and entrepreneurs (FinTech) both demand talent in this space as FinTech products are by nature scalable and have potential for huge impact in a financial services business.\n \nCo-developed with financial services industry experts, this major introduces students to finance theory, financial products, markets, and institutions, then explores how big data and other technologies allow FinTech start-ups to cause consumers to shift away from traditional finance - fundamentally changing the way money is raised, transferred, stored, loaned, and invested around the world. In addition to a conceptual understanding of finance theory, financial markets, and financial services firms, students will experience FinTech courses via the Integrated Learning Laboratory (iLab). They will be able to gain personal access to financial market data platforms, handle financial market and unstructured data, learn how financial products work via the Python programming language, trade using the leading stock trading platform used by brokerage firms, and interact with practitioners.\n \nThe Bachelor of Commerce (Financial Technology) major can be taken standalone or be taken to complement other streams of studies such as finance, information system, computer science, engineering, law, and more. It is also available as a minor for students with a constrained degree program.",
        "level": "Major",
        "url": "/Undergraduate/specialisations/2020/FINSR1",
        "name": "Financial Technology",
        "faculty": "unsw business school",
        "faculty_code": "5a3a1d4f4f4d97404aa6eb4f0310c77a",
        "programs": [
            3502,
            3543,
            3554,
            3558,
            3586,
            3587
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "30",
        "code": "FINSR2",
        "description": "The Financial Technology minor is intended for students who wish to integrate finance theory with financial market data analysis and programming skills for the creation, pricing and management of financial and banking products. The integration of financial knowledge, data and modelling skills opens doors for graduates in financial institutions, start-ups and other opportunities.",
        "level": "Minor",
        "url": "/Undergraduate/specialisations/2020/FINSR2",
        "name": "Financial Technology",
        "faculty": "unsw business school",
        "faculty_code": "5a3a1d4f4f4d97404aa6eb4f0310c77a",
        "programs": [
            3502,
            3543,
            3554,
            3558,
            3586,
            3587
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "72",
        "code": "FOODH1",
        "description": "Food Science involves the understanding of fundamental sciences and the application of this knowledge from paddock to plate. It involves the study of production, handling, processing, preservation, distribution and marketing, through to consumption and utilisation by consumers.Food Science is concerned with food processes, food commodities, food composition and food quality (including sensory properties, food safety and quality assurance and nutritional value of foods).",
        "level": "Major",
        "url": "/Undergraduate/specialisations/2020/FOODH1",
        "name": "Food Science",
        "faculty": "science",
        "faculty_code": "57a56ceb4f0093004aa6eb4f0310c7ae",
        "programs": [
            3925,
            3970,
            3987
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "168",
        "code": "FOODKH",
        "description": "The UNSW Bachelor of Science (Honours) in food science is a four year professional degree program designed to equip you for a career as a food scientist. We provide you with a solid background in mathematics, natural and applied sciences that will prepare you for learning knowledge and skills in a food science specialisation. You will get the chance to apply yourself to food product design and enquiry projects, professional food practice, food systems management, product design, and research.\n\nThe specialisation in Food Science and Nutrition emphasises physiology and nutrition. \n\nThe stream structure below gives one sequence of courses that fulfils the requirements of the major. However, many courses are offered only once per year and others have pre-requisites or exclusions which govern the order in which they can be taken. Both of these things can have a big impact on enrolment planning if poor choices of course combinations are made. Students are strongly encouraged to consult the School websitefor advice on course sequences that are consistent with timetabling and availability.\n\nThe timing of the general education courses and elective courses may be modified to optimise the student's choice of courses. It is the students responsibility to plan their enrolments appropriately.\n\nNOTE: It is VERY IMPORTANT to check recommended course sequences as explained under Stream Structure.",
        "level": "Honours",
        "url": "/Undergraduate/specialisations/2020/FOODKH",
        "name": "Food Science and Nutrition",
        "faculty": "engineering",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7af",
        "programs": [
            3061
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "168",
        "code": "FOODJH",
        "description": "This stream extends over four years and students study full-time during the day for twenty-four weeks of each year (excluding examination and recess periods).\nAn academic member of staff in the School of Chemical Engineering, as designated by the Head of School, may approve various program patterns involving full-time or part-time study.",
        "level": "Honours",
        "url": "/Undergraduate/specialisations/2020/FOODJH",
        "name": "Food Science and Technology",
        "faculty": "engineering",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7af",
        "programs": [
            3061
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "90",
        "code": "BIOCG1",
        "description": "This plan is for a major in Genetics for Advanced Science programs. It offers a general introduction to the discipline during the first years of study and then allows students to diversify into the more specialised areas of genetics, including molecular genetics, human genetics, bioinformatics, plant and microbial molecular biology, conservation biology, etc. Molecular biology has had a major impact on this discipline and is ideal for those students whose interests are in understanding and appreciating biological processes at the molecular rather than the descriptive level. The study of genetics has taken a more computer/systems approach and the major has a significant focus in this discipline integration of these approaches at the cellular and molecular level.",
        "level": "Major",
        "url": "/Undergraduate/specialisations/2020/BIOCG1",
        "name": "Genetics",
        "faculty": "science",
        "faculty_code": "57a56ceb4f0093004aa6eb4f0310c7ae",
        "programs": [
            3962
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "90",
        "code": "BIOCC1",
        "description": "This Genetics major offers a general introduction to the discipline during the first years of study and then allows students to diversify into the more specialised areas of genetics, including molecular genetics, human genetics, plant and microbial molecular biology, conservation biology, etc. Molecular biology has had a major impact on this discipline and is ideal for those students whose interests are in understanding and appreciating biological processes at the molecular rather than the descriptive level. The study of genetics has taken a more computer/systems approach and the major has a significant focus in this discipline integration of these approaches at the cellular, whole organism and population level.",
        "level": "Major",
        "url": "/Undergraduate/specialisations/2020/BIOCC1",
        "name": "Genetics",
        "faculty": "science",
        "faculty_code": "57a56ceb4f0093004aa6eb4f0310c7ae",
        "programs": [
            3925,
            3966,
            3970,
            3987
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "48",
        "code": "GEOGTH",
        "description": "The School of Biological, Earth and Environmental Sciences (BEES) offers a number of Honours streams including in Geography. Honours in Geography introduces undergraduate students to research and project work of relevance to various endeavours in the physical and social environmental sciences. Students undertake a supervised research project that places emphasis on scientific research methods, the use of relevant specialised techniques, critical thinking and scientific communication via written submissions and oral presentations. The learning and teaching philosophy underpinning this program is centred on Honours students taking on their ‘role as a researcher’ to develop these skills and the relevant advanced disciplinary knowledge with some degree of independence. The Program, run over three sessions, includes a Research Proposal (which includes a literature review and a risk management component) and a substantial an independent Research Project under the close supervision of academics within the school of BEES. These components are complemented by more formal seminars and workshops, focusing on graduate attributes (scientific communication, risk management, ethics and professional development) as well as School (and Institute/Centre) seminars.",
        "level": "Honours",
        "url": "/Undergraduate/specialisations/2020/GEOGTH",
        "name": "Geography",
        "faculty": "science",
        "faculty_code": "57a56ceb4f0093004aa6eb4f0310c7ae",
        "programs": [
            3962,
            4500
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "36",
        "code": "GEOLF2",
        "description": "Geology is the study of the nature and evolution of the structure of our planet, covering everything from natural crystals and fossils to the powerful forces that drive earthquakes and volcanoes and move continents across the globe. Almost everything we do involves the Earth in some way.",
        "level": "Minor",
        "url": "/Undergraduate/specialisations/2020/GEOLF2",
        "name": "Geology",
        "faculty": "science",
        "faculty_code": "57a56ceb4f0093004aa6eb4f0310c7ae",
        "programs": [
            3962,
            3970
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "48",
        "code": "GEOLMH",
        "description": "The School of Biological, Earth and Environmental Sciences (BEES) offers a number of Honours streams including in Geology. Honours in Geology introduces undergraduate students to research and project work of relevance to various endeavours in the earth sciences and geosciences. Students undertake a supervised research project that places emphasis on scientific research methods, the use of relevant specialised techniques, critical thinking and scientific communication via written submissions and oral presentations. The learning and teaching philosophy underpinning this Program is centred on Honours students taking on their role as a researcher to develop these skills and the relevant advanced disciplinary knowledge with some degree of independence. The Program, run over three sessions, includes a Research Proposal (which includes an extended literature review and a risk management component) and a substantial and an independent Research Project under the close supervision of academics in the school of BEES. These components are complemented by more formal seminars and workshops, focusing on graduate attributes (scientific communication, risk management, ethics and professional development) as well as School (and Institute/Centre) seminars.",
        "level": "Honours",
        "url": "/Undergraduate/specialisations/2020/GEOLMH",
        "name": "Geology",
        "faculty": "science",
        "faculty_code": "57a56ceb4f0093004aa6eb4f0310c7ae",
        "programs": [
            3962,
            4500
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "168",
        "code": "GMATEH",
        "description": "**This stream is not accepting new enrolments**\n\nThe BE in Geospatial Engineering is a four year, full time degree program. This program aims to prepare a graduate for a broad range of career opportunities in the various branches of Surveying and the numerous Spatial Information disciplines. To this end the program covers general scientific and IT principles, as well as specialised Surveying and Spatial Information topics. Specialisation is provided for through the provision of elective courses offered in the third and fourth years of the program and the choice of a targeted final year thesis project often aligned with an external industry partner. \n\nSuggestions for course sequences consistent with timetabling and availability can be found on the School website The timing of the general education courses and elective courses may be modified to optimize the student's choice of courses.While some courses are given twice a year, many courses are given only once a year. In addition, courses may have prerequisites and exclusions. Thus students should plan their enrolments appropriately.",
        "level": "Honours",
        "url": "/Undergraduate/specialisations/2020/GMATEH",
        "name": "Geospatial Engineering",
        "faculty": "engineering",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7af",
        "programs": []
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "48",
        "code": "ZHSSHH",
        "description": "The History Honours stream introduces undergraduate students to research through the study of the past. Students undertake a supervised research project that places emphasis on humanities research methods, critical thinking and high-level analytical skills, and communication via written submissions and oral presentations. The learning and teaching philosophy underpinning this course is centred on Honours students taking on their 'role as a researcher' to develop these skills and the relevant advanced disciplinary knowledge.\n\nStudent research projects relate to multiple fields of history and closely related research interests of staff.\n\nThe History Honours stream involves undertaking a research project that, although conducted under supervision, contains substantial independent research and self-direction. The research project is described in a thesis that forms a major part of the assessment. The research project is complemented by introductory written and oral background presentations and oral presentation of the research project. There are also relevant advanced level courses that students must undertake.",
        "level": "Honours",
        "url": "/Undergraduate/specialisations/2020/ZHSSHH",
        "name": "History",
        "faculty": "unsw canberra at adfa",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7ad",
        "programs": [
            4511
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "48",
        "code": "ZHSSGH",
        "description": "The Human Geography Honours stream introduces undergraduate students to human geography research. Students undertake a supervised research project that places emphasis on scientific research methods, the use of relevant specialised techniques, critical thinking and scientific communication via written submissions and oral presentations. The learning and teaching philosophy underpinning this course is centred on Honours students taking on their 'role as a researcher' to develop these skills and the relevant advanced disciplinary knowledge. \n\nStudent research projects relate to multiple fields of human and social geography and closely related research interests of staff.\n\nThe Human Geography Honours stream involves undertaking a research project that, although conducted under supervision, contains substantial independent research and self-direction. The research project is described in a thesis that forms a major part of the assessment. The research project is complemented by introductory written and oral background presentations and oral presentation of the research project. There are also relevant advanced level courses that students must undertake.",
        "level": "Honours",
        "url": "/Undergraduate/specialisations/2020/ZHSSGH",
        "name": "Human Geography",
        "faculty": "unsw canberra at adfa",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7ad",
        "programs": [
            4511
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "12",
        "code": "REGZA1",
        "description": "The Humanities stream is an 18 UoC stream within 6114 University Preparation Program (UPP). Students are required to complete two specified University Orientation and Study Skills courses (2 x 6uoc) and 1 FASS Gateway course (6uoc). Full details are provided in 6114.",
        "level": "Major",
        "url": "/Undergraduate/specialisations/2020/REGZA1",
        "name": "Humanities (UPP)",
        "faculty": "dvcacademicboardofstudies",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7b3",
        "programs": [
            6114
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "48",
        "code": "ZHSSBH",
        "description": "The Indonesian Studies Honours stream introduces undergraduate students to humanities and/or social science research in various fields of Indonesia as an area studies. Students undertake a supervised research project that places emphasis on research methods in the discipline, critical thinking, and high-level analytical skills, and communication via written submission and oral presentations. Students also do research by using materials written in major language in Southeast Asian region (e.g. Indonesian, Malays). In addition to research, students undertake courses on methods and theories specific to the discipline as well as on language translation skill for research and professional purpose. The learning and teaching philosophy underpinning this course is centred on Honours students taking on their ‘role as a researcher’ to develop these skills and the relevant advanced disciplinary knowledge.\n\nStudent research projects will relate to multiple fields of Indonesia as area studies and closely related research interests of staff.",
        "level": "Honours",
        "url": "/Undergraduate/specialisations/2020/ZHSSBH",
        "name": "Indonesian Studies",
        "faculty": "unsw canberra at adfa",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7ad",
        "programs": [
            4511
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "168",
        "code": "CEICBH",
        "description": "**This stream is not accepting new enrolments**\nIndustrial Chemistry involves researching, developing and improving properties of products we use every day through the selection and design of the chemistry employed in industrial processing. It's about taking projects from inception as a research proposal, through product development and on to commercialisation and manufacture.You'll learn how to apply your knowledge engineering and chemistry to design chemical processes and products in environmental management, general industry and services like water delivery. You'll master the entire process, extrapolating small scale, laboratory chemistry into large, industrial scale production. To get work ready, you'll apply these skills through 60 days of approved industry training.",
        "level": "Honours",
        "url": "/Undergraduate/specialisations/2020/CEICBH",
        "name": "Industrial Chemistry",
        "faculty": "engineering",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7af",
        "programs": []
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "48",
        "code": "INFSA1",
        "description": "The Information Systems (IS) major is tailored to students who are interested in business and management aspects of the discipline. You will learn about business IS in various complex decision making contexts and how these systems, and the information generated by them, support the modern organisation in achieving both day-to-day and long-term objectives. Graduates from this specialisation have a range of broad career paths to choose including: Business Consulting; Forensics and Intelligence; New Product/Service Development; Internet Entrepreneurship; Systems Development; Communications and Networking; Information Systems Security; Project Management; and Information Technology Management . With a BCom (IS) you can combine Information Systems with another Commerce discipline such as Accounting, Marketing, Economics, Business Law & Taxation, Banking & Finance or Organisation & Management.\nA major in Information Systems consists of 48 UOC (8 courses). Five (5) of these courses are specified; the other three (3) are IS elective courses that are chosen from the list below. At least two (2) of these elective courses must be at level 3 (i.e. INFS3XXX). This is regardless of whether you are doing a single major or taking Information Systems as a second major.A minor in Information Systems consists of 30 UOC (5 courses) containing: INFS1602, INFS1603, INFS2603, INFS2621 and INFS3603. The minor does not form part of the nominated major.",
        "level": "Major",
        "url": "/Undergraduate/specialisations/2020/INFSA1",
        "name": "Information Systems",
        "faculty": "unsw business school",
        "faculty_code": "5a3a1d4f4f4d97404aa6eb4f0310c77a",
        "programs": [
            3502,
            3543,
            3554,
            3558,
            3586,
            3587
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "48",
        "code": "INFSAH",
        "description": "The Information Systems Honours program offers more advanced level coursework, and the chance to develop individual skills working independently on a research project. The program provides a broad exposure to advanced areas in Information Systems as well as a high degree of specialisation that is applicable to a career in industry. The Honours program is also designed a preparation for PhD research in Information Systems at both UNSW and leading international research intensive universities.",
        "level": "Honours",
        "url": "/Undergraduate/specialisations/2020/INFSAH",
        "name": "Information Systems",
        "faculty": "unsw business school",
        "faculty_code": "5a3a1d4f4f4d97404aa6eb4f0310c77a",
        "programs": [
            4501
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "132",
        "code": "INFSBH",
        "description": "The UNSW Co-op Program is a scholarship program set up by industry and The University of New South Wales to provide financial support and industry training for selected undergraduate students. The UNSW Co-op Program is based on existing undergraduate programs at UNSW with the following special features:\nFor high achieving students the UNSW Co-op Program offers an ideal combination of challenge and opportunity.Co-op students receive structured industrial training and gain valuable work experience with up to four different employers.On graduation, sponsors are always looking to recruit Co-op Scholars.UNSW academics and senior managers from industry and government have jointly planned Co-op requirements.In 2013 Co-op scholars received a tax-free scholarship of $16,750 per annum.At present we have 130 of Australia's leading industries sponsoring 270 scholars across 18 different programs.\nThe Bachelor of Commerce (Co-op) Information Systems Program is a four year degree program which includes 18 months of coordinated industrial training experience, which extend outside university semesters.\nThe Bachelor of Commerce (Co-op) Information Systems Program offers a more advanced level of coursework and the chance to develop individual skills working independently on a research project. The program provides a broad exposure to advanced areas in Information Systems as well as a high degree of specialisation that is applicable to a career in industry. The Program is also designed as a preparation for PhD research in Information Systems at both UNSW and leading international research intensive universities.",
        "level": "Honours",
        "url": "/Undergraduate/specialisations/2020/INFSBH",
        "name": "Information Systems",
        "faculty": "unsw business school",
        "faculty_code": "5a3a1d4f4f4d97404aa6eb4f0310c77a",
        "programs": []
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "30",
        "code": "INFSA2",
        "description": "The Information Systems (IS) minor is tailored to students who are interested in business and management aspects of the discipline. You will learn about business IS in various complex decision making contexts and how these systems, and the information generated by them, support the modern organisation in achieving both day-to-day and long-term objectives. Graduates from this specialisation have a range of broad career paths to choose including: Business Analyst Consulting; Forensics and intelligence; New Product/Service Development; Internet Entrepreneurship; Systems Development; Communications and networking; Information Systems Security; Project Management; and Information Technology Management.",
        "level": "Minor",
        "url": "/Undergraduate/specialisations/2020/INFSA2",
        "name": "Information Systems",
        "faculty": "unsw business school",
        "faculty_code": "5a3a1d4f4f4d97404aa6eb4f0310c77a",
        "programs": [
            3502,
            3543,
            3554,
            3558,
            3586,
            3587,
            3778
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "84",
        "code": "INFSB1",
        "description": "The UNSW Co-op Program is a scholarship program set up by industry and The University of New South Wales to provide financial support and industry training for selected undergraduate students. The UNSW Co-op Program is based on existing undergraduate programs at UNSW with the following special features:\nFor high achieving students the UNSW Co-op Program offers an ideal combination of challenge and opportunity.Co-op students receive structured industrial training and gain valuable work experience with up to three different employers.On graduation, sponsors are always looking to recruit Co-op Scholars.UNSW academics and senior managers from industry and government have jointly planned Co-op requirements.In 2013 Co-op scholars are receiving a tax-free scholarship of $16,750 per annum.At present we have 130 of Australia's leading industries sponsoring 270 scholars across 18 different programs.\nThe Co-op Program is a four year degree program within the Bachelor of Commerce (Co-op) and includes 18 months of coordinated industrial experience. Industrial training extends outside university semesters.",
        "level": "Major",
        "url": "/Undergraduate/specialisations/2020/INFSB1",
        "name": "Information Systems Co-op",
        "faculty": "unsw business school",
        "faculty_code": "5a3a1d4f4f4d97404aa6eb4f0310c77a",
        "programs": [
            3554
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "48",
        "code": "APOLA1",
        "description": "International and Political Studies involves the study of power - how it is exercised and by whom, and how its privileges and responsibilities are a focus of conflict. The program is designed for students who are interested in politics and international affairs in a rapidly changing global environment. Our courses cover the major actors, ideas and key issues of domestic, regional and global politics, all of which have a profound impact on Australia's national security and its place in the world. The program emphasises the development of critical thinking and high-level analytical and communication skills. The skills and knowledge gained through the program are valuable for members of the ADF, which operates in an increasingly challenging domestic and international environment.",
        "level": "Major",
        "url": "/Undergraduate/specialisations/2020/APOLA1",
        "name": "International & Pol. Studies",
        "faculty": "unsw canberra at adfa",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7ad",
        "programs": [
            4400,
            4461
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "30",
        "code": "IBUSA2",
        "description": "A minor in International Business consists of 30 UOC (5 courses) containing the following courses: MGMT1101, MGMT2101, MGMT2102, MGMT3102 and MGMT3101.",
        "level": "Minor",
        "url": "/Undergraduate/specialisations/2020/IBUSA2",
        "name": "International Business",
        "faculty": "unsw business school",
        "faculty_code": "5a3a1d4f4f4d97404aa6eb4f0310c77a",
        "programs": [
            3409,
            3429,
            3434,
            3438,
            3447,
            3453,
            3454,
            3502,
            3543,
            3554,
            3586,
            3587
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "48",
        "code": "IBUSA1",
        "description": "International Business is a rapidly growing field of study dealing with the development, strategy, and management of multinational enterprises. The International Business specialisation looks at how firms conduct operations globally, how the competitive international environment shapes business and how the roles and responsibilities of firms (and managers) develop with international competition.",
        "level": "Major",
        "url": "/Undergraduate/specialisations/2020/IBUSA1",
        "name": "International Business",
        "faculty": "unsw business school",
        "faculty_code": "5a3a1d4f4f4d97404aa6eb4f0310c77a",
        "programs": [
            3409,
            3420,
            3447,
            3502,
            3543,
            3554,
            3558,
            3586,
            3587
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "48",
        "code": "ZHSSPH",
        "description": "The International and Political Studies Honours stream introduces undergraduate students to research into the study or power and the changing global environment. Students undertake a supervised research project that places emphasis on humanities research methods, critical thinking and high-level analytical skills, and communication via written submissions and oral presentations. The learning and teaching philosophy underpinning this course is centred on Honours students taking on their 'role as a researcher' to develop these skills and the relevant advanced disciplinary knowledge. \n\nStudent research projects relate to multiple fields of political and international issues and closely related research interests of staff.",
        "level": "Honours",
        "url": "/Undergraduate/specialisations/2020/ZHSSPH",
        "name": "International and Political Studies",
        "faculty": "unsw canberra at adfa",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7ad",
        "programs": [
            4511
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "48",
        "code": "HUMSC1",
        "description": "This plan offers a course of study designed to provide Indigenous students with a pathway into academic study in Law.",
        "level": "Major",
        "url": "/Undergraduate/specialisations/2020/HUMSC1",
        "name": "Law",
        "faculty": "dvcacademicboardofstudies",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7b3",
        "programs": [
            7016
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "36",
        "code": "LEGLB2",
        "description": "THIS STREAM IS FOR STUDENTS COMMENCING FROM 2016.\n\nThe Legal Studies Extended Minor Stream is an interdisciplinary stream, with courses included from Criminology, Politics, Philosophy and Law. If you are studying in the BABEd program, this stream qualifies you to teach Legal Studies in addition to another area of qualification, thus increasing your chances for employment in NSW secondary schools.\n\nThe Legal Studies Extended Minor Stream aims to develop critically aware graduates with a qualification to teach the course.",
        "level": "Minor",
        "url": "/Undergraduate/specialisations/2020/LEGLB2",
        "name": "Legal Studies (Extended)",
        "faculty": "arts and social sciences",
        "faculty_code": "d7a56ceb4f0093004aa6eb4f0310c7ac",
        "programs": [
            3409
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "24",
        "code": "LINGC2",
        "description": "THIS STREAM IS FOR STUDENTS COMMENCING FROM 2016.\nLinguistics is the study of human language. The minor stream in Linguistics provides you the opportunity to develop an understanding of a variety of questions such as: How do people use language in various situations? What is the biological basis for language? Is language unique to the human species? How and why do languages change? How do children learn language? What is the meaning of 'meaning'? Can machines talk? How does language relate to other modes of communication? Linguistics also provides the basis for a variety of practical applications including, at UNSW, the teaching and learning of foreign languages, translating and interpreting, facilitating cross-cultural communication, developing language curricula in schools, and improving literacy skills.",
        "level": "Minor",
        "url": "/Undergraduate/specialisations/2020/LINGC2",
        "name": "Linguistics",
        "faculty": "arts and social sciences",
        "faculty_code": "d7a56ceb4f0093004aa6eb4f0310c7ac",
        "programs": [
            3409,
            3429,
            3434,
            3438,
            3444,
            3453,
            3454
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "60",
        "code": "LINGC1",
        "description": "THIS STREAM IS FOR STUDENTS COMMENCING FROM 2016.\n\nLinguistics is the study of human language. The major stream in Linguistics provides you the opportunity to develop a deep understanding of a variety of questions such as: How do people use language in various situations? What is the biological basis for language? Is language unique to the human species? How and why do languages change? How do children learn language? What is the meaning of 'meaning'? Can machines talk? How does language relate to other modes of communication? Linguistics also provides the basis for a variety of practical applications including, at UNSW, the teaching and learning of foreign languages, translating and interpreting, facilitating cross-cultural communication, developing language curricula in schools, and improving literacy skills.",
        "level": "Major",
        "url": "/Undergraduate/specialisations/2020/LINGC1",
        "name": "Linguistics",
        "faculty": "arts and social sciences",
        "faculty_code": "d7a56ceb4f0093004aa6eb4f0310c7ac",
        "programs": [
            3409,
            3435,
            3444
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "36",
        "code": "LINGB2",
        "description": "THIS STREAM IS FOR STUDENTS COMMENCING FROM 2016.\n\nLinguistics is the study of human language. The extended minor stream in Linguistics addresses questions such as: How do people use language in various situations? What is the biological basis for language? Is language unique to the human species? How and why do languages change? How do children learn language? What is the meaning of 'meaning'? Can machines talk? How does language relate to other modes of communication? Linguistics also provides the basis for a variety of practical applications including the teaching and learning of foreign languages, translating and interpreting, facilitating cross-cultural communication, developing language curricula in schools, and improving literacy skills.",
        "level": "Minor",
        "url": "/Undergraduate/specialisations/2020/LINGB2",
        "name": "Linguistics (Extended)",
        "faculty": "arts and social sciences",
        "faculty_code": "d7a56ceb4f0093004aa6eb4f0310c7ac",
        "programs": [
            3409
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "48",
        "code": "MSCIJH",
        "description": "The School of Biological, Earth and Environmental Sciences (BEES) offers a number of Honours streams including Marine Science. Honours in Marine Science introduces undergraduate students to research and project work of relevance to various endeavours in the physical, environmental and ecological sciences with an emphasis on marine, aquatic and coastal environments. Students undertake a supervised research project that places emphasis on scientific research methods, the use of relevant specialised techniques, critical thinking and scientific communication via written submissions and oral presentations. The learning and teaching philosophy underpinning this program is centred on Honours students taking on their ‘role as a researcher’ to develop these skills and the relevant advanced disciplinary knowledge with some degree of independence. The program, run over three terms, includes a Research Proposal (which includes an extended literature review and a risk management component) and a substantial and partly independent Research Project. These components are complemented by more formal seminars and workshops, focusing on graduate attributes (scientific communication, risk management, ethics and professional development) as well as School (and Institute/Centre) seminars.",
        "level": "Honours",
        "url": "/Undergraduate/specialisations/2020/MSCIJH",
        "name": "Marine Science",
        "faculty": "science",
        "faculty_code": "57a56ceb4f0093004aa6eb4f0310c7ae",
        "programs": [
            3962,
            4500
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "36",
        "code": "MSCIH2",
        "description": "Marine Science looks at all aspects of the marine environment, encompassing many sciences from biology to geology. Within the School of BEES, Marine Science can be studied with an emphasis on biology, earth sciences or oceanography. Marine Biologists look at life on the shore and in the oceans and estuaries, whereas Marine Geologists study the structure and topography of the ocean floor, ocean sedimentation and marine resources.",
        "level": "Minor",
        "url": "/Undergraduate/specialisations/2020/MSCIH2",
        "name": "Marine Science",
        "faculty": "science",
        "faculty_code": "57a56ceb4f0093004aa6eb4f0310c7ae",
        "programs": [
            3962,
            3970
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "78",
        "code": "MSCIM1",
        "description": "Marine and Coastal Science looks at all aspects of the marine environment, encompassing many sciences from biology to geology. Within the School of BEES, Marine and Coastal Science can be studied with an emphasis on biology, earth sciences or oceanography. Marine Biologists look at life on the shore and in the oceans and estuaries, whereas Marine Geologists study the structure and topography of the ocean floor, ocean sedimentation and marine resources.",
        "level": "Major",
        "url": "/Undergraduate/specialisations/2020/MSCIM1",
        "name": "Marine and Coastal Science",
        "faculty": "science",
        "faculty_code": "57a56ceb4f0093004aa6eb4f0310c7ae",
        "programs": [
            3925,
            3962,
            3965,
            3966,
            3970,
            3987
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "78",
        "code": "MATSB1",
        "description": "Materials Science/Engineering is a broad-ranging discipline which applies the principles of Science and Engineering to the development of metallic, ceramic and polymeric materials and to their manufacture into goods and their subsequent performance. It is founded on the relationship between structure and properties, an understanding of which permits materials to be engineered to specific end use requirements.",
        "level": "Major",
        "url": "/Undergraduate/specialisations/2020/MATSB1",
        "name": "Materials Science",
        "faculty": "science",
        "faculty_code": "57a56ceb4f0093004aa6eb4f0310c7ae",
        "programs": [
            3925,
            3962,
            3970,
            3987
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "48",
        "code": "MATSCH",
        "description": "The Materials Science Honours stream introduces undergraduate students to the principles and practice of materials research. Students in Materials Science Honours undertake a supervised research project (MATS4505 Materials Science Honours Project (12UOC) over three terms) that places emphasis on the development of advanced disciplinary knowledge, the use of scientific research methods, the use of relevant specialised techniques relevant to the chosen research area, practice of critical thinking, synthesis and analysis of information and data, and scientific research communication in both written and oral forms.\nThe learning and teaching philosophy underpinning Honours in Materials Science is that students take on their ‘role as a researcher’ to develop these knowledge and skills with some degree of independence. Students are expected to formulate their project rationale, objectives, literature survey, and project management plan, done formally in MATS4504 Research Training (6UOC), then undertake and complete the work in a timely manner over one term. In most cases the project will involve substantial experimental work and this is usually done within established research groups in the School as well as in collaboration with other groups in the University and elsewhere.\nThe principal form of teaching is based on research supervision and direction by specialist researchers within the School of Materials Science and Engineering. Complementing this, students must complete MATS4503 Professional Skills (6UOC) which includes formal training in professional communication, writing skills, project planning, data analysis, intellectual property, and risk management and workplace safety.\nLearning outcomes from this Honours stream will form the basis for future pursuits in materials science research but are also highly relevant for many other professions - both within the materials industry, but also in many other related yet diverse fields.\nThe School offers a wide variety of student research projects in the Materials Science discipline including topics on synthesis and production of advanced materials, materials recycling, functional materials, sustainable materials, advanced surface coatings, electrical materials, biomedical materials, physical metallurgy, process metallurgy, etc. Most students would complete Honours as full-time students, where the program is completed over three consecutive terms. Part-time study is also possible depending on availability of supervision and suitable projects. Most students commence their enrolment in Term 1 (February) but Term 3 (September) entry is available. Students should check the Materials Science website for current enrolment deadlines, and assessment and completion dates.",
        "level": "Honours",
        "url": "/Undergraduate/specialisations/2020/MATSCH",
        "name": "Materials Science",
        "faculty": "science",
        "faculty_code": "57a56ceb4f0093004aa6eb4f0310c7ae",
        "programs": [
            3962,
            4500
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "36",
        "code": "MATSJ1",
        "description": "This entry lists professional electives for a major in Ceramic Engineering within the Bachelor of Engineering (Honours) in Materials Science and Engineering program.\n\nCeramic Engineering is a Science and Technology course that teaches the science and technology involved in the production of ceramic products. Ceramic Engineering is concerned with the use of ceramic raw materials, which include clays as well as high-purity chemicals, to manufacture products that can show useful properties such as thermal stability (refractories), wear resistance (abrasives and cutting tools), chemical durability (glass), and structural stability (bricks and tiles).",
        "level": "Major",
        "url": "/Undergraduate/specialisations/2020/MATSJ1",
        "name": "Materials Science and Engineering (Ceramic Engineering)",
        "faculty": "science",
        "faculty_code": "57a56ceb4f0093004aa6eb4f0310c7ae",
        "programs": [
            3131,
            3133
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "36",
        "code": "MATSF1",
        "description": "This entry lists professional electives for a major in Functional Materials within a Bachelor of Engineering (Honours) in Materials Science and Engineering.\n\nFunctional materials are those which possess highly specific native properties and functions, such as ferroelectricity, piezoelectricity, magnetism and energy storage.\n\nThis stream is intended to offer a strong undergraduate training in the field of functional materials. They are found in all classes of materials: metals, ceramics, polymers, and organic molecules. Functional materials show great promise for many strategic technological advances that will change the way in which materials are used. Typical applications include devices for electromagnetic applications, energy generation, electro- and magneto- caloric materials for energy storage, solar harvesting functions, and semiconductor logic and memory technology.\n\nFunctional Materials are introduced comprehensively in Stages 3 and 4 by a number of professional electives. Students also undertake a materials design project and a substantial thesis project. Students may complete the first one or two years of their degree at their local university engineering school and then transfer with advanced standing to UNSW.",
        "level": "Major",
        "url": "/Undergraduate/specialisations/2020/MATSF1",
        "name": "Materials Science and Engineering (Functional Materials)",
        "faculty": "science",
        "faculty_code": "57a56ceb4f0093004aa6eb4f0310c7ae",
        "programs": [
            3131,
            3133
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "36",
        "code": "MATSH1",
        "description": "This stream is for a major in Materials Engineering within the Bachelor of Engineering (Honours) in Materials Science and Engineering program.\nThe Materials Engineering stream provides a versatile, comprehensive coverage of areas involving:\nthe conception and application of properties of materials for use in engineering, structural and specialty needs necessary in the design and development of specific componentssupervision of manufacturingevaluation and certification of specifications and characteristicsproduction of new, novel and value-added productsresearchgeneral engineering and project management",
        "level": "Major",
        "url": "/Undergraduate/specialisations/2020/MATSH1",
        "name": "Materials Science and Engineering (Materials Engineering)",
        "faculty": "science",
        "faculty_code": "57a56ceb4f0093004aa6eb4f0310c7ae",
        "programs": [
            3131,
            3133
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "36",
        "code": "MATSE1",
        "description": "This entry lists professional electives for a major in Physical Metallurgy within a Bachelor of Engineering (Honours) in Materials Science and Engineering.\n\nPhysical metallurgy involves the shaping, alloying, heat treatment, joining, corrosion protection and testing of metals.\n\nThis stream is designed to produce graduates with training appropriate to both the metal and product manufacturing industries. The profession is very broad and includes careers in metal manufacturing companies, product manufacturing companies (e.g. white goods, automotive, aircraft), utilities, airline overhaul and maintenance operations, consulting companies and research organisations. Graduates may be employed in production, technical control and development, quality assurance, technical marketing and management. \n\nPhysical Metallurgy is introduced comprehensively in Stages 3 and 4 by a number of professional electives. Students also undertake a materials design project and a substantial thesis project. Students may complete the first one or two years of their degree at their local university engineering school and then transfer with advanced standing to UNSW.",
        "level": "Major",
        "url": "/Undergraduate/specialisations/2020/MATSE1",
        "name": "Materials Science and Engineering (Physical Metallurgy)",
        "faculty": "science",
        "faculty_code": "57a56ceb4f0093004aa6eb4f0310c7ae",
        "programs": [
            3131,
            3133
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "36",
        "code": "MATSG1",
        "description": "This entry lists professional electives for a major in Process Metallurgy.\n\nProcess metallurgy is concerned with extracting metals from their ores to make refined alloys.\n\nThe stream is designed to produce graduates with training appropriate to the primary metallurgy industry. The profession is very broad and affords opportunities for involvement in many specialist activities in production, technical control or development, in metal or mineral producing industries.\n\nProcess Metallurgical Engineering is introduced in Stages 3 and 4 by a number of professional electives and a thesis project. During the course, visits are made to various metallurgical works, and students are required to submit reports on some of these. Students may complete the first one or two years of their degree at their local university engineering school and then transfer with advanced standing to UNSW.",
        "level": "Major",
        "url": "/Undergraduate/specialisations/2020/MATSG1",
        "name": "Materials Science and Engineering (Process Metallurgy)",
        "faculty": "science",
        "faculty_code": "57a56ceb4f0093004aa6eb4f0310c7ae",
        "programs": [
            3131,
            3133
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "48",
        "code": "ZPEMMH",
        "description": "The Mathematics and Statistics Honours stream introduces undergraduate students to mathematical and statistical research. Students undertake a supervised research project that places emphasis on scientific research methods, the use of relevant specialised techniques, critical thinking and scientific communication via written submissions and oral presentations. The learning and teaching philosophy underpinning this course is centred on Honours students taking on their 'role as a researcher' to develop these skills and the relevant advanced disciplinary knowledge. \n\nStudent research projects relate to multiple fields of mathematics and statistics and closely related research interests of staff.\n\nThe Mathematics and Statistics Honours stream involves undertaking a research project that, although conducted under supervision, contains substantial independent research and self-direction. The research project is described in a thesis that forms a major part of the assessment. The research project is complemented by introductory written and oral background presentations and oral presentation of the research project. There are also relevant advanced level courses that students must undertake.",
        "level": "Honours",
        "url": "/Undergraduate/specialisations/2020/ZPEMMH",
        "name": "Mathematics and Statistics",
        "faculty": "unsw canberra at adfa",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7ad",
        "programs": [
            4513
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "24",
        "code": "MATHB2",
        "description": "This plan is for a minor in Mathematics for Engineers as part of the 3409 Bachelor of Arts program when combined with 3707 Bachelor of Engineering (Honours). Only students enrolled concurrently in both a Bachelor of Arts and Bachelor of Engineering(Honours) program may take this minor.",
        "level": "Minor",
        "url": "/Undergraduate/specialisations/2020/MATHB2",
        "name": "Mathematics for Engineers",
        "faculty": "science",
        "faculty_code": "57a56ceb4f0093004aa6eb4f0310c7ae",
        "programs": [
            3409
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "168",
        "code": "MECHAH",
        "description": "The Mechanical Engineering stream provides a versatile, comprehensive coverage of areas involving the conception and design of machinery and mechanical plant, the supervision of its construction, operation and maintenance, the planning and supervision of large engineering projects, and general engineering management. Due to its wide range, a number of options are provided as Technical Elective courses in the final year. These are preferentially linked to provide a direction appropriate to the needs of Australian industry and to the specific interests of students, although some flexibility is available if required. Typical fields which may be encompassed by the program include building services, computer-aided design, power generation, energy and environmental systems, gas and liquid handling, bio-mechanics, materials handling, control systems and transport. An emphasis is placed on the application of engineering science, development and management in these fields.",
        "level": "Honours",
        "url": "/Undergraduate/specialisations/2020/MECHAH",
        "name": "Mechanical Engineering",
        "faculty": "engineering",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7af",
        "programs": [
            3707,
            3768
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "96",
        "code": "MECHD1",
        "description": "This stream is an exit point for students from the Bachelor of Engineering (Honours) program 3707 in Mechanical Engineering.\nStream Structure\nStudents will need to complete 96 UOC of engineering courses from the BE (Hons) stream in Mechanical Engineering, with at least 24 UOC of these courses being from year 3 or above.\nPlease see handbook information on Mechanical Engineering stream for full details on courses. Students should seek further information from their school.",
        "level": "Major",
        "url": "/Undergraduate/specialisations/2020/MECHD1",
        "name": "Mechanical Engineering",
        "faculty": "engineering",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7af",
        "programs": [
            3706
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "168",
        "code": "MANFBH",
        "description": "The Mechanical and Manufacturing Engineering stream is designed for students with a mechanical engineering major whose interests also lie in realising, commercialising and implementing mechanical and mechatronic systems and designs. The five core courses included as part of this stream have been designed on the basis of world best practice in manufacturing and industrial engineering and reflect a top-down - bottom-up approach, spanning the disciplines of Strategy and Management, Operations and Supply Chains, Analysis and Decision-making, Design of Product-Process Systems and Technology & Automation.\n\nWithin each discipline area this new stream will cover many conceptual and analytical techniques, all supporting fact- and data-based analysis and decision making with the aim of improved product and process performance, economy and sustainability. This stream is designed to help you to learn how to transform a design from a conceptual stage into a prototype and ultimately into a commercially realisable and viable product. This stream focuses on technical as well as commercial aspects and particularly in developing the ability to build a business or commercial case for making engineering related decisions, such as investment in plant, equipment and processes. Although the main emphasis will be on product and process, consideration will also be given to designing compatible and appropriate engineering support services. The stream also emphasises the strategic impact of operations decisions and the interfaces between operations and the other functional areas of organisations, including of course, finance. This stream encompasses the key elements of operations management and investment analysis and pulls them together in a coherent format that allows you to understand the 'big picture' as well as 'the specific details'. It is aimed at integrating the knowledge gained from the mechanical engineering courses you have studied into a framework and process that allows you to implement your designs, solutions and ideas in a commercial environment.\n\nMechanical engineers have traditionally played the major role in the analysis and design of complex machinery, devices such as actuators and sensors, as well as energy transformation, heat transfer and electro-mechanical processes. In an environment of global competition, sustainability (energy, environment as well as cost and capital), increasingly complex customer requirements and statutory regulations as well as the increasing pace of technological change and new product innovation, it is vital for modern engineers to possess the skills to not only design but equally importantly, implement and realize their designs in the most appropriate way. In this increasingly complex environment, successful organizations - public, private or governmental - need engineers with analytical and diverse skills, especially in integrating technical with commercial and organisational issues, analyses and ultimately solutions. It is the purpose and aim of the Mechanical and Manufacturing Engineering stream to equip you with this knowledge and understanding to become a global engineer, indeed a leader, with the ability to apply analytical methods and quality processes to create short and long term value for your organization, your customers, and the community. It encapsulates the key elements of mechanical engineering and combines them with the five core disciplines of manufacturing and industrial engineering.\n\nAn engineer trained in Mechanical and Manufacturing Engineering may be employed in a very flexible and diverse range of disciplines and areas of industrial activity, including; product design, process design, computer aided design, computer aided manufacturing, quality improvement, technical and commercial analysis and decision making, strategic decision making, consulting, sales support, technical and organisational maintenance, and supply chain management.",
        "level": "Honours",
        "url": "/Undergraduate/specialisations/2020/MANFBH",
        "name": "Mechanical and Manufacturing Engineering",
        "faculty": "engineering",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7af",
        "programs": [
            3707
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "168",
        "code": "MTRNAH",
        "description": "The Mechatronic Engineering stream provides the student with the ability to acquire a hybrid range of skills based on mechanics, electronics and computing. Whilst there is a comprehensive coverage of mechanical engineering and design areas, the stream enables a deeper understanding of the principles supporting the conception, design, construction, maintenance, integration and repair of intelligent machines. Typical examples of these machines are robots, white goods, cameras, automated test equipment and transport vehicles.\n\nTypical fields which may be encompassed by the program include building services, computer controlled plant, manufacturing, robotics and autonomous vehicles. An emphasis is placed on the application of engineering science, development and management in these fields.",
        "level": "Honours",
        "url": "/Undergraduate/specialisations/2020/MTRNAH",
        "name": "Mechatronic Engineering",
        "faculty": "engineering",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7af",
        "programs": [
            3707,
            3768
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "96",
        "code": "MTRND1",
        "description": "This stream is an exit point for students from the Bachelor of Engineering (Honours) program 3707 in Mechatronic Engineering.\nStream Structure\nStudents will need to complete 96 UOC of engineering courses from the BE (Hons) stream in Mechatronic Engineering, with at least 24 UOC of these courses being from year 3 or above.\nPlease see handbook information on Mechatronic Engineering stream for full details on courses. Students should seek further information from their school.",
        "level": "Major",
        "url": "/Undergraduate/specialisations/2020/MTRND1",
        "name": "Mechatronic Engineering",
        "faculty": "engineering",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7af",
        "programs": [
            3706
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "48",
        "code": "SOMSAH",
        "description": "The Medical Science Honours stream introduces undergraduate students to medical research. Students undertake a supervised research project that places emphasis on scientific research methods, the use of relevant specialised techniques, critical thinking and scientific communication via written submissions and oral presentations. The research project may be undertaken in a wide range of laboratories within the School of Medical Sciences (SoMS), affiliated Hospitals and Research Institutes/Centres or other Schools within the Faculty of Medicine.",
        "level": "Honours",
        "url": "/Undergraduate/specialisations/2020/SOMSAH",
        "name": "Medical Science",
        "faculty": "medicine",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7b0",
        "programs": [
            3962,
            4500
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "168",
        "code": "MINEAH",
        "description": "This stream extends over four years and students study full-time during the day for twenty-six weeks of each year (excluding examination and recess periods). Year 1 of the stream includes courses that cover the sciences to provide the foundation for many of the engineering courses offered in Year 2. Year 3 is largely devoted to fundamental courses in mining engineering while Year 4 provides advanced instruction in aspects essential for all mining engineers. Elective courses are offered in both Year 3 and Year 4 of the stream.\nAn important requirement in the fourth year is for students to undertake personal research or a study project in mining or minerals engineering for which they are required to submit a dissertation for examination. After graduation, mining engineers who choose to develop careers in operations management gain further practical experience to obtain a Mine Manager's Certificate of Competency, in either Coal or Metalliferous Mining. Formal arrangements are in place with the University of Newcastle for students who have completed a specified program to be admitted with advanced standing to Year 3 of the program at UNSW. Recognition of students from other institutions or graduates of other disciplines may also be considered for advanced standing to the stream.\nStream Structure\nThe stream structure shown indicates one sequence of courses that fulfils the requirements of the stream rules.\nAs the stream structure indicates, a number of course electives are offered each semester in Year 3 and Year 4. This allows the student to specialize in systems of mining either surface or underground or both; in advanced studies of core technical fields; or, opt for a broader professional perspective.\nPart of the requirements for MINE4710 Mine Management is completion of 60 days of industrial training and submission of a report on the work undertaken.",
        "level": "Honours",
        "url": "/Undergraduate/specialisations/2020/MINEAH",
        "name": "Mining Engineering",
        "faculty": "engineering",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7af",
        "programs": []
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "96",
        "code": "MINEC1",
        "description": "Please see the description for Program 3773 here\nFurther information on the program study plan can be found on the\nFaculty of Engineering Website.",
        "level": "Major",
        "url": "None",
        "name": "Mining Engineering",
        "faculty": "engineering",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7af",
        "programs": [
            3706
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "84",
        "code": "BIOCM1",
        "description": "Recent advances in Molecular Cellular Biology, especially the continuing development of recombinant DNA technology, have revolutionised our understanding of the structure, function and regulation of individual genes. These advances have opened up the exciting field of Molecular Biology, one of the most rapid growth areas in biology. This marriage of Biochemistry, Microbiology, and Cell Biology provides an exciting new approach for the study of all living organisms, including the human. Molecular Biology therefore represents fundamental components of biological and medical science and they will have increasingly important roles to play in many aspects of modern medicine, genetics, evolutionary biology, bioinformatics, biotechnology and genomics.",
        "level": "Major",
        "url": "/Undergraduate/specialisations/2020/BIOCM1",
        "name": "Molecular and Cell Biology",
        "faculty": "science",
        "faculty_code": "57a56ceb4f0093004aa6eb4f0310c7ae",
        "programs": [
            3925,
            3966,
            3970,
            3987
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "84",
        "code": "BIOCL1",
        "description": "Recent advances in Molecular Cellular Biology, especially the continuing development of recombinant DNA technology, have revolutionised our understanding of the structure, function and regulation of individual genes. These advances have opened up the exciting field of Molecular Biology, one of the most rapid growth areas in biology. This marriage of Biochemistry, Microbiology, and Cell Biology provides an exciting new approach for the study of all living organisms, including the human. Molecular Biology therefore represents fundamental components of biological and medical science and they will have increasingly important roles to play in many aspects of modern medicine, genetics, evolutionary biology, bioinformatics, biotechnology and genomics.",
        "level": "Major",
        "url": "/Undergraduate/specialisations/2020/BIOCL1",
        "name": "Molecular and Cell Biology",
        "faculty": "science",
        "faculty_code": "57a56ceb4f0093004aa6eb4f0310c7ae",
        "programs": [
            3962
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "18",
        "code": "MUSCE1",
        "description": "Music Creative Practice offers intensive pre-professional training in performance or composition in a self-selected musical style or tradition, including Jazz and World Music.\nThe stream is structured around three core courses. The gateway course, Music Performance Styles and Interpretation, develops specialised knowledge of a range of music styles including those derived from particular historical periods, genres and approaches to music interpretation. The course will help students to develop a stylistically informed performance with careful consideration of relevant technical and interpretative issues. Creative Projects in Performance and Composition is aimed at enhancing performance and presentation skills through collaborative projects between musicians, between musicians and composers, and between musicians and members of production teams. Music Analysis examines and applies a range of strategies for analyzing a broad range of music. Each strategy will begin with a problem: of technique, of experience, of description. Dedicated forums in the Performance Laboratory course provide a space for instructional learning in private and group situations, for observational and experiential learning in workshops and formal performance settings, and for experimental learning in environments that emphasize the development of creativity and individuality.\nMusic Creative Practice also enables students to develop excellence in a comprehensive range of ensemble practices, in other theoretical and critical subjects, in music from various styles, genres and cultures as preparation for professional work in music performance, arranging and composition, music teaching, practice-based research, broadcasting and recording, music journalism, and arts administration. Graduates may also pursue further qualifications in music education.\nThe Music Creative Practice Stream is one of four streams within the Bachelor of Music (UNSW BMus) four-year, full time degree.\nStudents wishing to enter this stream will be assessed for eligibility after the completion of MUSC1707 Performance Laboratory A  by a panel chosen by the Program Authority.\nA minimum grade of 80% in the practical examination of MUSC1707 Performance Laboratory A.The ensemble assessment, Performance Seminar and Performance Workshop grades from MUSC1707 Performance Laboratory A.",
        "level": "Major",
        "url": "/Undergraduate/specialisations/2020/MUSCE1",
        "name": "Music Creative Practice",
        "faculty": "arts and social sciences",
        "faculty_code": "d7a56ceb4f0093004aa6eb4f0310c7ac",
        "programs": [
            3436
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "18",
        "code": "MUSCJH",
        "description": "Music Creative Practice offers intensive pre-professional training in performance or composition in a self-selected musical style or tradition, including Jazz and World Music.\nThe stream is structured around three core courses. The gateway course, Music Performance Styles and Interpretation, develops specialised knowledge of a range of music styles including those derived from particular historical periods, genres and approaches to music interpretation. The course will help students to develop a stylistically informed performance with careful consideration of relevant technical and interpretative issues. Creative Projects in Performance and Composition is aimed at enhancing performance and presentation skills through collaborative projects between musicians, between musicians and composers, and between musicians and members of production teams. Music Analysis examines and applies a range of strategies for analyzing a broad range of music. Each strategy will begin with a problem: of technique, of experience, of description. Dedicated forums in the Performance Laboratory course provide a space for instructional learning in private and group situations, for observational and experiential learning in workshops and formal performance settings, and for experimental learning in environments that emphasize the development of creativity and individuality.\nMusic Creative Practice also enables students to develop excellence in a comprehensive range of ensemble practices, in other theoretical and critical subjects, in music from various styles, genres and cultures as preparation for professional work in music performance, arranging and composition, music teaching, practice-based research, broadcasting and recording, music journalism, and arts administration. Graduates may also pursue further qualifications in music education.\nThe Music Creative Practice Stream is one of four streams within the Bachelor of Music (UNSW BMus) four-year, full time degree.\nStudents wishing to enter this stream will be selected at the end of semester one in the second year of study in the single degree or third year of study in the dual degree by a panel chosen by the Program Authority. Selection will be based on the following criteria:\nA minimum grade of 80% in the practical examination of the Performance Laboratory 2 course.The ensemble assessment, Performance Seminar and Performance Workshop grades from the Performance Laboratory 2 course.The practical teacher's semester report grade.",
        "level": "Honours",
        "url": "/Undergraduate/specialisations/2020/MUSCJH",
        "name": "Music Creative Practice",
        "faculty": "arts and social sciences",
        "faculty_code": "d7a56ceb4f0093004aa6eb4f0310c7ac",
        "programs": [
            3440
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "18",
        "code": "MUSCLH",
        "description": "Music Pedagogy offers extensive pre-professional training in musicianship, musicology, ensemble performance, pedagogical methods, and educational and motivational psychology specifically for studio music teaching.\nThe stream is structured around three core courses. Music Studio Teaching, the gateway to the stream, focuses on instrumental and vocal teaching and learning in the private studio setting. Students will gain practical experience by teaching and presenting aspects of their specialist instrumental and vocal skills, with peer evaluation and support; they will also learn to appraise, evaluate and apply aspects of professional and research knowledge as they develop their individual approaches to practice. Becoming a Performer addresses the nature and acquisition of musical skills, supporting relatively advanced students to become more reflective and independent practitioners. Educating the Musical Novice is about learning to teach instrumental or vocal skills to beginners, with an emphasis on the research and theoretical knowledge related to children’s learning and music education.\nMusic Pedagogy also enables students to develop excellence in a comprehensive range of ensemble practices, in other theoretical and critical subjects, in music from various styles, genres and cultures as preparation for professional work in music studio teaching, performance, practice-based research, or further study in classroom music education.\nThe Music Pedagogy Stream is one of four streams within the Bachelor of Music (UNSW BMus) four-year, full time degree.",
        "level": "Honours",
        "url": "/Undergraduate/specialisations/2020/MUSCLH",
        "name": "Music Pedagogy",
        "faculty": "arts and social sciences",
        "faculty_code": "d7a56ceb4f0093004aa6eb4f0310c7ac",
        "programs": [
            3440
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "18",
        "code": "MUSCH1",
        "description": "Music Pedagogy offers extensive pre-professional training in musicianship, musicology, ensemble performance, pedagogical methods, and educational and motivational psychology specifically for studio music teaching.\nThe stream is structured around three core courses. Music Studio Teaching, the gateway to the stream, focuses on instrumental and vocal teaching and learning in the private studio setting. Students will gain practical experience by teaching and presenting aspects of their specialist instrumental and vocal skills, with peer evaluation and support; they will also learn to appraise, evaluate and apply aspects of professional and research knowledge as they develop their individual approaches to practice. Becoming a Performer addresses the nature and acquisition of musical skills, supporting relatively advanced students to become more reflective and independent practitioners. Educating the Musical Novice is about learning to teach instrumental or vocal skills to beginners, with an emphasis on the research and theoretical knowledge related to children’s learning and music education.\nMusic Pedagogy also enables students to develop excellence in a comprehensive range of ensemble practices, in other theoretical and critical subjects, in music from various styles, genres and cultures as preparation for professional work in music studio teaching, performance, practice-based research, or further study in classroom music education.\nThe Music Pedagogy Stream is one of four streams within the Bachelor of Music (UNSW BMus) four-year, full time degree.",
        "level": "Major",
        "url": "/Undergraduate/specialisations/2020/MUSCH1",
        "name": "Music Pedagogy",
        "faculty": "arts and social sciences",
        "faculty_code": "d7a56ceb4f0093004aa6eb4f0310c7ac",
        "programs": [
            3436
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "24",
        "code": "MUSCJ2",
        "description": "The Music Studies minor examines music as a manifestation of culture and society, as an intellectual product and as a specific reflection of experience.  Musicological methodologies are central to the disciplinary study of music. The minor in Music Studies enables you to develop your musicianship, musical skills and contextual understanding of music in preparation for professional work in music areas as diverse as broadcasting, recording, arts administration and advocacy, concert planning, and music and general arts journalism.",
        "level": "Minor",
        "url": "/Undergraduate/specialisations/2020/MUSCJ2",
        "name": "Music Studies",
        "faculty": "arts and social sciences",
        "faculty_code": "d7a56ceb4f0093004aa6eb4f0310c7ac",
        "programs": [
            3409,
            3429,
            3434,
            3438,
            3444,
            3453,
            3454
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "60",
        "code": "MUSCJ1",
        "description": "The major in Music Studies examines music as a manifestation of culture and society, as an intellectual product and as a specific reflection of experience. Musicological methodologies are central to the disciplinary study of music. Music Studies enables you to develop your musicianship, musical skills and contextual understanding of music in preparation for professional work in music areas as diverse as performance and composition, broadcasting, recording, arts administration and advocacy, concert planning, music and general arts journalism, and music teaching.",
        "level": "Major",
        "url": "/Undergraduate/specialisations/2020/MUSCJ1",
        "name": "Music Studies",
        "faculty": "arts and social sciences",
        "faculty_code": "d7a56ceb4f0093004aa6eb4f0310c7ac",
        "programs": [
            3409,
            3444
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "48",
        "code": "MUSCBH",
        "description": "The Honours stream in Music Studies requires the completion of 48 UOC (the equivalent of one year full-time study or two years part-time study).\nThe Honours stream involves seminars and the completion of a research project or thesis. It consists of 18 UOC of coursework and 30 UOC of thesis/practical project. The thesis/practical project is an undertaking of either an original piece of research extending throughout the year and the submission of a 15,000-word thesis based upon it or a research project, also year-long, involving a practical project and the submission of a written thesis of 7,000 - 10,000 words.",
        "level": "Honours",
        "url": "/Undergraduate/specialisations/2020/MUSCBH",
        "name": "Music Studies",
        "faculty": "arts and social sciences",
        "faculty_code": "d7a56ceb4f0093004aa6eb4f0310c7ac",
        "programs": [
            4504
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "60",
        "code": "MUSCK1",
        "description": "The Music Studies (Intensive) major examines music as a manifestation of culture and society, as an intellectual product and as a specific reflection of experience.  Musicological methodologies are central to the disciplinary study of music. Music Studies (Intensive) enables you to develop your musicianship, musical skills and contextual understanding of music in preparation for professional work in music areas as diverse as performance and composition, broadcasting, recording, arts administration and advocacy, concert planning, music and general arts journalism, and music teaching.",
        "level": "Major",
        "url": "/Undergraduate/specialisations/2020/MUSCK1",
        "name": "Music Studies (Intensive)",
        "faculty": "arts and social sciences",
        "faculty_code": "d7a56ceb4f0093004aa6eb4f0310c7ac",
        "programs": [
            3409,
            3444
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "18",
        "code": "MUSCNH",
        "description": "Musicology offers you intensive pre-professional training in historical musicology, ethnomusicology, the psychology of music, or performance studies in music.\nThe stream is structured around three core courses completed in Years 2-3. The course Investigating Music offers a gateway into the Stream by using a range of approaches, methods and theories to examine music: biographical study, manuscript study, primary source study, analysis, organology and iconography, criticism, aesthetics, hermeneutics, reception history, performance studies, transcription, music psychology and ethnography. MusiCultures examines the nature of music as “tradition”, investigating discourses, values and uses of music that endure or change at a different rate and in different ways from musical forms themselves. Music Analysis examines and applies a range of strategies for analyzing a broad range of music. Each strategy will begin with a problem: of technique, of experience, of description.\nMusicology also enables you to develop excellence in a comprehensive range of ensemble practices, in other theoretical and critical subjects, in music from various styles, genres and cultures as preparation for professional work in music performance, arranging and composition, music teaching, practice-based research, broadcasting and recording, music journalism, and arts administration. You may also pursue further qualifications in music education.\nThe Musicology Stream is one of four streams within the Bachelor of Music (UNSW BMus) four-year, full time degree.",
        "level": "Honours",
        "url": "None",
        "name": "Musicology",
        "faculty": "arts and social sciences",
        "faculty_code": "d7a56ceb4f0093004aa6eb4f0310c7ac",
        "programs": []
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "18",
        "code": "MUSCO1",
        "description": "Musicology offers you intensive pre-professional training in historical musicology, ethnomusicology, the psychology of music, or performance studies in music.\nThe stream is structured around three core courses. The course Investigating Music offers a gateway into the Stream by using a range of approaches, methods and theories to examine music: biographical study, manuscript study, primary source study, analysis, organology and iconography, criticism, aesthetics, hermeneutics, reception history, performance studies, transcription, music psychology and ethnography. MusiCultures examines the nature of music as “tradition”, investigating discourses, values and uses of music that endure or change at a different rate and in different ways from musical forms themselves. Music Analysis examines and applies a range of strategies for analyzing a broad range of music. Each strategy will begin with a problem: of technique, of experience, of description.\nMusicology also enables you to develop excellence in a comprehensive range of ensemble practices, in other theoretical and critical subjects, in music from various styles, genres and cultures as preparation for professional work in music performance, arranging and composition, music teaching, practice-based research, broadcasting and recording, music journalism, and arts administration. You may also pursue further qualifications in music education.\nThe Musicology Stream is one of four streams within the Bachelor of Music (UNSW BMus) four-year, full time degree.",
        "level": "Major",
        "url": "/Undergraduate/specialisations/2020/MUSCO1",
        "name": "Musicology",
        "faculty": "arts and social sciences",
        "faculty_code": "d7a56ceb4f0093004aa6eb4f0310c7ac",
        "programs": [
            3436
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "48",
        "code": "NEURBH",
        "description": "The Neuroscience Honours stream is run jointly by the School of Psychology and the School of Medical Sciences (SoMS). Neuroscience Honours facilitates interaction of the students with the broader neuroscience community at UNSW. The Neuroscience Honours stream is open to all students who majored in Neuroscience or who are eligible to enrol in Honours in the School of Psychology or School of Medical Science and have a background in disciplines allied to neuroscience (as evidenced, for example, by completion of NEUR courses).\nThe research project will be conducted under the supervision of an academic in SoMS or Psychology, or with a conjoint member of those schools from an Institute such as NeuRA or the Garvan. A list of available supervisors, their research areas, and the research skills that you would learn, are available on the Neuroscience Honours Supervisors page. You should speak with one or more supervisors before submitting your application form.\nThe Neuroscience Honours course is a research based full year research project with assessment by thesis (75%) and by a coursework component (25%). Students must enrol in two 6 UOC courses from NEUR441X and NEUR442X (current courses are NEUR4411 Behavioural Perspectives in Neuroscience and [[NEUR4421 Biomedical Perspectives in Neuroscience). The research project occupies the other 36 UOC, which students take by enrolling in a combination of NEUR444X Neuroscience Research courses that add up to 36 UOC.",
        "level": "Honours",
        "url": "/Undergraduate/specialisations/2020/NEURBH",
        "name": "Neuroscience",
        "faculty": "medicine",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7b0",
        "programs": [
            3962,
            4500
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "None",
        "code": "ZPEMO1",
        "description": "Viewed from space, the Earthis a blue planet with over 70% of its surface covered by water. Because of this, the oceans exert a major influence on the Earth's climate and shipping operations. The three-year major program covers key principles of oceanography and the related issues of meteorology and climate. It offers a comprehensive account of physical oceanography, including components that cover waves, currents, sonar, and remote sensing, and employs mathematical arguments to describe the physical phenomena that take place within the world's oceans. It provides all future ADF officers with a sound understanding of the influence of oceans and weather. Double Majors of Oceanography with either Physics or Mathematics cover the requirements for a position at RAN's METOC (Meteorology and Oceanography) office.",
        "level": "Major",
        "url": "/Undergraduate/specialisations/2020/ZPEMO1",
        "name": "Oceanography",
        "faculty": "unsw canberra at adfa",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7ad",
        "programs": []
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "48",
        "code": "ZPEMOH",
        "description": "The Oceanography Honours stream introduces undergraduate students to oceanography and related issues of meteorology and climate research. Students undertake a supervised research project that places emphasis on scientific research methods, the use of relevant specialised techniques, critical thinking and scientific communication via written submissions and oral presentations. The learning and teaching philosophy underpinning this course is centred on Honours students taking on their 'role as a researcher' to develop these skills and the relevant advanced disciplinary knowledge. \n\nStudent research projects relate to multiple fields of oceanography and closely related research interests of staff.\n\nThe Oceanography Honours stream involves undertaking a research project that, although conducted under supervision, contains substantial independent research and self-direction. The research project is described in a thesis that forms a major part of the assessment. The research project is complemented by introductory written and oral background presentations and oral presentation of the research project. There are also relevant advanced level courses that students must undertake.",
        "level": "Honours",
        "url": "/Undergraduate/specialisations/2020/ZPEMOH",
        "name": "Oceanography",
        "faculty": "unsw canberra at adfa",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7ad",
        "programs": []
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "48",
        "code": "ARCYBH",
        "description": "The School of Biological, Earth and Environmental Sciences (BEES) offers a number of Honours streams including Palaeoscience. Honours in Palaeoscience introduces undergraduate students to research and project work of relevance to various endeavours in the physical environmental sciences including archaeology, evolutionary anthropology, palaeoclimate, palaeoecology, palaeontology and past human environmental interactions and hazards. Students undertake a supervised research project that places emphasis on scientific research methods, the use of relevant specialised techniques, critical thinking and scientific communication via written submissions and oral presentations. The learning and teaching philosophy underpinning this program is centred on Honours students taking on their role as a researcher to develop these skills and the relevant advanced disciplinary knowledge with some degree of independence. The program, run over three sessions, includes a Research Proposal (which may include an extended literature review and a risk management component) and a substantial independent Research Project under the close supervision of academics within the School of BEES. These components are complemented by more formal seminars and workshops, focusing on graduate attributes (scientific communication, risk management, ethics and professional development) as well as School (and Institute/Centre) seminars.",
        "level": "Honours",
        "url": "/Undergraduate/specialisations/2020/ARCYBH",
        "name": "Palaeoscience",
        "faculty": "science",
        "faculty_code": "57a56ceb4f0093004aa6eb4f0310c7ae",
        "programs": [
            3962,
            4500
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "36",
        "code": "ARCYB2",
        "description": "The Palaeosciences minor places emphasis on the courses convened by members of the Palaeontology, Geobiology and Earth Archives (PANGEA) Research Centre in the School of BEES. The Minor particularly considers the inter-connections between the evolution of the Earth's physical, climatic and biotic systems. This minor also provides you with the tools and knowledge to explore two unifying themes - evolution (physical and cultural) and the interaction between humans and their natural environment using long temporal perspectives.",
        "level": "Minor",
        "url": "/Undergraduate/specialisations/2020/ARCYB2",
        "name": "Palaeosciences",
        "faculty": "science",
        "faculty_code": "57a56ceb4f0093004aa6eb4f0310c7ae",
        "programs": [
            3962,
            3970
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "48",
        "code": "SOMSDH",
        "description": "The Pathology Honours stream introduces undergraduate students to medical research. Students undertake a supervised research project that places emphasis on scientific research methods, the use of relevant specialised techniques, critical thinking and scientific communication via written submissions and oral presentations. The research project may be undertaken in a wide range of laboratories within the School of Medical Sciences (SoMS), affiliated Hospitals and Research Institutes/Centres or other Schools within the Faculty of Medicine.",
        "level": "Honours",
        "url": "/Undergraduate/specialisations/2020/SOMSDH",
        "name": "Pathology",
        "faculty": "medicine",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7b0",
        "programs": [
            3962,
            4500
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "168",
        "code": "PETRAH",
        "description": "Petroleum Engineering is a specialised engineering discipline which prepares graduates for careers in the oil and gas industries. Its related operations apply physical, mathematical and engineering principles to identify and solve problems associated with exploration, exploitation, drilling, production and all the related economic and management problems associated with the recovery of hydrocarbons and alternative sources of energy from deep beneath the earth's surface.",
        "level": "Honours",
        "url": "/Undergraduate/specialisations/2020/PETRAH",
        "name": "Petroleum Engineering",
        "faculty": "engineering",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7af",
        "programs": [
            3707
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "96",
        "code": "PETRB1",
        "description": "Please see the description for Program 3773 here\nFurther information on the program study plan can be found on the\nFaculty of Engineering Website",
        "level": "Major",
        "url": "/Undergraduate/specialisations/2020/PETRB1",
        "name": "Petroleum Engineering",
        "faculty": "engineering",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7af",
        "programs": [
            3706
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "48",
        "code": "SOMSCH",
        "description": "The Pharmacology Honours stream introduces undergraduate students to medical research. Students undertake a supervised research project that places emphasis on scientific research methods, the use of relevant specialised techniques, critical thinking and scientific communication via written submissions and oral presentations. The research project may be undertaken in a wide range of laboratories within the School of Medical Sciences (SoMS), affiliated Hospitals and Research Institutes/Centres or other Schools within the Faculty of Medicine.",
        "level": "Honours",
        "url": "/Undergraduate/specialisations/2020/SOMSCH",
        "name": "Pharmacology",
        "faculty": "medicine",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7b0",
        "programs": [
            3962,
            4500
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "48",
        "code": "ZPEMGH",
        "description": "The Physical Geography Honours stream introduces undergraduate students to physical geography research. Students undertake a supervised research project that places emphasis on scientific research methods, the use of relevant specialised techniques, critical thinking and scientific communication via written submissions and oral presentations. The learning and teaching philosophy underpinning this course is centred on Honours students taking on their 'role as a researcher' to develop these skills and the relevant advanced disciplinary knowledge. \n\nStudent research projects relate to multiple fields of physical geography and closely related research interests of staff.\n\nThe Physical Geography Honours stream involves undertaking a research project that, although conducted under supervision, contains substantial independent research and self-direction. The research project is described in a thesis that forms a major part of the assessment. The research project is complemented by introductory written and oral background presentations and oral presentation of the research project. There are also relevant advanced level courses that students must undertake.",
        "level": "Honours",
        "url": "/Undergraduate/specialisations/2020/ZPEMGH",
        "name": "Physical Geography",
        "faculty": "unsw canberra at adfa",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7ad",
        "programs": [
            4513
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "48",
        "code": "ZPEMPH",
        "description": "The Physics Honours stream introduces undergraduate students to physics research. Students undertake a supervised research project that places emphasis on scientific research methods, the use of relevant specialised techniques, critical thinking and scientific communication via written submissions and oral presentations. The learning and teaching philosophy underpinning this course is centred on Honours students taking on their ‘role as a researcher’ to develop these skills and the relevant advanced disciplinary knowledge. \n\nStudent research projects relate to multiple fields of physics and closely related research interests of staff.\n\nThe Physics Honours stream involves undertaking a research project that, although conducted under supervision, contains substantial independent research and self-direction. The research project is described in a thesis that forms a major part of the assessment. The research project is complemented by introductory written and oral background presentations and oral presentation of the research project. There are also relevant advanced level courses that students must undertake.",
        "level": "Honours",
        "url": "/Undergraduate/specialisations/2020/ZPEMPH",
        "name": "Physics",
        "faculty": "unsw canberra at adfa",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7ad",
        "programs": [
            4513
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "48",
        "code": "SOMSBH",
        "description": "The Physiology Honours stream introduces undergraduate students to medical research. Students undertake a supervised research project that places emphasis on scientific research methods, the use of relevant specialised techniques, critical thinking and scientific communication via written submissions and oral presentations. The research project may be undertaken in a wide range of laboratories within the School of Medical Sciences (SoMS), affiliated Hospitals and Research Institutes/Centres or other Schools within the Faculty of Medicine.",
        "level": "Honours",
        "url": "/Undergraduate/specialisations/2020/SOMSBH",
        "name": "Physiology",
        "faculty": "medicine",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7b0",
        "programs": [
            3962,
            4500
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "60",
        "code": "POLSG1",
        "description": "The study of Politics and International Relations focuses on the workings of government and global politics, and will help you understand the most pressing challenges facing the world today, including political instability and conflict, security, great-power rivalry, climate change, development, human rights, governance and inequality. The solutions to many national and global problems are often intricately connected with regional and global processes, structures, mechanisms, forces, interests, customs and institutions. Knowing how to identify these solutions, their context and histories, is often challenging, frequently rewarding, and always interesting. A major stream in Politics and International Relations will give you insight into the complex relationships between state and non-state actors, individuals and organisations in national and international contexts, and you will learn how to think critically about the nature of power in contemporary and historical perspective.",
        "level": "Major",
        "url": "/Undergraduate/specialisations/2020/POLSG1",
        "name": "Politics and International Relations",
        "faculty": "arts and social sciences",
        "faculty_code": "d7a56ceb4f0093004aa6eb4f0310c7ac",
        "programs": [
            3409,
            3420,
            3444,
            3478,
            3558
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "24",
        "code": "POLSG2",
        "description": "The study of Politics and International Relations focuses on the workings of government and global politics, and will help you understand the most pressing challenges facing the world today,including political instability and conflict, security, great-power rivalry, climate change,development, human rights, governance and inequality. The solutions to many national and global problems are often intricately connected with regional and global processes, structures,mechanisms, forces, interests, customs and institutions. Knowing how to identify these solutions,their context and histories, is often challenging, frequently rewarding, and always interesting. A major stream in Politics and International Relations will give you insight into the complex relationships between state and non-state actors, individuals and organisations in national and international contexts, and you will learn how to think critically about the nature of power in contemporary and historical perspective.",
        "level": "Minor",
        "url": "/Undergraduate/specialisations/2020/POLSG2",
        "name": "Politics and International Relations",
        "faculty": "arts and social sciences",
        "faculty_code": "d7a56ceb4f0093004aa6eb4f0310c7ac",
        "programs": [
            3409,
            3429,
            3434,
            3438,
            3444,
            3447,
            3453,
            3454,
            3558
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "48",
        "code": "POLSGH",
        "description": "The Honours program in Politics and International Relations requires the completion of 48 UOC (the equivalent of one year full-time study or two years part-time study).\nThe Honours program involves seminars and the completion of a research project or thesis. It consists of 18 UOC of coursework and 30 UOC of thesis/project. The thesis/research project should not exceed 20,000 words in length.",
        "level": "Honours",
        "url": "/Undergraduate/specialisations/2020/POLSGH",
        "name": "Politics and International Relations",
        "faculty": "arts and social sciences",
        "faculty_code": "d7a56ceb4f0093004aa6eb4f0310c7ac",
        "programs": [
            4504
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "66",
        "code": "MATHE1",
        "description": "Quantitative Data Science is the study of methods for organising, modelling and analysing large and complex data relevant for businesses, governments or other organisations. The information gleaned from the data analysis is intended to improve business decisions and inform policies.\n\nThe program provides a strong technical background in mathematics, statistics, computer science and economics. The Quantitative Data Science major enables a student to specialise further in mathematical and statistical methods to interpret, understand and predict data. \n\nThe program and this major open a pathway to exciting careers in data science and data analytics.",
        "level": "Major",
        "url": "/Undergraduate/specialisations/2020/MATHE1",
        "name": "Quantitative Data Science",
        "faculty": "science",
        "faculty_code": "57a56ceb4f0093004aa6eb4f0310c7ae",
        "programs": [
            3586,
            3587,
            3959
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "48",
        "code": "BLDGBH",
        "description": "BLDGBH: Quantity Surveying\n\nStudents must take 48 UOC to complete this Stream Major.",
        "level": "Honours",
        "url": "/Undergraduate/specialisations/2020/BLDGBH",
        "name": "Quantity Surveying",
        "faculty": "built environment",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7ae",
        "programs": [
            4522
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "168",
        "code": "ELECCH",
        "description": "The progress of nanotechnology allows the fabrication of devices whose physical dimensions approach the atomic scale. For over 100 years, it has been known that the behaviour of physical systems at the atomic scale does not obey the familiar laws of classical physics. Atomic-size systems behave according to quantum mechanics, which allows them to exhibit rather spectacular properties and dynamics. This stream trains students to design and operate devices that behave according to quantum mechanics, opening the possibility to exploit the peculiar laws of quantum physics to perform otherwise cumbersome or impossible tasks, such as the efficient solution of computationally hard problems, or the secure teleportation of information. Graduates from this stream will have valuable skills that position them ideally for the burgeoning quantum engineering industry, as well as broad skills across most key electrical engineering disciplines.",
        "level": "Honours",
        "url": "/Undergraduate/specialisations/2020/ELECCH",
        "name": "Quantum Engineering",
        "faculty": "engineering",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7af",
        "programs": [
            3707
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "30",
        "code": "COMMF2",
        "description": "The real estate sector represents a substantial share of the capital assets and savings of businesses and households in the economy. All businesses involved in building and managing these assets require graduates with high level of skills in understanding the economic and financial factors and policies which influence real estate markets and an understanding of the operation of the finance and capital markets which are integral to the sector. Governments at all levels are also heavily involved in the real estate market, both as investors in its own right but also in terms of public policy. Graduate positions exist in public policy, industry research, investment management, in the finance and credit departments of banks and large corporations and in the financial sector in general.\nReal Estate Studies is offered as an undergraduate minor by the UNSW Business School for students enrolled in commerce or economics degrees. The minor is designed for students who would like to work in real estate investment management or research, in public policy, or more generally in the financial or corporate sectors. It aims to develop specialist economic/finance knowledge in the area of real estate and particularly complements studies in accounting, finance, financial economics, and economics.",
        "level": "Minor",
        "url": "/Undergraduate/specialisations/2020/COMMF2",
        "name": "Real Estate Studies",
        "faculty": "unsw business school",
        "faculty_code": "5a3a1d4f4f4d97404aa6eb4f0310c77a",
        "programs": [
            3502,
            3543,
            3558
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "48",
        "code": "COMMF1",
        "description": "The real estate sector represents a substantial share of the capital assets and savings of businesses and households in the economy. All businesses involved in building and managing these assets require graduates with high level of skills in understanding the economic and financial factors and policies which influence real estate markets and an understanding of the operation of the finance and capital markets which are integral to the sector. Governments at all levels are also heavily involved in the real estate market, both as investors in its own right but also in terms of public policy. Graduate positions exist in public policy, industry research, investment management, in the finance and credit departments of banks and large corporations and in the financial sector in general.\n\nReal Estate Studies is offered as an undergraduate major by the UNSW Business School for students enrolled in commerce or economics degrees. The major is designed for students who would like to work in real estate investment management or research, in public policy, or more generally in the financial or corporate sectors. It aims to develop specialist economic/finance knowledge in the area of real estate and particularly complements studies in accounting, finance, financial economics, and economics.",
        "level": "Major",
        "url": "/Undergraduate/specialisations/2020/COMMF1",
        "name": "Real Estate Studies",
        "faculty": "unsw business school",
        "faculty_code": "5a3a1d4f4f4d97404aa6eb4f0310c77a",
        "programs": [
            3502,
            3543,
            3543,
            3554,
            3554,
            3558,
            3558,
            3586,
            3586
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "168",
        "code": "SOLABH",
        "description": "This stream in Renewable Energy Engineering encompasses a wider range of renewable energy technologies and their use. These include heat and electricity generation from solar thermal systems, photovoltaics, wind turbines, biomass and the important areas of solar architecture and the design of energy efficient buildings and appliances.\n\nRenewable Energy Engineering is also available as a component of the dual degree programs.",
        "level": "Honours",
        "url": "/Undergraduate/specialisations/2020/SOLABH",
        "name": "Renewable Energy Engineering",
        "faculty": "engineering",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7af",
        "programs": [
            3707
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "24",
        "code": "REGZB1",
        "description": "REGZB1 is the 24 UoC Science stream within 6114 University Preparation Program (UPP).\n\nThe UPP Science stream is designed to provide access to study in areas of Science at university level upon successful completion of the program. \n\nUPP Science students may apply to transfer to the UPP Humanities stream at the end of Semester 1 if they have successfully completed REGZ9000.",
        "level": "Major",
        "url": "/Undergraduate/specialisations/2020/REGZB1",
        "name": "Science (UPP)",
        "faculty": "dvcacademicboardofstudies",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7b3",
        "programs": [
            6114
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "168",
        "code": "SENGAH",
        "description": "Software Engineering is an Engineering profession concerned with the processes, methods, and tools for the design and development of high quality, reliable software systems. This involves the study and application of software specification, design, implementation, testing, and documentation of software. Target systems may range from simple software applications to mission-critical real-time systems.\nSoftware Engineering is studied as a stream in the BE(Hons). Day to day administration of this stream is conducted through the Computer Science and Engineering Student Office.\nThis page outlines the core rules for the Software Engineering stream when taken as part of a single or dual award. The requirements total 168 units of credit, plus 60 days of industrial training. Refer to the program page for full details on the overall program requirements.\nFurther details on the stream requirements, electives, and advice regarding the order and placement of courses in the stream can be found at the: School website",
        "level": "Honours",
        "url": "/Undergraduate/specialisations/2020/SENGAH",
        "name": "Software Engineering",
        "faculty": "engineering",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7af",
        "programs": [
            3707,
            3768
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "18",
        "code": "MUSCMH",
        "description": "With a focus on creative applications of technology, the Sonic Arts Stream develops foundational technical, aesthetic, and theoretical skills in Sound.\nThe stream is structured around three core courses. In Creative Sound Technologies technical skills in audio recording, processing and post-production techniques are addressed through practical applications using the Digital Audio Workstation. Students work on simulations of real-world tasks, creating or manipulating the sonic assets for projects such as foley and soundtrack for moving image. In Audio Culture, students evaluate the aesthetics, history and culture of Sound as a broad discipline of inquiry. Synergies in Sound and Technology enables advanced creative applications of technology through project-based learning, with a focus on electronic/electro-acoustic composition. This is interleaved with a study of acoustics, digital signal manipulation, and more.\nAt all levels, students work with state-of-the-art facilities and equipment, and professional, industry-standard software.\nSonic Arts provides an understanding of sound and technology which is applicable to many modes of music-making practice. The Sonic Arts Stream embraces and encourages cross-disciplinary collaboration. It prepares students for advanced applications in a range of media and genres such as sound installations, radio, film, sound art, and electronic composition. For performers and composers, Sonic Arts offers tools with which to express creative ideas. For educators, a broad knowledge of sound technology enables an array of applications and possibilities.\nSonic Arts students will have the opportunity to participate in Sound Lab Group, a dynamic music-technology ensemble. Sonic Arts connects closely with the Bachelor of Media (Screen and Sound Production).\nThe Sonic Arts Stream is one of four streams within the Bachelor of Music (UNSW BMus) four-year, full time degree.",
        "level": "Honours",
        "url": "/Undergraduate/specialisations/2020/MUSCMH",
        "name": "Sonic Arts",
        "faculty": "arts and social sciences",
        "faculty_code": "d7a56ceb4f0093004aa6eb4f0310c7ac",
        "programs": [
            3440
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "18",
        "code": "MUSCG1",
        "description": "With a focus on creative applications of technology, the Sonic Arts Stream develops foundational technical, aesthetic, and theoretical skills in Sound.\nThe stream is structured around three core courses. In Creative Sound Technologies technical skills in audio recording, processing and post-production techniques are addressed through practical applications using the Digital Audio Workstation. Students work on simulations of real-world tasks, creating or manipulating the sonic assets for projects such as foley and soundtrack for moving image. In Audio Culture, students evaluate the aesthetics, history and culture of Sound as a broad discipline of inquiry. Synergies in Sound and Technology enables advanced creative applications of technology through project-based learning, with a focus on electronic/electro-acoustic composition. This is interleaved with a study of acoustics, digital signal manipulation, and more.\nAt all levels, students work with state-of-the-art facilities and equipment, and professional, industry-standard software.\nSonic Arts provides an understanding of sound and technology which is applicable to many modes of music-making practice. The Sonic Arts Stream embraces and encourages cross-disciplinary collaboration. It prepares students for advanced applications in a range of media and genres such as sound installations, radio, film, sound art, and electronic composition. For performers and composers, Sonic Arts offers tools with which to express creative ideas. For educators, a broad knowledge of sound technology enables an array of applications and possibilities.\nSonic Arts students will have the opportunity to participate in Sound Lab Group, a dynamic music-technology ensemble.\nSonic Arts connects closely with the Bachelor of Media (Screen and Sound Production).\nThe Sonic Arts Stream is one of four streams within the Bachelor of Music (UNSW BMus) four-year, full time degree.",
        "level": "Major",
        "url": "/Undergraduate/specialisations/2020/MUSCG1",
        "name": "Sonic Arts",
        "faculty": "arts and social sciences",
        "faculty_code": "d7a56ceb4f0093004aa6eb4f0310c7ac",
        "programs": [
            3436
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "60",
        "code": "DARTB1",
        "description": "The Studio Practice major allows students to explore and experiment with a range of creative approaches as they develop in-depth skills and knowledge in studio-based artistic practice. Through a combination of core Studio Art Practice courses and selected discipline-based pathways, students are supported to develop their independent artistic practice. With professional practice and research skills embedded throughout, the Studio Practice major also prepares students to thrive in a range of creative, professional, and scholarly contexts.",
        "level": "Major",
        "url": "/Undergraduate/specialisations/2020/DARTB1",
        "name": "Studio Practice",
        "faculty": "art design",
        "faculty_code": "57a56ceb4f0093004aa6eb4f0310c7af",
        "programs": [
            4821
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "168",
        "code": "GMATDH",
        "description": "The Surveying stream is full time and extends over four years. This stream aims to prepare a graduate for a broad range of career opportunities in the various branches of Surveying and the numerous Spatial Information disciplines. To this end the stream covers general scientific and IT principles, as well as specialised Surveying and Spatial Information topics. Specialisation is provided for through the provision of elective courses offered in the third and fourth years of the program and the choice of a targeted final year thesis project often aligned with an external industry partner. \n\nThe degree of BE in Surveying is recognised by the Board of Surveying and Spatial Information of New South Wales as meeting the requirements for entry as a candidate to become a Registered Surveyor. The degree is also recognised by the Institution of Surveyors, New South Wales, the Spatial Sciences Institute and Engineers Australia, for admission as corporate members.\n\nSuggestions for course sequences consistent with timetabling and availability can be found on the School website The timing of the general education courses and elective courses may be modified to optimize the student's choice of courses. While some courses are given twice a year, many courses are given only once a year. In addition, courses may have prerequisites and exclusions. Thus students should plan their enrolments appropriately.\n\nThe day to day administration of the stream is conducted through the School of Civil & Environmental Engineering, to which inquiries should be directed.",
        "level": "Honours",
        "url": "/Undergraduate/specialisations/2020/GMATDH",
        "name": "Surveying",
        "faculty": "engineering",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7af",
        "programs": [
            3707
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "30",
        "code": "TABLC2",
        "description": "A minor in Taxation consists of 30 UOC (5 courses) containing at least 18 UOC at level 2 or 3. The minor does not form part of the nominated major. Compulsory coursesTABL1710 Business and the Law TABL2751 Business TaxationElective courses18 UOC (3 courses) to be completed from this listTABL2741 Business Entities TABL2756 International Business Tax.\nTABL3016 Critical Perspectives and Ethics TABL3752 Capital Gains Tax TABL3755 Taxation of Business Entities TABL3757 Corporate Tax Strategy TABL4722 Special Topic in Taxation",
        "level": "Minor",
        "url": "/Undergraduate/specialisations/2020/TABLC2",
        "name": "Taxation",
        "faculty": "unsw business school",
        "faculty_code": "5a3a1d4f4f4d97404aa6eb4f0310c77a",
        "programs": [
            3554
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "48",
        "code": "TABLC1",
        "description": "NOTE: For Commerce/Law students. Courses listed in the Taxation Major of the BCom (other than TABL1710 and TABL2741) may be counted to the Commerce component of the degree. No other TABL courses may be counted to the degree.\n\nTaxation funds the provision of government services, is a tool in economic management and is an important consideration in all business decisions. Indeed in a modern business environment no decision can be responsibly made without consideration being given to tax implications.\n\nTaxation affects every aspect of commercial life from the choice of business vehicle, to the financing of business operations, to the offshore expansion of a business, to the retirement plans for employees.\n\nManagers, accountants, auditors, financial officers and those working in banking, insurance, international business and government policy development and commerce generally require knowledge of business taxation. Tax consultants assist clients in structuring business transactions in tax effective ways. Tax consultants are highly sought after and are involved in creative, challenging and rewarding work.",
        "level": "Major",
        "url": "/Undergraduate/specialisations/2020/TABLC1",
        "name": "Taxation",
        "faculty": "unsw business school",
        "faculty_code": "5a3a1d4f4f4d97404aa6eb4f0310c77a",
        "programs": [
            3502,
            3543,
            3554,
            3558,
            3586,
            3587
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "48",
        "code": "TABLAH",
        "description": "The Honours year will provide students with an opportunity to learn the necessary skills to tackle the taxation issues and challenges that they will encounter throughout their careers. These skills include analytical skills in problem solving (identification of problems, mapping out solutions and executing them) and taxation (both practical and academic) research skills.\nTo satisfy the Honours requirements, students undertake an additional year of study, completing Honours level courses (both compulsory and elective) and undertaking a research thesis. Students must have completed the prerequisite courses prior to their Honours year.\nThis stream is only offered on a full-time basis each year.",
        "level": "Honours",
        "url": "/Undergraduate/specialisations/2020/TABLAH",
        "name": "Taxation",
        "faculty": "unsw business school",
        "faculty_code": "5a3a1d4f4f4d97404aa6eb4f0310c77a",
        "programs": [
            4501
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "168",
        "code": "TELEAH",
        "description": "Telecommunications engineering is the most rapidly developing and dynamic field of Engineering. The School's undergraduate BE (Hons) program in Telecommunications continue to act as a model for educating engineers in tomorrow's technology. Options within Telecommunications include: Photonics, Systems and Control, Energy Systems, Microelectronics and Signal Processing. The Degree programs are accredited by Engineers Australia as meeting the requirements for admission to graduate membership.\n\nThe undergraduate curricula are being progressively revised to provide flexible training to suit the future needs of students. Individual student needs can be further met by substitution provisions within the programs.\n\nThe Telecommunications stream consists of 168 UOC as described below. The stream structure outlined below gives one sequence of courses that fulfils the requirements of the degree. The timing of the general education courses and elective courses may be modified to optimize the student's choice of courses. While some courses are given twice a year, many courses are given only once a year. In addition, courses may have prerequisites and exclusions. Students are strongly encouraged to consult the Electrical Engineering School website for the recommended program structure and for advice on course selection sequences that are consistent with timetabling and availability.",
        "level": "Honours",
        "url": "/Undergraduate/specialisations/2020/TELEAH",
        "name": "Telecommunications",
        "faculty": "engineering",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7af",
        "programs": [
            3707,
            3768
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "24",
        "code": "THSTC2",
        "description": "THIS STREAM IS FOR STUDENTS COMMENCING FROM 2016.\nThe Theatre and Performance Studies minor stream will enable you to engage with a range of performance modes and to experience a combination of both practice-based and concept-driven learning. As a Theatre and Performance Studies student you will be introduced to the skills required to analyse, interpret or work with a variety of performance forms. The stream's contemporary focus explores experimental live arts, multimedia and dance practices. Its historical orientation focuses on essential skills in playtext and genre analysis as well as on national theatre traditions and canon formation. Offerings in creative practice focus on skills development and include opportunities to study interdisciplinary collaboration, professional production, script-writing and solo performance. The stream also offers internships and arts reviewing courses which emphasise links to Sydney-based production companies, venues and publishing networks.",
        "level": "Minor",
        "url": "/Undergraduate/specialisations/2020/THSTC2",
        "name": "Theatre and Performance Studies",
        "faculty": "arts and social sciences",
        "faculty_code": "d7a56ceb4f0093004aa6eb4f0310c7ac",
        "programs": [
            3409,
            3429,
            3434,
            3438,
            3444,
            3453,
            3454
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "60",
        "code": "THSTC1",
        "description": "THIS STREAM IS FOR STUDENTS COMMENCING FROM 2016.\nThe Theatre and Performance Studies major stream will enable you to engage with a wide range of performance modes - theatrical and cultural, European and Australasian, contemporary and historical, text and non-text based, low and high culture - and to experience a combination of both practice-based and concept-driven learning. As a Theatre and Performance Studies student you will be equipped with the skills to analyse, interpret or work with a variety of performance forms as well as have the opportunity to follow a chosen area of specialisation within the major. The stream's contemporary focus explores experimental live arts, multimedia and dance practices as well as their political and social attributes within a global context. Its historical orientation will ground you with essential skills in playtext and genre analysis as well as with perspectives on national theatre traditions and canon formation. The major's offerings in creative practice will develop the skills you need to become a theatre practitioner and include courses in interdisciplinary collaboration, professional production, script-writing and solo performance. The stream's professionalising pathway offers internships and arts reviewing courses which emphasise links to Sydney-based production companies, venues and publishing networks. Our major stream is designed to critically and creatively engage you in the social, ethical and practical state of the contemporary performing arts from a range of historical and cultural perspectives.",
        "level": "Major",
        "url": "/Undergraduate/specialisations/2020/THSTC1",
        "name": "Theatre and Performance Studies",
        "faculty": "arts and social sciences",
        "faculty_code": "d7a56ceb4f0093004aa6eb4f0310c7ac",
        "programs": [
            3409,
            3444
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "36",
        "code": "THSTB2",
        "description": "THIS STREAM IS FOR STUDENTS COMMENCING FROM 2016.\nThe Theatre and Performance Studies extended minor stream will enable you to engage with a range of performance modes - theatrical and cultural, European and Australasian, contemporary and historical, text and non-text based, low and high culture - and to experience a combination of both practice-based and concept-driven learning. As a Theatre and Performance Studies student you will be equipped with the skills to analyse, interpret or work with a variety of performance forms. The extended minor stream's contemporary focus explores experimental arts practices. Its historical orientation focuses on skills in playtext and genre analysis as well as on national theatre traditions and canon formation. Offerings in creative practice focus on skills development and include opportunities to study interdisciplinary collaboration, professional production, script-writing and solo performance. The stream also offers internships and arts reviewing courses which emphasise links to Sydney-based production companies, venues and publishing networks.",
        "level": "Minor",
        "url": "/Undergraduate/specialisations/2020/THSTB2",
        "name": "Theatre and Performance Studies (Extended)",
        "faculty": "arts and social sciences",
        "faculty_code": "d7a56ceb4f0093004aa6eb4f0310c7ac",
        "programs": [
            3409
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "36",
        "code": "REGZG1",
        "description": "The UNSW Preparation Program 17-19 Business stream is designed as a pathway for students with potential and an interest in tertiary education who have suffered educational and/or social disadvantage and/or do not possess the required assumed knowledge to gain entry into their preferred program in the UNSW Business School. It provides an opportunity for students with a selection rank* that is 50 or above, who do not meet the entry requirements of their preferred program at UNSW, and who meet the admission criteria listed earlier. The stream includes preparatory courses in Mathematics, academic skills, and introductory courses in Marketing and Management.\n*A selection rank is an ATAR or equivalent that includes any bonus points.\nStudents who enrol in the Business stream will have the opportunity to:\nstrengthen their academic literacy and communication skills;develop their critical and analytical thinking;develop their mathematical skills;complete introductory courses in their chosen field andadjust to University study within a strong support structure",
        "level": "Major",
        "url": "/Undergraduate/specialisations/2020/REGZG1",
        "name": "UNSW Prep Prog 17-19 Business",
        "faculty": "dvcacademicboardofstudies",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7b3",
        "programs": [
            6115
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "36",
        "code": "REGZD1",
        "description": "The UNSW Preparation program 17-19 Arts stream is designed to provide a pathway to study in the Humanities and Social Sciences at UNSW Australia for students aged 17-19 with potential and an interest in tertiary education but who have suffered educational and/or social disadvantage and/or do not possess the required assumed knowledge to gain entry into their preferred program. It provides an opportunity for students with a selection rank* that is 50 or above, who do not meet the entry requirements of their preferred program at UNSW, and who meet the admission criteria listed earlier.\n*A selection rank is an ATAR or equivalent that includes any bonus points.\nStudents who enrol in the Arts stream will have the opportunity to:\nstrengthen their academic literacy and communication skills;develop their critical and analytical thinking;complete introductory courses in their chosen field andadjust to University study within a strong support structure",
        "level": "Major",
        "url": "/Undergraduate/specialisations/2020/REGZD1",
        "name": "UNSW Prep Program 17-19 Arts",
        "faculty": "dvcacademicboardofstudies",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7b3",
        "programs": [
            6115
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "36",
        "code": "REGZF1",
        "description": "The UNSW Preparation Program 17-19 Engineering stream is designed as a pathway for students with potential and an interest in tertiary education who have suffered educational and/or social disadvantage and/or do not possess the required assumed knowledge to gain entry into their preferred program in UNSW Engineering. It provides an opportunity for students with a selection rank* that is 50 or above, who do not meet the entry requirements of their preferred program at UNSW, and who meet the admission criteria listed earlier.\n*A selection rank is an ATAR or equivalent that includes any bonus points.\nStudents who enrol in the Engineering stream will have the opportunity to:\nstrengthen their academic literacy and communication skills;develop their critical and analytical thinking;develop their mathematical skillscomplete introductory courses in their chosen field andadjust to University study within a strong support structure",
        "level": "Major",
        "url": "/Undergraduate/specialisations/2020/REGZF1",
        "name": "UNSW Prep Program 17-19 Eng",
        "faculty": "dvcacademicboardofstudies",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7b3",
        "programs": [
            6115
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "36",
        "code": "REGZE1",
        "description": "The UNSW Preparation Program 17-19 Science stream is designed as a pathway for students with potential and an interest in tertiary education who have suffered educational and/or social disadvantage and/or do not possess the required assumed knowledge to gain entry into their preferred program in UNSW Science. It provides an opportunity for students with a selection rank* that is 50 or above, who do not meet the entry requirements of their preferred program at UNSW, and who meet the admission criteria listed earlier.\n*A selection rank is an ATAR or equivalent that includes any bonus points.\nStudents who enrol in the Science stream will have the opportunity to:\nstrengthen their academic literacy and communication skills;develop their critical and analytical thinking;develop their mathematical skills if appropriatecomplete introductory courses in their chosen field andadjust to University study within a strong support structure",
        "level": "Major",
        "url": "/Undergraduate/specialisations/2020/REGZE1",
        "name": "UNSW Prep Program17-19 Science",
        "faculty": "dvcacademicboardofstudies",
        "faculty_code": "5fa56ceb4f0093004aa6eb4f0310c7b3",
        "programs": [
            6115
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "36",
        "code": "VISNB2",
        "description": "Vision Science is the science of how we see. It includes the optics of lenses, the anatomy and physiology of the eye and other relevant parts of the body, the psychophysics of vision and the visual neuroscience.",
        "level": "Minor",
        "url": "/Undergraduate/specialisations/2020/VISNB2",
        "name": "Vision Science",
        "faculty": "science",
        "faculty_code": "57a56ceb4f0093004aa6eb4f0310c7ae",
        "programs": [
            3962,
            3970
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "48",
        "code": "VISNBH",
        "description": "The School of Optometry and Vision Science offers an honours stream in Vision Science. The school's approach to honours is to provide initial training for future leaders in vision science. Honours in Vision Science provides students the opportunity to engage in sustained research in order to develop advanced disciplinary knowledge in Vision Science, the use of specialised techniques relevant to their chosen research area, critical thinking, evaluation and synthesis of information for scientific research communication in both oral and written forms. These skills and the learning objectives will form the basis for future pursuits in vision research and research and development in the ophthalmic industry.\nStudents will also have the opportunity to:\nUse effective communication skills to present information in a convincing mannerShow Strong information literacy skills by conducting an analytical literature reviewWork effectively to explore a research topic\nBy the end of the program, students will be able to:\nConduct a thorough literature reviewDesign and implement a research planCollect and analyse dataPresent an oral presentation at a research seminarWrite a scientific paper",
        "level": "Honours",
        "url": "/Undergraduate/specialisations/2020/VISNBH",
        "name": "Vision Science",
        "faculty": "science",
        "faculty_code": "57a56ceb4f0093004aa6eb4f0310c7ae",
        "programs": [
            3962,
            4500
        ]
    },
    {
        "study_level": "Undergraduate",
        "credit_points": "84",
        "code": "VISNA1",
        "description": "Vision Science is the study of the sensory processes that underlie vision and understanding of vision-related technologies. \nIt is designed for students who wish to pursue a laboratory/industry focused research career by providing broad and coherent knowledge in relevant topics such as: Optics, anatomy and functioning of the eye, eye disorders, clinical optometry, ocular therapy, sensation and perception, psychophysics, and research design and methods.",
        "level": "Major",
        "url": "/Undergraduate/specialisations/2020/VISNA1",
        "name": "Vision Science",
        "faculty": "science",
        "faculty_code": "57a56ceb4f0093004aa6eb4f0310c7ae",
        "programs": [
            3435,
            3925,
            3962,
            3970,
            3987
        ]
    }
]